[{"objectid":13702,"districtoccur":"06","age":42,"mvc_reason":"WHILE ON PATROL NB ON 200 N COLUMBUS BLVD, I WAS DIRECTLY BEHIND THIS VEHICLE. THE VEHICLE WAS OPERATING DURING NIGHT DARKNESS WITH NO FRONT OR REAR LIGHTS ACTIVATED. UPON RUNNING A BMV CHECK THE VEHICLE MADE A QUICK U-TURN TO TRAVEL SB. I ACTIVATED MY EMERGENCY LIGHTS AT WHICH TIME THE VEHICLE ATTEMPTED TO TURN WB ON RACE ST WHICH IS ONE-WAY EB. UPON ACTIVATED MY SIREN THE VEHICLE OVER CORRECTED GOING UP ON THE SIDEWALK THEN BACK ON THE ROADWAY. THE VEHICLE THEN CONTINUED AT A SLOW SPEED FOR AP","geometry":{"type":"Point","coordinates":[-75.1399,39.9539]}},{"objectid":14281,"districtoccur":"12","age":45,"mvc_reason":"POLICE OSERVED LISTED VEHICLE TRAVELING W/B ON 6500 BUIST AVE STOP IN THE MIDDLE OF THE CROSSWALK AT THE INTERSECTION OF 66TH AND BUIST AT  THE RED LIGHT.  DRIVER RUN THROUGH NCIC/PCIC, CBI.","geometry":{"type":"Point","coordinates":[-75.2302,39.9201]}},{"objectid":16185,"districtoccur":"24","age":31,"mvc_reason":"OPERATOR OF VEHICLE WAS OBSERVED BY POLICE PARKED ON THE SIDEWALK. WHILE CONDUCTING A VEHICLE INVESTIGATION, TAG DID NOT MATCH VEHICLE. UPON FURTHER INVESTIGATION MALE PROVIDED INFO THAT HE WAS IN THE PROCESS OF SWITCHING HIS TAGS. NCIC/PCIC CAME BACK WITH NEGATIVE RESULTS. MALE ADVISED TO PARK VEHICLE AND NOT TO OPERATE FURTHER.","geometry":{"type":"Point","coordinates":[-75.1134,39.9965]}},{"objectid":16572,"districtoccur":"24","age":31,"mvc_reason":"STOPPED AT RED LIGHT BLOCKING CROSSWALK. ALSO MADE IMPROPER LEFT SIGNS POSTED. POLICE WAVED HIM TO GO STRAIGHT MALE STILL TURNED LEFT. VERBAL ISSUED","geometry":{"type":"Point","coordinates":[-75.1134,39.9965]}},{"objectid":21137,"districtoccur":"03","age":25,"mvc_reason":"VEH OBSERVED E/B 1100 PATTISON AVE FAIL TO STOP FOR PED IN CROSSWALK.","geometry":{"type":"Point","coordinates":[-75.1686,39.9047]}},{"objectid":24516,"districtoccur":"24","age":26,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING S/B ON 2800 KENSINGTON AVE WITH HEAD LIGHTS NOT TURNED ON (4403-A)WHILE SPEAKING WITH DRIVER POLICE OBSERVED PIN POINT PUPILS, JITTERY BEHAVIOR, AND STARRING. VEHICLE HAD NUMEROUS EMPTY HEROIN PACKETS ON THE FLOOR. POLICE CONDUCTED SFST ON SIDEWALK NEXT TO VEHICLE. OPERATOR TRANSPORTED TO PDU FOR PROCESSING.","geometry":{"type":"Point","coordinates":[-75.1225,39.9915]}},{"objectid":26751,"districtoccur":"12","age":19,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE PARKED ON THE SIDEWALK AT THE ABOVE LOCATION. POLICE STOPPED THE VEH FOR INV.MALES WERE ALSO SMOKING AN UINRECOVERABLE AMOUNT OF MARIUJUANA. VEH AND OCCUPANTS RETURNED NO WANTS NCIC/PCIC.CBI","geometry":{"type":"Point","coordinates":[-75.2291,39.9449]}},{"objectid":31373,"districtoccur":"22","age":32,"mvc_reason":"LISTED VEHICLE OBSERVED PARK ON CURB IMPEDING THE PASSAGE OF PEDESTRIANS.  DURING APPROACH PASSENGER ATTEMPTED TO EXIT VEH AND TOLD TO GET BACK IN VEHICLE. DRIVER OBSERVED MAKING SEVERAL MOVEMENTS ALSO. WHILE ASKING FOR VEH CREDENTIALS HE WAS INSTRUCTED TO  TOP REACHING AROUND. UPON FURTHER INVESTIGATION DUE TO THE MOVEMENTS RECOVERED WAS A FIREARM FROM THE CENTER CONSOLE","geometry":{"type":"Point","coordinates":[-75.1793,39.994]}},{"objectid":37814,"districtoccur":"18","age":28,"mvc_reason":"WHILE RESPONDING TO A ROBP POINT OF GUN AT 1 S. 60TH ST. THE LISTED VEHICLE WAS DOUBLE PARKED BLOCKING THE HIGHWAY AT 5900 LUDLOW ST. POLICE SIGNALED FOR THE VEHICLE TO MOVE BUT THE VEHICLE STAYED BLOCKING THE HIGHWAY. THE REAR SEAT PASSENGER THEN EXITED THE VEHICLE AND WALKED TOWARDS THE SIDEWALK. POLICE AGAIN SIGNALED FOR THE VEHICLE TO MOVE BUT THE VEHICLE STAYED BLOCKING THE HIGHWAY. POLICE STOPPED THE VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECK, NO WANTS. BMV CHECK REVEALED THE OPERATOR OF T","geometry":{"type":"Point","coordinates":[-75.239,39.9609]}},{"objectid":36086,"districtoccur":"25","age":28,"mvc_reason":"POLICE WERE TRAVELING EAST BOUND ON 700 W LUZERNE WHEN POLICE OBSERVED THE ABOVE VEHICLE PARKED RUNNING BLOCKING THE PEDESTRIAN INTERSECTION, THE HANDY CAP RAMP AND A FIRE HYDRANT. THE VEHICLE ALSO HAD HEAVY TINT ON ALL WINDOWS INCLUDING THE FRONT WINDSHIELD. POLICE OBSERVED THE ABOVE OPERATOR WALKING AWAY FROM THE VEHICLE AND HEADING INTO THE CORNER STORE. THE PASSENGER EXITED THE FROM THE FRONT PASSENGER SEAT AND BEGAN WALKING TO THE CORNER STORE. AS POLICE EXITED THE RPC AND APPROACHED THE VE","geometry":{"type":"Point","coordinates":[-75.1395,40.0124]}},{"objectid":46444,"districtoccur":"24","age":17,"mvc_reason":"VEHICLE WAS OSBERVED WITH FRONT WINDSHIELD TINT, CREATING A HAZARD FOR VEHICLES OR PEDESTRIANS IN FRONT OF IT. THE VEHICLE ALSO PULLED INTO AND PARKED IN A HANDICAP SPOT WITH SIGNS CLEARLY POSTED WITH NO HANDICAP PLACARD DISPLAYED IN THE VEHICLE. THE VEHICLE WAS STOPPED FOR INV. NO WANTS PER NCIC/PCIC","geometry":{"type":"Point","coordinates":[-75.098,39.9908]}},{"objectid":45692,"districtoccur":"07","age":29,"mvc_reason":"POLICE OBSERVED THE DEF DRIVE W/B AT ABOVE LOCATION AT HIGH RATE OF SPEED ON THE SHOULDER TO PASS TRAFFIC WHICH WAS TRAVELING AT A NORMAL SAFE OPERATING SPEED CAUSING AN UNSAFE CONDITION FOR OTHER MOTORISTS AND PEDESTRIANS","geometry":{"type":"Point","coordinates":[-74.9944,40.1193]}},{"objectid":44934,"districtoccur":"25","age":30,"mvc_reason":"THE ABOVE VEHICLE MADE A LEFT TURN AND FAILED TO YIELD TO ONCOMING TRAFFIC. THE VEHICLE THEN PARKED ON THE CORNER BLOCKING THE PEDESTRIAN WALK WAY AND RAMP. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1357,40.0183]}},{"objectid":51768,"districtoccur":"18","age":82,"mvc_reason":"POLICE OBSERVED VEHICLE TRVAELINGN/B @ ABOVE LOC. WHERE VEHICLE WAS TRAVELING IN THE BIKE BIKE LANE , VEHICLE STOPPED FOR INVESTIGATION , NCIC PCIC NEGATIVE RESULTS . VERBAL WARNING GIVEN TO DRIVER","geometry":{"type":"Point","coordinates":[-75.2085,39.9564]}},{"objectid":50399,"districtoccur":"12","age":22,"mvc_reason":"POLICE OBSERVED LISTED VEHICE DOUBLE PARKING BLOCKING PEDESTRIAN TRAFFIC FOR INTERSECTION BOTH N &AMP;S BOUND, LISTED VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC YIELDS NO WANTS. VERBAL WARNING ISSUED","geometry":{"type":"Point","coordinates":[-75.2241,39.9407]}},{"objectid":50227,"districtoccur":"12","age":25,"mvc_reason":"POLICE OBSERVED LISTED VEHICE DOUBLE PARKING BLOCKING PEDESTRIAN TRAFFIC FOR INTERSECTION BOTH N &AMP;S BOUND, LISTED VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC YIELDS NO WANTS. VERBAL WARNING ISSUED","geometry":{"type":"Point","coordinates":[-75.2241,39.9407]}},{"objectid":53147,"districtoccur":"25","age":29,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE TRAVELING N/B ON 3200 B ST. VEHICLE PASSED TWO VEHICLE ON THE RIGHT USING THE BIKE LANE. VEHICLE STOPPED FOR MVC VIOLATION. NCIC/PCIC ON THE VEHICLE AND THE OPERATOR WITH NO WANTS. VERBAL WARNING ISSUED. BWC ACTIVATED. HIGH CRIME AREA.","geometry":{"type":"Point","coordinates":[-75.1252,39.9988]}},{"objectid":58556,"districtoccur":"24","age":15,"mvc_reason":"VEH OBSERVED N ON KENSINGTON AND MAKE A RIGHT ONTO ALLEGHENNY AT A HIGH RATE OF SPEED CAUSING PEDESTRIANS TO JUMP OUT OF THE WAY","geometry":{"type":"Point","coordinates":[-75.1134,39.9965]}},{"objectid":63882,"districtoccur":"06","age":75,"mvc_reason":"TRAVELING WEST ON MARKET ST THE VEHICLE MADE A LEFT IN FRONT OF ONCOMING TRAFFIC AND FAILED TO YIELD TO PEDESTRIANS AT THE CHANGE OF THE RED LIGHT. WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1504,39.9507]}},{"objectid":69685,"districtoccur":"24","age":22,"mvc_reason":"VEHICLE OBSERVED STOPPED IDLING ON THE NORTHEAST CORNER OF ELLA AND INDIANA STREETS, PARTIALLY BLOCKING THE CROSSWALK, MAKING IT A HAZARD FOR PEDESTRIANS CROSSING. THE VEHICLE THEN EXITED THE SPOT AND PROCEEDED NORTH. THE VEHICLE HAD PROHIBITED TINT ON ALL WINDOWS. AN NCIC/PCIC CHECK ALSO REVEALED NO RESULTS. THE VEHICLE WAS STOPPED FOR INV. AFTER A NCIC/PCIC CHECK OF THE VIN, NO WANTS WERE REVEALED.","geometry":{"type":"Point","coordinates":[-75.1257,39.9965]}},{"objectid":85961,"districtoccur":"24","age":39,"mvc_reason":"STOPPED ON SIDEWALK","geometry":{"type":"Point","coordinates":[-75.1274,39.9952]}},{"objectid":85783,"districtoccur":"24","age":29,"mvc_reason":"DRIVER WAS BLOCKING SIDEWALK MAKING PEDESTRIAN WALK INTO THE STREET TO GET BY WHILE IDLING CREATING A HAZARD.   ONCE POLICE APPROACHED MALE STATED HE WAS THERE FOR A FLAT TIRE BUT THE VEHICLES TIRES WERE PERFECTLY FINE.  POLICE NOTICED THE MALE WAS NERVOUS AND AT ONE POINT ATTEMPTED TO FLEE FROM POLICE.  INVESTIGATION SHOWED THE MALE WAS JUST &QUOT;TRYING TO GET HIGH&QUOT;.","geometry":{"type":"Point","coordinates":[-75.1274,39.9952]}},{"objectid":86061,"districtoccur":"24","age":49,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING AFTER BEING PARKED ON THE SIDEWALK  N/B ON THE 3000 BLOCK OF E.CAMBRIA ST WITH HEAVY DARK TINTS ON ALL FOUR SIDE WINDOWS AND REAR WINDSHIELD. NCIC/PCIC  CHECK NO WANTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1274,39.9952]}},{"objectid":91261,"districtoccur":"18","age":35,"mvc_reason":"VEHICLE WAS OBSERVED BY POLICE TURNING FROM N/B 58TH TO E/B SPRUCE WHEN IT FAILED TO YIELD TO TWO PEDESTRIANS IN THE CROSSWALK. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC/BMV, NO WANTS. MALE WARNED AND RELEASED. \n\nMVC 3112A3-FAILURE TO YIELD TO PEDESTRIANS IN CROSSWALK","geometry":{"type":"Point","coordinates":[-75.2379,39.9561]}},{"objectid":93687,"districtoccur":"02","age":24,"mvc_reason":"VEH WAS THIRD IN LINE AT LIGHT TRAVELLING SOUTHBOUND. AS LIGHT TURNED GREEN, VEHICLE SUDDENLY PULLED INTO THE TURN LANE ON THE LEFT, ACCELERATED, AND PASSED RIGHT OF WAY SB VEHICLES WITH NO REGARD FOR PEDESTRIANS, NB TRAFFIC, OR THE MARKED RPC BEHIND HIM. WARNING ISSUED, CBI","geometry":{"type":"Point","coordinates":[-75.0894,40.0347]}},{"objectid":94570,"districtoccur":"24","age":23,"mvc_reason":"POLICE OBSERVED VEHICLE NORTHBOUND ON FRONT STREET AT ALLEGHENY DISREGARD STEAD RED AND STOP IN PAST PEDESTRIAN WALKWAY OF INTERSECTION. VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.1293,39.9985]}},{"objectid":104880,"districtoccur":"25","age":30,"mvc_reason":"THE ABOVE VEHICLE WAS PASSING SEVERAL VEHICLES ON THE BIKE LANE. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1242,40.0039]}},{"objectid":103433,"districtoccur":"19","age":20,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE TRAVELING E/B ON MARKET AND MAKE A LEFT TURN ONTO 63RD ST NEARLY STRIKING 2 PEDESTRIANS CROSSING THE ST. POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECK NO WANTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2468,39.9627]}},{"objectid":108912,"districtoccur":"09","age":30,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELLING NB ON BROAD AT WALNUT STREET, MAKE A LEFT TURN ONTO WALNUT FROM THE FAR RIGHT LANE. ADDITIONALLY &QUOT;NO TURNS&QUOT; SIGNS ERECT AND VISIBLY POSTED PROHIBITING THIS MOVEMENT. INFRACTION OCCURED WITHIN A HIGH PEDESTRIAN FOOT TRAFFIC INTERSECTION. THIS IS A VIOLATION OF PA MVC 3331 (COMPLIANCE WITH TRAFFIC-CONTROL DEVICES). VEHICLE STOPPED FOR INVESTIGATION IMMEDIATELY UPON ACTIVATION OF AUDIBLE SIRENS AND LIGHTS. NCIC/PCIC CHECK, YIELDING OPERATOR OLN 30","geometry":{"type":"Point","coordinates":[-75.1642,39.9493]}},{"objectid":109016,"districtoccur":"25","age":28,"mvc_reason":"VEH OBS W/ ALL FRONT, SIDE, AND REAR GLASS OBSCURED BY NEAR OPAQUE BLACK TINT ILLEGALY PARKED AND OCCUPIED ON SIDEWALK OF 2800 MUTTER ST. INVEST PROVIDED OPERATOR POSSESSED THREE FIREARMS INSIDE VEHICLE AS WELL AS NARCOTICS. OPERATOR PRESENTED VALID LTCF #5100090073. ALL FIREARMS AND NARCOTICS OBSERVED IN PLAINVIEW WERE RECOVERED. OPER LTCF CONFISCATED. VEH SECURED AND TRANSPORTED TO M&AMP;W FOR EXECUTION OF S&AMP;S WARRANT. OCCUPANTS CBI. WARRANT #259107 WAS APPROVED AND EXECUTED ON THE VEH WIT","geometry":{"type":"Point","coordinates":[-75.133,39.9928]}},{"objectid":109384,"districtoccur":"25","age":28,"mvc_reason":"VEH OBS W/ ALL FRONT, SIDE, AND REAR GLASS OBSCURED BY NEAR OPAQUE BLACK TINT ILLEGALY PARKED AND OCCUPIED ON SIDEWALK OF 2800 MUTTER ST. INVEST PROVIDED OPERATOR POSSESSED THREE FIREARMS INSIDE VEHICLE AS WELL AS NARCOTICS. OPERATOR PRESENTED VALID LTCF #5100090073. ALL FIREARMS AND NARCOTICS OBSERVED IN PLAINVIEW WERE RECOVERED. OPER LTCF CONFISCATED. VEH SECURED AND TRANSPORTED TO M&AMP;W FOR EXECUTION OF S&AMP;S WARRANT. OCCUPANTS CBI. WARRANT #259107 WAS APPROVED AND EXECUTED ON THE VEH WIT","geometry":{"type":"Point","coordinates":[-75.133,39.9928]}},{"objectid":114186,"districtoccur":"06","age":37,"mvc_reason":"DRIVER OBSERVED WEST ON LOCUST ST, ATTEMPTING TO TURN LEFT ONTO SOUTH BOUND S. BROAD ST. A BICYCLIST WAS ATTEMPTING TO CROSS, BROAD ST AND WAS IN THE CROSSWALK WITH THE RIGHT OF WAY WHEN DRIVER TURNED IN FRONT OF HIM. NCIC/PCIC NO WANTS. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1646,39.9482]}},{"objectid":116444,"districtoccur":"24","age":19,"mvc_reason":"POLICE OBSERVED OPERATOR TRAVELING AT A HIGH RATE SPEED WHILE CIRCLING THE LOT WHERE PARKED CARS AND PEDESTRIANS ARE. TVR ISSUED.","geometry":{"type":"Point","coordinates":[-75.1039,39.9898]}},{"objectid":121287,"districtoccur":"02","age":45,"mvc_reason":"POLICE OBSERVED THE VEHICLE TRAVELING NORTH ON THE SIDEWALK OF 5700 SUMMERDALE AVE THEN OVERTAKE A VEHICLE ON THE LEFT ON A DOUBLE YELLOW LINE AND THEN PROCESSED TO TRAVEL AT A HIGH RATED SPEED NORTH ON SUMMERDALE IN A SCHOOL ZONE (FELS HIGH SCHOOL). TVR ISSUED ON TRACKS","geometry":{"type":"Point","coordinates":[-75.0906,40.0334]}},{"objectid":125995,"districtoccur":"25","age":27,"mvc_reason":"VEHICLE OBSERVED TRAVELING NORTH ON G STREET APPROACHING WESTMORELAND AT A HIGH RATE OF SPEED THROUGH A SCHOOL ZONE. WHILE CATCHING UP TO THE VEHICLE, POLICE PACED THE VEHICLE OVER THE SPEED LIMIT. SCHOOL ON LOCATION WAS LETTING OUT AND THE AREA HAD A HIGH VOLUME OF PEDESTRIANS. THE VEHICLE WAS STOPPED FOR INV. NO WANTS PER NCIC/PCIC. THE OPERATOR WAS GIVEN A VERBAL WARNING AND RELEASED.","geometry":{"type":"Point","coordinates":[-75.1154,39.997]}},{"objectid":128921,"districtoccur":"18","age":15,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING SOUTH BOUND ON THE UNIT BLOCK OF SOUTH 52ND STREET. POLICE OBSEVERED OPERATOR STOPPING IN THE MIDDLE OF THE CROSSWALK WHICH WAS INTERFERING WITH PEOPLE WALKING ACROSS THE STREET. POLICE STOPPED VEHICLE FOR INVEST. UPON APPROACH POLICE OBSERED OPERATOR OF VEHICLE BREATHING VERY HEAVILY, UNCONTROLLABLY HAND SHAKING AND LOOKING ALL AROUND TOWARDS STREET SIGNS AS IF HE WAS TRYING TO GET AWAY. POLICE ASKED MALE TO STEP OUT THE VEHICLE TO FRISK IMMEDIATE DUE TO NERVOU","geometry":{"type":"Point","coordinates":[-75.2251,39.9585]}},{"objectid":129342,"districtoccur":"18","age":20,"mvc_reason":"VEHICLE OBSERVED TRAVELING NORTHBOUND ON 56TH ST THEN WESTBOUND ON  MONTROSE WHERE VEHICLE PULLED ONTO SIDEWALK STILL MOVING WESTBOUND, VEHICLE STOPPED FOR INVESTIGATION. POLICE ASKED OCCUPANTS OF VEHICLE FOR LICENSE, REGISTRATION AND INSURANCE. BOTH OCCUPANTS PRODUCE THERE ID THROUGH THERE CELL PHONE. POLICE ASKED IF ANYONE HAD A PERMIT TO CARRY. BOTH OCCUPANTS RESPONDED &QUOT;NO&QUOT;. POLICE OBSERVED A BULGE IN OPERATORS FRONT LEFT SWEATER POCKET. WHEN POLICE ASKED WHAT&APOS;S IN THE POCKET.","geometry":{"type":"Point","coordinates":[-75.2356,39.9479]}},{"objectid":131680,"districtoccur":"25","age":35,"mvc_reason":"THE ABOVE MALE WAS RIDDING HIS BIKE THE WRONG WAY WEST BOUND ON CAMBRIA. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1306,39.994]}},{"objectid":134338,"districtoccur":"12","age":23,"mvc_reason":"POLICE OBS. VEHICLE DRIVING ON SIDEWALK E/B ON 6100 ELMWOOD AVENUE AND BLOCKING THE SIDEWALK COMPLETELY OF PEDESTRIAN FLOW. POLICE STOPPED FOR INVESTIGATION AND NCIC/PCIC QUERY RESULTED IN NEGATIVE RESULTS, NO WANTS. POLICE ISSUED VERBAL WARNING FOR VIOLATION.","geometry":{"type":"Point","coordinates":[-75.2249,39.926]}},{"objectid":138827,"districtoccur":"17","age":28,"mvc_reason":"VEHICLE OBSERVED DOUBLE PARKED BLOCKING THE HIGHWAY SOUTHBOUND LANES AS OPERATOR CONDUCTED A CONVERSATION WITH A PEDESTRIAN FOR SEVERAL MINUTES, HOLDING UP TRAFFIC. NCIC/PCIC CHECKED WITH NEGATIVE RESULTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1867,39.9322]}},{"objectid":145420,"districtoccur":"01","age":68,"mvc_reason":"OBSERVED VEHICLE STOP AT RED SIGNAL WITH WITH RIGHT TURN SIGNAL ON . WHEN LIGHT TURNED GREEN VEHICLE PROCEEDED TO MAKE RIGHT TURN FROM 17TH STREET TO SYNDER AVENEUE. WHILE MAKING RIGHT TURN OBSERVED A PEDSTRIAN IN CROSSWALK COMING FROM SOUTH SIDE OF SNYDER AVE TO NORTH SIDE IN FRONT OF TURNING VEHICLE. VEHICLE FAILED TO YIELD TO PEDSTRIAN IN CROSSWALK. STOP VEHICLE FOR INVESTIGATION ,BMV/NCIC/PCIC CHECK NO WANTS. VERBAL WARNING GIVEN .","geometry":{"type":"Point","coordinates":[-75.1745,39.925]}},{"objectid":145929,"districtoccur":"19","age":22,"mvc_reason":"POLICE WERE TRAVELLING S/B TOWARDS 6300 HAVERFORD AVE WHEN POLICE OBSERVED LISTED MALE WITH HEAVY TINT AROUND ALL VEHICLE AND FRONT WINDSHIELD, HEAVY TINT CAUSES A HAZARDOUS ENVIRONMENT TO THE OPERATOR, PEDESTRIANS AND POLICE DUE TO OBSTRUCTING WHAT&APOS;S INSIDE THE VEHICLE AND VISIBILITY TO THE OPERATOR. OPERATOR OF LISTED VEHICLE KEPT STOPPING AND CONTINUING ON UNTIL HE CAME TO A COMPLETE STOP AT 6300 CALLOWHILL. NCIC/PCIC CHECK SHOWED NO WANTS ON VEHICLE. UPON VEHICLE INVESTIGATION OPERATOR","geometry":{"type":"Point","coordinates":[-75.2449,39.9718]}},{"objectid":148995,"districtoccur":"03","age":32,"mvc_reason":"VEHICLE WAS OBSERVED TRAVELING NORTH BOUND ON BROAD STREET, MAKE A RIGHT TURN ONTO WASHINGTON AVE CUTTING OFF MULTIPLE PEDESTRIANS CROSSING THE STREET WITHIN THE CROSSWALK CAUSING A HAZARD, VEHICLE STOPPED FOR INVESTIGATION, NO WANTS VERBAL WARNING ISSUED","geometry":{"type":"Point","coordinates":[-75.1668,39.9379]}},{"objectid":148867,"districtoccur":"12","age":37,"mvc_reason":"POLICE OBSERVED VEHICLE WITH HEAVY TINT ON ALL ALL WINDOWS. POLICE COULD NOT SEE INSIDE OF THE VEHICLE. VEHICLE WAS ALSO BLOCKING THE ROADWAY, THE BIKE LANE AND TROLLY LANE. VEHICLE GAVE VERBAL WARNING TO OPERATOR FOR INFRACTIONS. PASSENGER WAS INVESTIGATED FOR NOT WEARING A SEATBELT WHILE VEHICLE WAS IN OPERATION. NCIC/PCIC CAME BACK WITH NEGATIVE RESULTS.","geometry":{"type":"Point","coordinates":[-75.2192,39.93]}},{"objectid":163484,"districtoccur":"35","age":42,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING SOUTHBOUND ON OGONTZ AV USE THE BIKE LANE ON THE RIGHT TO PASS OTHER FORWARD MOVING VEHICLES. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1499,40.0359]}},{"objectid":166676,"districtoccur":"25","age":26,"mvc_reason":"POLICE OBSERVED THE MALE TRAVELING SOUTHBOUND AT THE ABOVE LOCATION. THE MALE HAD NO LIGHTS OR REFLECTORS ON HIS BICYCLE DURING REQUIRED HOURS AND DISREGARDED A CLEARLY POSTED STEADY RED SIGNAL. POLICE ATTEMPTED TO STOP THE MALE AND HE FLED. WHILE FLEEING THE MALE WAS REACHING INTO HIS JACKET POCKETS AND THEN ATTEMPTED TO TURN AROUND AND FLEE IN THE OPPOSITE DIRECTION. THE MALE ATTEMPTED TO DRIVE HIS BIKE AROUND POLICE AND COLLIDED WITH OFFICERS ON FOOT. THE MALE WAS DETAINED AND POLICE CHECKED","geometry":{"type":"Point","coordinates":[-75.1183,40.0208]}},{"objectid":169902,"districtoccur":"06","age":56,"mvc_reason":"DRIVING IN LANE MARKED FOR BIKE USE ONLY","geometry":{"type":"Point","coordinates":[-75.1551,39.9667]}},{"objectid":181971,"districtoccur":"12","age":37,"mvc_reason":"POLICE OBSERVED THE LISTED VEH TRAVELING N/B ON ABOVE LOCATION WITH BOTH LICENSE PLATE LIGHTS NOT FUNCTIONING AND  BIKE RACK PARTIALLY BLOCKING THE PLATE MAKING IT UNREADABLE. VEH STOPPLED FOR INVESTIGATION. NCIC PCIC CHECK YIELDED NEG RESULTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2323,39.9367]}},{"objectid":180690,"districtoccur":"24","age":29,"mvc_reason":"VEHICLE OBERVED WEST ON INDIANA AVE WITH HEAVY FRONT WINDSHIELD TINT, MAKING IT HAZARDOUS FOR VEHICLES AND PEDESTRIANS IN FRONT OF IT. THE VEHICLE WAS STOPPED FOR INV. NO WANTS PER NCIC/PCIC.","geometry":{"type":"Point","coordinates":[-75.126,39.9949]}},{"objectid":183993,"districtoccur":"16","age":36,"mvc_reason":"POLICE TRAVELING EASTBOUND ON W. GIRARD AVE TOWARDS 38TH ST. OBSERVED THE VEHICLE TRAVELING WESTBOUND ON W. GIRARD AVE CUT THROUGH THE SUNOCO PARKING LOT AT A HIGH RATE OF SPEED AND ALMOST HIT A PEDESTRIAN WALKING DOWN 38TH ST. INSTEAD OF TURNING LEFT ON W. GIRARD AVE ONTO 38TH ST. VEHICLE RAN NCIC PCIC WITH NEGATIVE RESULTS.","geometry":{"type":"Point","coordinates":[-75.1984,39.9748]}},{"objectid":192341,"districtoccur":"18","age":32,"mvc_reason":"POLICE WERE STOPPED AT THE TRAFFIC LIGHT ON THE 400 BLOCK OF SOUTH 56TH ST WAITING FOR A PEDESTRIAN TO CROSS THE CROSS WALK WHEN THE LISTED VEHICLE WENT INTO THE ONCOMING TRAFFIC LANE AND PASSED POLICE. POLICE STOPPED THE VEH FOR INVESTIGATION NCIC/PCIC CHECKED NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2342,39.9545]}},{"objectid":192002,"districtoccur":"14","age":24,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE TRAVELING S/B AT THE ABOVE LOCATION CROSS THE DOUBLE YELLOW LINE TO GO AROUND A BUS ALMOST HIT A PEDESTRIAN. THE VEHICLE CAUSED THE PEDESTRIAN TO JUMP BACK AND THEN RUN FORWARD. WHEN POLICE ATTEMPTED TO STOP THE VEHICLE THE DRIVER JUMPED OUT OF THE VEHICLE AS IF HE WAS GOING TO RUN. POLICE OBSERVED A FIREARM IN THE PASSENGER SEAT THAT WAS PARTIALLY COVERED BY A SHIRT, DRIVER HAD A VALID PERMIT TO CARRY. NCIC/PCIC CHECKED DRIVER ISSUED A VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.1708,40.0491]}},{"objectid":210459,"districtoccur":"01","age":34,"mvc_reason":"VEH WAS DOUBLE PARKED IN A BIKE LANE WITH DARK TINTED WINDOWS AND NO FLASHERS OPERATING. NCIC/PCIC NO WANTS VERBAL WARNING GIVEN CBI.","geometry":{"type":"Point","coordinates":[-75.1746,39.925]}},{"objectid":208497,"districtoccur":"06","age":45,"mvc_reason":"OBSERVED A SILVER SEDAN TRAVELING NORTH ON 13TH STREET RACE STREET IN THE BIKE LANE. OPERATOR ADVISED. NCIC/PCIC NO WANTS.","geometry":{"type":"Point","coordinates":[-75.1606,39.9562]}},{"objectid":208874,"districtoccur":"02","age":17,"mvc_reason":"FEM WAS SEEN FLEEING AN ILLEGAL CAR MEET AT HIGH RATE FEM USED AN AUTOMATED COVER TO BLACK OUT HER TAG AND THEN GO ONTO THE SIDEWALK AND THRU STOP SIGN","geometry":{"type":"Point","coordinates":[-75.1011,40.0334]}},{"objectid":243215,"districtoccur":"39","age":23,"mvc_reason":"VEH OBSERVED N/B ON 29TH ST. PASS NUMEROUS VEHICLES ON RIGHT UTILIZING BIKE/CURB LANE THEN GO THRU STEADY RED LIGHT CONTINUING ON 29TH ST. VEH. DISREGARDED LIGHT AT 29 AND HUNTING PARK AVE AND PROCEED E/B ON HUNTING PARK GETTING IN LEFT TURN LANE INTO THE SHOPPING CENTER WHERE POLICE CONDUCTED A TRAFFIC STOP.","geometry":{"type":"Point","coordinates":[-75.175,40.0069]}},{"objectid":243972,"districtoccur":"25","age":56,"mvc_reason":"POLICE ACTING AS 25T9 STOPPED ON THE INTERSECTION OF B ST &AMP; WYOMING AVE SHORTLY AFTER BEING FLAGGED DOWN BY SCHOOL CROSSING GUARDS. DURING WHICH LISTED VEHICLE ENTERED ONCOMING TRAFFIC AND WHILE STILL ON THE ONCOMING LANE PASSED MULTIPLE VEHICLES AND JUVENILE PEDESTRIANS AT A HIGH RATE OF SPEED. THIS OCCURRED IN A SCHOOL ZONE. POLICE THEN ATTEMPTED TO STOP VEHICLE FOR INVESTIGATION USING OVERHEADS LIGHTS BUT LISTED VEHICLE CONTINUED TO EVADE POLICE AT A HIGH RATE OF SPEED. VEHICLE INVESTIGAT","geometry":{"type":"Point","coordinates":[-75.1204,40.0211]}},{"objectid":262870,"districtoccur":"22","age":29,"mvc_reason":"VEH OBSERVED E/B PASSING STOPPED TRAFFIC ON RIGHT USING CURB AND BIKE LANE ALMOST COLLIDING WITH ANOTHER CAR  AT 18TH ST WHO WAS MERGING INTO TRAFFIC LEGALLY.","geometry":{"type":"Point","coordinates":[-75.161,39.9947]}},{"objectid":270660,"districtoccur":"24","age":26,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING N/B ON THE 3300 BLOCK OF ARGYLE ST AFTER IT WAS PARKED ON THE PEDESTRIAN WALKWAY W/HEAVY DARK TINTS ON ALL FOUR SIDE WINDOWS AND REAR WINDSHIELD. NCIC/PCIC CHECK FOR THE VEHICLE CAME BACK WITH NEG RESULTS. THE MALE OPERATOR CAME BACK WITH A WARRANT OCA 2021-24-007133 PER NCIC/PCIC CHECK. THE WARRANT UNIT WAS CONTACTED AND COULD NOT VERIFY THE WARRANT. VERBAL WARNING GIVEN. MALE OPERATOR WAS CBI.","geometry":{"type":"Point","coordinates":[-75.112,39.998]}},{"objectid":292430,"districtoccur":"06","age":64,"mvc_reason":"OBSERVED A BLACK SEDAN TRAVELING NORTH ON 13TH STREET TOWARDS ARCH STREET IN THE BIKE LANE. OPERATOR ADVISED. NCIC?PCIC NO WANTS","geometry":{"type":"Point","coordinates":[-75.161,39.9541]}},{"objectid":278174,"districtoccur":"06","age":67,"mvc_reason":"DRIVING IN LANE MARKED FOR BIKES ONLY","geometry":{"type":"Point","coordinates":[-75.1568,39.9662]}},{"objectid":314021,"districtoccur":"24","age":22,"mvc_reason":"PARKING IN A CROSSWALK","geometry":{"type":"Point","coordinates":[-75.1092,39.9967]}},{"objectid":308052,"districtoccur":"35","age":44,"mvc_reason":"DRIVER OF ABOVE VEHICLE OBSERVED FACING NB ON 6100 N 3RD ST. STOPPED AT THE RED LIGHT. DRIVER THEN MADE A RIGHT HAND TURN ON RED SIGNAL, DESPITE SIGNS POSTED &QUOT;NO TURN ON RED&QUOT; AND TRAVEL EB ON GODFREY AV. A PEDESTRIAN WAS ATTEMPTING TO CROSS 3RD ON GODFREY IN THE CROSS WALK AT THE TIME. BMV CHECK REVEALED NO WANTS, AND DRIVER GIVEN A VERBAL WARNING. BWC ACTIVATED.","geometry":{"type":"Point","coordinates":[-75.1259,40.044]}},{"objectid":301984,"districtoccur":"18","age":21,"mvc_reason":"POLICE OBSERVED LISTED MALE TRAVELING E/B ON LUDLOW ON A BLACK BICYCLE WITH NO FRONT HEADLAMP AND ALSO ON SIDEWALK. POLICE DROVE UP TO MALE AND ORDERED HIM TO STOP. MALE WAS INITIALLY UNCOOPERATIVE AND WOULD NOT ID HIMSELF AND STATED HE HAD AN ID ON HIM. MALE DID NOT HAVE AN ID ON HIS PERSON. MALE EVENTUALLY GAVE HIS IDENTITY WHICH CAME BACK NEGATIVE ON NCIC/PCIC.","geometry":{"type":"Point","coordinates":[-75.2231,39.9592]}},{"objectid":328867,"districtoccur":"18","age":21,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE TRAVELING WESTBOUND ON MARKET ST TURN SOUTHBOUND ON 59TH ST WITHOUT YIELDING TO THE PEDESTRIANS IN THE CROSSWALK. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK NEGATIVE RESULTS VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2389,39.9609]}},{"objectid":343448,"districtoccur":"25","age":50,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED ON THE SIDEWALK WITH A DELEWARE TEMP TAG. POLICE RAN TEMP TAG THROUGH NCIC/ PCIC. TAG DID NOT BELONG TO VEHICLE. POLICE STOPPED VEHICLE FOR INVESTIGATION. CLEARED BY INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.1387,39.9966]}},{"objectid":342445,"districtoccur":"18","age":19,"mvc_reason":"VEHICLE OBSERVED TRAVELING SOUTHBOUND THROUGH THE SHOPPING CENTER PARKING LOT AT ABOVE LOCATION, THAT HAD HEAVY PEDESTRIAN TRAFFIC, VEHICLE WAS TRAVELING AT A HIGH RATE OF SPEED ENDANGERING PEDESTRIANS. VEHICLE STOPPED FOR INVESTIGATION. POLICE ACTIVATED LIGHTS AND SIRENS AND VEHICLE DID NOT STOP FOR APPROXIMATELY ONE BLOCK. UPON POLICE APPROACH MALES HANDS AND ARMS WERE SHAKING WHEN GIVING INFORMATION TO POLICE. MALE WAS ASKED OUT  OF VEHICLE AND FRISKED ALONG WITH HIS IMMEDIATE AREA. TVR ISSUE","geometry":{"type":"Point","coordinates":[-75.241,39.9456]}},{"objectid":323132,"districtoccur":"12","age":23,"mvc_reason":"VEHICLE WAS PARKED AND RUNNING, FACING SOUTHBOUND ON THE EASTSIDE SIDEWALK COMPLETELY BLOCK PEDESTRIAN TRAFFIC. POLICE STOPPED THE VEHICLE FOR FURTHER INVESTIGATION. RAN THROUGH PCIC/NCIC WITH NO WANTS. VERBAK WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.2311,39.9277]}},{"objectid":352771,"districtoccur":"18","age":29,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING W/B ON PINE ST WITH TINT SO HEAVY ALL AROUND POLICE COULD NOT SEE INSIDE. VEHICLE ALSO EXCEEDED WHITE CROSSWALK WHEN STOPPING AT STOP SIGN. VEHICLE THEN TURNED N/B ON S 61ST WHERE POLICE ACTIVATED LIGHTS WHERE VEHICLE PULLED OVER PROMPTLY. NCIC PCIC GOT NEG RESULTS. DRIVER WAS COOPERATIVE AND LET GO WITH WARNING","geometry":{"type":"Point","coordinates":[-75.2459,39.957]}},{"objectid":356369,"districtoccur":"24","age":29,"mvc_reason":"PROHIBITED ON SIDEWALK","geometry":{"type":"Point","coordinates":[-75.0979,40.0049]}},{"objectid":366800,"districtoccur":"14","age":22,"mvc_reason":"POLICE OBSERVED VEHICLE HEADING SOUTH ON WOOLSTON DRIVING INTO THE BIKE LANE PASSING VEHICLES WITHOUT USING TURN SIGNALS. NCIC/PCIC NEGATIVE. CBI.","geometry":{"type":"Point","coordinates":[-75.1639,40.0664]}},{"objectid":351859,"districtoccur":"24","age":33,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE BEING OPERATED NORTHBOUND ABOVE LOCATION PARKED ON THE SIDEWALK. POLICE NCIC/PCIC REVEALED THAT VEHICLE REIGSTERATION EXPIRED. NCIC/PCIC NEGATIVE RESULTS VERBAL WARNING ISSUED AND RELEASED AT ABOVE LOCATION.","geometry":{"type":"Point","coordinates":[-75.1046,39.9944]}},{"objectid":351864,"districtoccur":"24","age":20,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE BEING OPERATED NORTHBOUND ABOVE LOCATION PARKED ON THE SIDEWALK. POLICE NCIC/PCIC REVEALED THAT VEHICLE REIGSTERATION EXPIRED. NCIC/PCIC NEGATIVE RESULTS VERBAL WARNING ISSUED AND RELEASED AT ABOVE LOCATION.","geometry":{"type":"Point","coordinates":[-75.1046,39.9944]}},{"objectid":378389,"districtoccur":"24","age":27,"mvc_reason":"ABOVE MALE OPERATING VEHICLE EASTBOUND AT ABOVE LOCATION WENT DIRECTLY THROUGH REDLIGHT AT EMERALD AND ALLEGHENY AROUND TRAFFIC. THE OPERATOR CONTINUED EAST AND SLAMMED ON HIS BREAKS IN THE MIDDLE OF CROSSWALK AT ABOVE LOCATION WHEN HE SAW POLICE. MALE WAS STOPPED AT ABV LOCATION AND OPER AND PASSENGER WERE EXTREMELY NERVOUS.  WHEN ASKED  IF THERE WERE  ANY WEAPONS ON HIM AND HE REPLIED NO, THE PASSENGER ALSO STATED THERE WAS NO WEAPONS IN THE VEHICLE.  DUE TO HIS NERVOUS BEHAVIOR AND RECKLESS D","geometry":{"type":"Point","coordinates":[-75.1113,39.994]}},{"objectid":374689,"districtoccur":"25","age":28,"mvc_reason":"POLICE WAS AT INTERSECTION BLOCKING INDIANA AND 5TH ST DUE TO AN AUTO ACCIDENT. OPERATOR OF TOW TRUCK WENT AROUND POLICE VEHICLE, PARTIALLY DROVE ON THE SIDEWALK AT A HIGH RATE OF SPEED. POLICE FOLLOWED VEHICLE AND NOTICED TAG WAS PARTIALLY COVERED WITH BLK TAPE. NCIC/PCIC CLEAN. TVR ISSUED FOR OBSCURING LICENSE PLATE. OPERATOR WAS ADVISED","geometry":{"type":"Point","coordinates":[-75.1392,39.9968]}},{"objectid":377171,"districtoccur":"25","age":62,"mvc_reason":"POLICE OBSERVED DRIVER MAKE LEFT TURN WITHOUT YIELDING TO ONCOMING TRAFFIC NEARLY STRIKING PEDESTRIAN. STOPPED FOR INVESTIGATION. NCIC/PCIC- NO WANTS. WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1479,39.9933]}},{"objectid":375389,"districtoccur":"25","age":25,"mvc_reason":"POLICE OBSERVED THE ABOVE MALE OPERATING THE ABOVE DIRTBIKE ON THE EAST SIDEWALK OF 3100 N 8TH STREET. THE DIRTBIKE ATTMEPTED TO CUT BETWEEN TWO PARKED CARS AND GO BACK ONTO THE HIGHWAY WHEN IT GOT STUCK. POLICE STOPPED DIRT BIKE FOR MVC VIOLATIONS. NCIC/PCIC CHECK RAN ON THE VIN ENDING IN #0167 WHICH HAD COME BACK IN STOLEN STATUS (OCA #202221413 QUEEN ANNES CO SHERIFF&APOS;S OFFICE). OPERATOR PLACED UNDER ARREST AND TRANSPORTED TO 25TH CCTV. DIRT BIKE TOWED VIA M BAND BY ORTHODOX TOWING TO 524","geometry":{"type":"Point","coordinates":[-75.1438,39.9989]}},{"objectid":375793,"districtoccur":"24","mvc_reason":"SPEEDING IN BIKE LANE WITH NO TAG. VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.1178,39.9942]}},{"objectid":377258,"districtoccur":"24","age":30,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING N/B ON KENSINGTON AVE AT A HIGH RATE OF SPEED GOING AROUND OTHER VEHILCES AND DRIVING IN THE BIKE LANE. NCIC/PCIC NO WANTS. CLEARED BY POLICE INVESTIGATION.  VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.113,39.9968]}},{"objectid":382110,"districtoccur":"24","age":35,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING W/B ON ALLEGHENY WHEN VEHICLE DISREGARDING A STEADY RED SIGNAL ALMOST CAUSING AN ACCIDENT WITH TWO PEDESTRIANS CROSSING THE STREET. VEHICLE CHECKED THROUGH NCIC/PCIC WITH NO WANTS. VEHICLE CLEARED BY INVESTIGATION WITH A WARNING.","geometry":{"type":"Point","coordinates":[-75.1247,39.9979]}},{"objectid":383553,"districtoccur":"15","age":40,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE TRAVELING S/B FRANKFORD AVE OPERATING IN CARELESS DISREGARD FOR PERSONS WHILE FAILING TO YIELD TO PEDESTRIAN IN THE CROSSWALK.","geometry":{"type":"Point","coordinates":[-75.0782,40.0225]}},{"objectid":379075,"districtoccur":"03","age":43,"mvc_reason":"ABOVE MADE A LEFT TURN IN CLOSE PROXIMITY,, TO AN OLDER ADULT THAT WAS IN THE CROSS WALK THE PEDESTRIAN HAD TO STOP,FROM WALKING","geometry":{"type":"Point","coordinates":[-75.1469,39.9183]}},{"objectid":371264,"districtoccur":"16","age":38,"mvc_reason":"POLICE OBS DRIVER HEADING W/B ON SPRING GARDEN DRIVING IN BIKE LANE WHEN NO TRAFFIC WAS  BLOCKING HWY. DRIVER ALSO ALLOWED PASSENGER TO EXIT VEHICLE IN THE MIDDLE OF THE HWY ON A GREEN LIGHT AT 33/HAVERFORD. LYFT DRIVER-VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1885,39.9632]}},{"objectid":397298,"districtoccur":"16","age":27,"mvc_reason":"WHILE STOPPED FACING E/B ON LANCASTER AV POLICE OBSERVED MALE OPERATING LISTED VEHICLE TRAVELING W/B ON LANCASTER AV ENTER THE ONCOMING TRAFFIC LANE TO OVERTAKE A SEPTA BUS DISCHARGING PASSENGERS.  AS VEHCLE BEGAN TO PASS BUS PEDESTRIANS WERE ATTEMPTING TO CROSS, WITHIN THE CROSSWALK, THAT WERE NEARLY HIT BY OPERATOR AS HE CUT BACK IN FRONT OF THE BUS TO THE APPROPRIATE TRAVEL LANE.   MALE BRIEFLY STOPPED BUT THEN CONTINUED W/B THROUGH THE SOLID RED SIGNAL.   VEHICLE STOPPED FOR INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.2025,39.9632]}},{"objectid":400105,"districtoccur":"25","age":29,"mvc_reason":"POLICE WERE STOPPED AT THE RED LIGHT AT THE INTERSECTION OF ERIE AVE AND ST. CHRIS DRIVE. POLICE OBSERVED VEHICLE TRAVELING W.B ON ERIE ON THE RIGHT HAND SHOULDER AND PASS ALL TRAFFIC. VEHICLE THEN STOPPED IN THE MIDDLE OF THE CROSSWALK UPON SEEING POLICE. POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.127,40.0075]}},{"objectid":400619,"districtoccur":"17","age":27,"mvc_reason":"POLICE OBSERVED LISTED DRIVER WHILE IN LISTED VEHICLE PERFORM A U-TURN AT A RED LIGHT ON BROAD STREET AS A PEDESTRIAN WAS ATTEMPTING TO CROSS  THE STREET. NCIC/PCIC, NO WANTS. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1591,39.9735]}},{"objectid":391307,"districtoccur":"02","age":53,"mvc_reason":"VEHICLE OBSERVED STOPPED IN THE INTERSECTION BLOCKING PEDESTRIAN TRAFFIC. NO WANTS VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.0759,40.0433]}},{"objectid":405023,"districtoccur":"15","age":20,"mvc_reason":"VEHICLE OBSERVED WITH A FRADULENT PAPER TAG ALSO VEHICLE WITH DARK TINT AND BROKEN SIDE WINDOW.  LIGHTS ACTIVATED VEHICLE  DROVE UP ONTO SIDEWALK BACK  ONTO STREET. OBSERVED THE DRIVER CLIMB IN THE BACK SEAT AND THE FRONT PASSENGER  SWITCHED TO THE DRIVERS SEAT.  FRONT PASSENGER WAS THE OWNER OF THE VEHICLE AND  BOTH MALES WAS CLEARED BY INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.0855,40.0149]}},{"objectid":390100,"districtoccur":"24","age":42,"mvc_reason":"LISTED VEHICLE WAS OBSERVED ILLEGALLY PARKED ON SIDEWALK AT LISTED LOCATION. WHEN MAKING CONTACT WITH DRIVER PCIC AND NCIC WAS RAN AND CAME BACK WITH NEG RESULTS. MALE WAS GIVEN VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.1151,39.9976]}},{"objectid":389180,"districtoccur":"25","age":51,"mvc_reason":"POLICE OBSERVED ABOVE VEH OCCUPIED AND PARKED IN THE CROSSWALK AT THE INTERSECTION OF 700 W RUSSELL ST &AMP; 7TH ST. THE VEH HAD HEAVILY TINTED WINDOWS SO DARK THAT POLICE COULD NOT SEE IN. VEH STOPPED FOR PA MVC VIOLATION AND PARKING VIOLATIONS. NCIC/PCIC CHECK RAN ON VEH AND OPERATOR WITH NO WANTS. OPERATOR ISSUED VERBAL WARNING AND RELEASED.","geometry":{"type":"Point","coordinates":[-75.1415,40.0037]}},{"objectid":421272,"districtoccur":"05","age":33,"mvc_reason":"THE OPERATOR OF THE LISTED VEHICLE WAS TRAVELING SOUTHBOUND ON RIDGE AVENUE, AND HE FAILED TO STOP FOR CROSSWALK ALERT DEVICE THAT WAS ACTIVATED BY PEDESTRIANS PREPARING TO CROSS IN THE CROSSWALK. NCIC/PCIC/BMV CHECK-CBI AND RELEASED WITH A WARNING ONLY BECAUSE THE PEDESTRIANS  WERE NOT IN CROSSWALK AT THAT TIME.","geometry":{"type":"Point","coordinates":[-75.2214,40.0375]}},{"objectid":418967,"districtoccur":"24","age":43,"mvc_reason":"MALE OBSERVED RIDING A SILVER PEDAAL BIKE THE WRONG WAY (SOUTHBOUND) ON 3000 WATER WHICH IS ONE WAS ONLY NORTHBOUND. MALE WAS STOPPED AND POLICE CONDUCTED A NCIC/PCIC CHECK WHICH SHOWED NO WANTS AND THE MALE WAS RELEASED.","geometry":{"type":"Point","coordinates":[-75.129,39.9954]}},{"objectid":422487,"districtoccur":"03","age":32,"mvc_reason":"POLICE OBSERVED LISTED OPERATOR IN LISTED VEHICLE FAIL TO YIELD TO 2 MALE PEDESTRIANS WHO WERE WALKING ACROSS INTERSECTION AS HE WAS TRAVELING E/B THROUGH INTERSECTION OF 7TH AND WOLF STS. POLICE STOPPED VEHICLE FOR INVESTIGATION (NO WANTS CBI). POLICE GAVE MALE VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.1562,39.92]}},{"objectid":421439,"districtoccur":"25","age":66,"mvc_reason":"THE ABOVE VEHICLE DROVE ONTO THE CENTER DIVIDE IN ORDER TO PASS A POLICE VEHICLE THAT WAS TOWING DIRT BIKES. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1182,40.0065]}},{"objectid":417110,"districtoccur":"24","age":44,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE TRAVELING THROUGH TARGET PARKING LOT WITH NO REGARD TO THE PEDESTRIANS THAT WERE IN THE LOT. POLICE APPROACHED VEHICLE ONCE IT WAS STOPPED AND DRIVER GOT OUT OF VEHICLE AND STATED THAT HE KNEW WHY HE WAS BEING STOPPED AND THAT HE APOLOGIZED. POLICE HAD DRIVER SIT BACK IN VEHICLE SO THAT WE COULD CONDUCT OUR INVESTIAGTION. NCIC/PCIC WAS RUN OVER POLICE RADIO AND BOTH CAME BACK NO WANT. DRIVER AND VEHICLE  WERE RELEASED WITH WARNING TO DRIVE SAFELY WHEN IN THE PARKING","geometry":{"type":"Point","coordinates":[-75.0905,39.9902]}},{"objectid":415115,"districtoccur":"09","age":54,"mvc_reason":"VEHICLE TRAVELING W/B ON BEN FRANK PKWY ST TOWARDS SPRIN GARDEN STREET DISREGARD YIELD TI PEDESTRIAN SIGN. VEHICLE STOPPED FOR MVC VIOLATION. NEGATIVE WANTS ON OPERATOR/VEHICLE. OPERATOR GIVEN VERBAL WARNING. NO TVR ISSUED.","geometry":{"type":"Point","coordinates":[-75.1819,39.9645]}},{"objectid":415878,"districtoccur":"25","age":21,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED COMPLETELY BLOCKING CROSSWALK, WHILE SITTING INSIDE VEHICLE WITH THE CAR RUNNING. POLICE RAN PA TAG THROUGH MDT. TAG ON VEHICLE DID NOT COME BACK TO ANY VEHICLE. POLICE ACTIVATED LIGHTS AND STOPPED VEHICLE FOR INVESTIGATION. DURING INVESTIGATION BOTH DRIVER AND PASSENGER DID NOT HAVE IDENTIFICATION AND VIN ON VEHICLE WAS UNABLE TO BE READ BY POLICE. POLICE RAN BOTH DRIVER AND PASSENGER WITH NO RETURN ON BOTH OCCPANTS. DRIVER OF VEHICLE GAVE CONSENT TO SEARCH","geometry":{"type":"Point","coordinates":[-75.1428,40.0036]}},{"objectid":427899,"districtoccur":"22","age":40,"mvc_reason":"VEHICLE OBSERVED COMING DOWN THE  SIDEWALK OF THE 1700 BLOCK OF WEST GIRARD AVE WHICH WAS CLOSED FOR CONSTRUCTION.  VEHICLE CAME DOWN EASTBOUND ON THE SIDEWALK.  VEHICLE COULD NOT BE STOPPED BY OFFICER AS HE EXITED BUT VEHICLE CONTINUED EASTBOUND AND COULD NOT LEAVE CONSTRUCTION SITE AS HE WAS POSTED THERE FOR ROAD CLOSURE.  TVRS FILED.  #C3D4C90JH00, C3D4CSNWLB6","geometry":{"type":"Point","coordinates":[-75.1644,39.9721]}},{"objectid":425383,"districtoccur":"24","age":27,"mvc_reason":"POLICE OBSERVED ABOVE SCOOTER TRAVELING THE WRONG WAY E/B ON 300 E SOMERSET, A ONE WAY STREET THAT RUNS W/B. WHEN POLICE ATTEMPTED TO STOP THE SCOOTER THE OPERATOR WENT ONTO THE SIDEWALK AND DROPPED THE SCOOTER THEN FLED ON FOOT. POLICE GAVE CHASE AND STOPPED THE MALE AT 2811 KENSINGTON AVE. NCIC/PCIC CHECK RAN ON MALE AND SCOOTER WITH NO WANTS. MALE CLEARED BY INVESTIGATION AND RELEASED FROM THE LOCATION WITH SCOOTER.","geometry":{"type":"Point","coordinates":[-75.1261,39.9918]}},{"objectid":407632,"districtoccur":"35","age":30,"mvc_reason":"POLICE WERE IN FRONT OF THE VEHICLE TRAVELLING N/B WHEN THE ABV VEHICLE TOOK THE BIKE LANE TO OVERTAKE THE POLICE AND RAN CONTINUE N/B ON RISING SUN. VEHICLE STOPPED FOR INVESTIGATION. OPERATOR/VEHICLE RAN THROUGH PCIC/NCIC. NO WANTS. VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.1161,40.0331]}},{"objectid":408040,"districtoccur":"24","age":31,"mvc_reason":"WHILE TRAVELING BEHIND THE ABOVE VEHICLE AT THE ABOVE LOCATION, POLICE OBSERVED THAT THE VEHICLE HAD VERY HEAVY TINT ALL THE WAY AROUND. BEFORE POLICE COULD ACTIVATE THEIR EMERGENCY LIGHTS, THE VEHICLE PULLED INTO AN ILLEGAL PARKING SPOT WHICH WAS FULLY BLOCKING THE CROSSWALK. POLICE STOPPED THE VEHICLE WITHOUT INCIDENT. DURING THE STOP, THE DRIVER WAS BREATHING VERY FAST WITH HIS STOMACH TREMBLING. HE APPEARED TO BE NERVOUS DURING HIS POLICE QUESTIONS. THE FRONT SEAT PASSENGER REFUSED TO GIVE H","geometry":{"type":"Point","coordinates":[-75.1238,39.9951]}},{"objectid":410304,"districtoccur":"35","age":23,"mvc_reason":"VEHICLE OBSERVED IN THE MIDDLE OF OGONTZ AVE DOING MULTIPLE DOUGHNUTS CAUSING HAZARDS TO MOTORIST AND PEDESTRIANS. VEHICLE STOPPED IN REAR ALLEY OF 6500 OGONTZ AVE\nDRIVER ISSUED VERBAL WARNING  , ADVISED HAZARDS","geometry":{"type":"Point","coordinates":[-75.1498,40.0548]}},{"objectid":407866,"districtoccur":"24","age":29,"mvc_reason":"VEHICLE OBSERVED TRAVELING EAST ON CAMBRIA WITH PROHIBITED SUNSCREEN ON ALL WINDOWS, INCLUDING THE WINDSHIELD, MAKING IT HAZARDOUS FOR TRAFFIC OR PEDESTRIANS ON FRONT OF THE VEHICLE. THE VEHICLE WAS STOPPED FOR INV.  NO WANTS PER NCIC/PCIC. VEHICLE AND ITS OPERATOR WERE RELEASED WITHOUT FURTHER INCIDENT.","geometry":{"type":"Point","coordinates":[-75.1263,39.9934]}},{"objectid":409322,"districtoccur":"35","age":40,"mvc_reason":"DRIVER WAS OBSERVED OPERATING  VEHICLE TRAVELING WESTBOUND ON 1300 W OLNEY WHEN THE DRIVER TURNED RIGHT ONTO BROAD ST WITHOUT SIGNALING TURN CAUSING A HAZARD TO OTHERS. THIS AREA IS HEAVY WITH PEDESTRIAN TRAFFIC DUE TO THE TRANSPORTATION CENTER AND MULTIPLE SHOPS. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1429,40.0386]}},{"objectid":410751,"districtoccur":"09","age":51,"mvc_reason":"POLICE OBSERVED THE OPERATOR OF THE MOTOR SCOOTER DRIVE UPON THE SIDEWALK ON 1500 CHESTNUT ST. POLICE OBSERVED THIS WHILE TRAVELING EASTBOUND ON 1500 CHESTNUT. POLICE STOPPED OPERATOR FOR MVC VIOLATION NCIC/PCIC CHECK NO WANTS WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1659,39.9511]}},{"objectid":446440,"districtoccur":"09","age":44,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELLING SB ON BROAD AT WALNUT STREET, DISREGARD A STEADY RED SIGNAL AT LISTED LOCATION. INFRACTION OCCURED WITHIN A HIGH PEDESTRIAN FOOT TRAFFIC INTERSECTION. THIS IS A VIOLATION OF PA MVC 3112A31. VEHICLE STOPPED FOR INVESTIGATION IMMEDIATELY UPON ACTIVATION OF AUDIBLE SIRENS AND LIGHTS. NCIC/PCIC CHECK, YIELDING OPERATOR OLN 31247374, IN SUSPENDED STATUS. LIVESTOP ELGIBILE, BUT LICENSED DRIVER PASSENGER IN VEHICLE. OPERATOR GAVE PERMISSION FOR MOTHER WITH VALI","geometry":{"type":"Point","coordinates":[-75.1641,39.9505]}},{"objectid":441636,"districtoccur":"12","age":35,"mvc_reason":"POLICE OBSERVED ABOVE LISTED VEHICLE TRAVELING E/B AT ABOVE LISTED LOCATION DRIVING ON THE SIDEWALK TOWARDS THE 5800 5700 BLOCKS OF WOODLAND AVE THAT ARE BEING CLOSED FOR CONSTRUCTION. OPERATOR OF VEHICLE GOT UP ON THE SIDEWALK DRIVING ON IT AND ENTERED THE CONSTRUCTION ZONE. THE OPERATOR OF VEHICLE SHOWED CARELESS DISREGARD FOR THE SAFETY OF POSSIBLE PEDESTRIANS WALKING ON THE SIDEWALK AS WELL AS LIFE AND PROPERTY. POLICE STOPPED VEHICLE FOR INVESTIGATION PCIC/ NCIC CHECKED NO WANTS VERBAL WARN","geometry":{"type":"Point","coordinates":[-75.2233,39.9333]}},{"objectid":438241,"districtoccur":"35","age":25,"mvc_reason":"POLICE OBSERVED THE ABV VEHICLE TRAVELING E/B ON STENTON WITH AN EXPIRED REG 5/22 GOING AROUND TRAFFIC IN BIKE LANE. VEHICLE STOPPED FOR INVESTIGATION. OPERATOR/VEHICLE/OCCUPANT RAN THROUGH PCIC/NCIC. NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1438,40.0479]}},{"objectid":439685,"districtoccur":"02","age":47,"mvc_reason":"VEHICLE OBSERVED TURNING OFF OF LEVICK ST ONTO CASTOR AVE (NORTH) WHILE PEDESTRIANS WERE CROSSING THE STREET USING THE CROSSWALK EAST. THE VEHICLE DID NOT GIVE THE RIGHT OF WAY TO PEDESTRIANS. THEN, VEHICLE MADE A LEFT TURN ONTO GREEBY ST FROM CASTOR WITHOUT USING A TURN SIGNAL. NO WANTS. VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.0772,40.0418]}},{"objectid":435346,"districtoccur":"24","age":26,"mvc_reason":"VEHICLE OBSERVED EAST BOUND ON CAMBRIA FAIL TO COME TO A COMPLETE STOP PRIOR TO ENTERING CROSSWALK AREA.  VERBAL GIVEN.","geometry":{"type":"Point","coordinates":[-75.1144,39.9859]}},{"objectid":449527,"districtoccur":"19","age":21,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING S/B ON 400 N 63RD ST WHEN POLICE OBSERVED LISTED VEHICLE WITH HEAVY TINT AROUND ALL VEHICLE.. HEAVY TINT CAUSES A HAZORDOUS ENVIRONMENT TO OPERATOR, PEDESTRIANS AND POLICE, NCIC/PCIC CHECK SHOWED NO WANTS ON VEHILE OPERATOR ADVISES POLICE OR PERMIT TO CARRY AND THAT HE WAS IN POSSESION OF TWO FRIEARMS IN THE BACK OF HIS VEHICLE IN BLACK BACKPACK, POLICE RETRIEVED FIREARMS FROM LOCATION AND RAN THRU NCIC/PCIC. (PERMIT TO CARRY #5100101819, GLOCK 17 &AMP; 1","geometry":{"type":"Point","coordinates":[-75.2456,39.969]}},{"objectid":448886,"districtoccur":"06","age":61,"mvc_reason":"OBSERVED A GRAY SUV TRAVELING SOUTH ON 10TH STREET IN THE BIKE LANE, CLEARLY MARKED. OPERATOR ADVISED. NCIC/PCIC NO WANTS.","geometry":{"type":"Point","coordinates":[-75.1553,39.9513]}},{"objectid":451142,"districtoccur":"22","age":29,"mvc_reason":"POLICE OBSERVED THE ABOVE LISTED VEHICLE PASSING THE TRAFFIC LINE ON THE RIGHT SIDE IN A UNSAFE MANNER AN AT A HIGH RATE KICKING UP DUST. THE OPERATOR ALSO DROVE OVER THE SIDEWALK TO GET BACK IN THE THE TRAFFIC LANE. AFTER POLICE INVESTIGATION THE OPERATOR/OWNER WAS GIVEN TWO CITATION FOR THE INFRACTIONS.","geometry":{"type":"Point","coordinates":[-75.1595,39.9945]}},{"objectid":451855,"districtoccur":"12","age":23,"mvc_reason":"POLICE OBSERVED LISTED VEH PARKED AT 6000 REINHARD ST WITH THE KEYS IN THE IGNITION, VEHICLE RUNNING WHILE BLOCKING A CROSSWALK IN A HIGH CRIME AREA. POLICE RAN THE PA PLATE THROUGH NCIC/PCIC AND THE VEHICLE PLATE CAME BACK TO A JAGUAR BUT THE VEHICLE WAS A HONDA CIVIC. POLICE ACTIVATED OVERHEAD LIGHTS AND SIRENS AND APPROACHED THE VEHICLE. THE OPERATOR OF THE VEHICLE WAS AVOIDING EYE CONTACT WITH POLICE AND MUMBLING HIS WORDS. POLICE ASKED THE OWNER/OPERATOR OUT OF THE VEHICLE TO SPEAK WITH POL","geometry":{"type":"Point","coordinates":[-75.2299,39.9321]}},{"objectid":429662,"districtoccur":"18","age":18,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING SOUTH BOUND ON 52ND ST IN THE BIKE LANE/SHOULDER TO MAKE A RIGHT HAND TURN TO TRAVEL WEST BOUND ONTO WALNUT ST. NCIC/PCIC - NO WANTS. THE OPERATOR WAS GIVEN A VERBAL WARNING. CLEARED BY INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.2253,39.9584]}},{"objectid":467091,"districtoccur":"12","age":27,"mvc_reason":"LISTED VEH OBS TRAV S/B ON 2100 S. 65TH ST THEN TURN E/B ONTO 6400 WOODLAND AVE FAILING TO YIELD TO PEDESTRIAN CROSSING IN CROSSWALK. NCIC/PCIC NEG, MALE DRIVER UNLICENSED BUT OWNER, WHO STATED SHE WASN&APOS;T FEELING WELL, WAS SEATED IN FRONT PASSENGER SEAT. MALE &AMP; OWNER SWITCHED SEATS, WITH OWNER TAKING POSSESSION OF VEH, &AMP; BOTH ISSUED VERBAL WARNINGS.","geometry":{"type":"Point","coordinates":[-75.2355,39.9265]}},{"objectid":465531,"districtoccur":"16","age":54,"mvc_reason":"POLICE OBSERVED VEHICLE NORTH ON 39TH STREET DISREGARD THE STOP SIGN AT WALLACE ST WITH A PEDESTRIAN IN THE INTERSECTION. TVR ISSUED C3CD3HNFC03. VEH HAD EXPIRED REG, POLICE HELPED DRIVER REGISTER HIS VEHICLE DURING STOP.","geometry":{"type":"Point","coordinates":[-75.1997,39.9633]}},{"objectid":464938,"districtoccur":"09","age":61,"mvc_reason":"OPERATOR WAS OBSERVED DRIVING IN BIKE AND BUS ONLY LANE WHICH IS MARKED BY SIGNS AND ON HIGHWAY IN WHITE WRITING.","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":465283,"districtoccur":"09","age":45,"mvc_reason":"ABOVE OPERATOR WAS TRAVELING IN BIKE AND BUS ONLY LANE. LANE IS MARKED BY SIGNS AND ON POLES.","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":465293,"districtoccur":"09","age":32,"mvc_reason":"ABOVE OPERATOR WAS TRAVELING EAST ON CHESTNUT STREET IN LANE THAT IS MARKED BY SIGNS AND ON HIGHWAY BIKE AND BUS ONLY.","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":461888,"districtoccur":"09","age":22,"mvc_reason":"STOPPED FOR TRAVELING IN THE BIKE LANE NEAR ART MUSEUM SIGN POSTED BIKES ONLY . WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1699,39.9572]}},{"objectid":471031,"districtoccur":"18","age":25,"mvc_reason":"VEHICLE WAS SEEN TRAVELING E/B ON CHESTNUT ST TRAVELING AT A HIGH AND UNSAFE RATE OF SPEED. VEHICLE WAS WEAVING IN AND OUT OF TRAFFIC WITHOUT USING TURNING SIGNALS AND CUTTING OTHER VEHICLES OFF. AS WELL AS SPEEDING UP WHEN THE TRAFFIC LIGHTS TURNED YELLOW ON CHESTNUT ST. THIS CREATED A SAFTEY HAZZARD FOR PEDESTRIANS, OTHER VEHICLES DRIVING, AND THE ACTUAL VEHICLES OCCUPANTS ITSELF. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECKED NEGATIVE RESULTS. VERBAL WARNING GIVEN CBI.","geometry":{"type":"Point","coordinates":[-75.2005,39.9553]}},{"objectid":455256,"districtoccur":"16","age":44,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING WEST ON ASPEN WITH DEFECTIVE DRIVERS SIDE HEAD LIGHT AND REAR MIDDLE BRAKE LIGHT IN VIOLATION OF 4303-B.NCIC / PCIC NEG RESULTS BMV DISPLAYED OPERATOR UNLICENSED. WHILE CONDUCTING VEHICLE INVESTIGATION ABOVE PEDESTRIAN APPROACHED POLICE AND IDENTIFIED HERSELF AS OPERATORS SISTER AND STATED SHE WOULD TAKE CONTROL OF THE VEHICLE. BMV DISPLAYED VALID DRIVERS LICENSE. VERBAL WARNING GIVEN AND RELEASED WITHOUT INCIDENT.","geometry":{"type":"Point","coordinates":[-75.2004,39.9665]}},{"objectid":456005,"districtoccur":"12","age":16,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE DRIVING N/B ON THE SIDEWALK. POLICE STOPPED THE VEHICLE PCIC/NCIC CHECKED NO NWANTS VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2363,39.926]}},{"objectid":452188,"districtoccur":"12","age":22,"mvc_reason":"POLICE OBSERVED LISTED VEH PARKED AT 6000 REINHARD ST WITH THE KEYS IN THE IGNITION, VEHICLE RUNNING WHILE BLOCKING A CROSSWALK IN A HIGH CRIME AREA. POLICE RAN THE PA PLATE THROUGH NCIC/PCIC AND THE VEHICLE PLATE CAME BACK TO A JAGUAR BUT THE VEHICLE WAS A HONDA CIVIC. POLICE ACTIVATED OVERHEAD LIGHTS AND SIRENS AND APPROACHED THE VEHICLE. THE OPERATOR OF THE VEHICLE WAS AVOIDING EYE CONTACT WITH POLICE AND MUMBLING HIS WORDS. POLICE ASKED THE OWNER/OPERATOR OUT OF THE VEHICLE TO SPEAK WITH POL","geometry":{"type":"Point","coordinates":[-75.2299,39.9321]}},{"objectid":487921,"districtoccur":"35","age":33,"mvc_reason":"VEHICLE OBSERVED ILLEGALLY PARKED IN THE CROSSWALK ON THE N/E CORNER OF 4TH ST AND RUSCOMB ST. AS VEHICLE PULLED OFF POLICE OBSERVED THAT ALL OF THE WINDOWS (INCLUDING THE WINDSHIELD) WHICH OBSTRUCTED THE VIEWS OF ANY/ALL OCCUPANTS AND THE TEMP TAG WAS RIPPED AND EXPIRED AS OF 10/22/22. NCIC/PCIC CHECK. DRIVER HAD A SUSPENDED CLASS C. VEHICLE RELEASED TO LICENSED OWNER WHO ARRIVED ON LOCATION.","geometry":{"type":"Point","coordinates":[-75.131,40.0257]}},{"objectid":489467,"districtoccur":"08","age":36,"mvc_reason":"POLICE OBSERVED ABV TRAVELING SB AT ABV LOC.POLICE OBSERVED ABV DRIVING IN THE BIKE LANE AND PASSING VEHS.MALE ALSO DISREGARDED A STEADY RED SIGNAL.CBI/VWI","geometry":{"type":"Point","coordinates":[-75.0011,40.0573]}},{"objectid":485403,"districtoccur":"09","age":27,"mvc_reason":"EAST ON 2300 FAIRMOUNT AVE WITH HEADLIGHT OUT WIPERS ON, DOUBLE PARKED IN THE BIKE LANE","geometry":{"type":"Point","coordinates":[-75.1758,39.9673]}},{"objectid":484443,"districtoccur":"12","age":65,"mvc_reason":"POLICE OBSERVED VEHICLE NORTHBOUND ON 66TH ST. MAKE A LEFTHAD TURN AT DICKS AVE FAILING TO YIELD AND ALMST STRIKING PEDESTRIAN IN THE WALKWAY WITH THE RIGHT OF WAY. NCIC/PCIC CHECK REVEALED NO WANTS. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.2301,39.92]}},{"objectid":481421,"districtoccur":"03","age":17,"mvc_reason":"OPERATED A VEHICLE UPON A SIDEWALK AREA WHERE PROHIBITED","geometry":{"type":"Point","coordinates":[-75.1619,39.9432]}},{"objectid":475984,"districtoccur":"35","age":27,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING SOUTHBOUND ON 5TH ST USING THE BIKE LANE/ RIGHT SHOULDER TO PASS OTHER FORWARD MOVING TRAFFIC AT GODFREY AV AT A HIGH RATE OF SPEED CREATING A HAZARD. TVR ISSUED.","geometry":{"type":"Point","coordinates":[-75.1302,40.0381]}},{"objectid":478114,"districtoccur":"25","age":23,"mvc_reason":"WHILE TRAVELING W/B ON 500 E WYOMING AVE APPROACHING D STREET POLICE OBSERVED ABOVE VEH GO INTO ONCOMING TRAFFIC TO PASS A SEPTA BUS AND ANOTHER VEH AND ALMOST STRIKE A PEDESTRIAN. THE VEH THEN DISREGARDED THE STEADY RED LIGHT AT THE INTERSECTION OF D &AMP; WYOMING. VEH STOPPED FOR PA MVC VIOLATIONS. NCIC/PCIC CHECK RAN ON VEH, OPERATOR AND PASSENGER. PASSENGER HAD VALID PERMIT TO CARRY. OPERATOR ISSUED VERBAL WARNING AND VEH AND OCCUPANTS RELEASED FROM THE LOCATION.","geometry":{"type":"Point","coordinates":[-75.1161,40.0205]}},{"objectid":476405,"districtoccur":"25","age":36,"mvc_reason":"DEF. WAS STOPPED IN THE NORTH BOUND RUNNING LANE OF NORTH RISING SUN AVE. CREATING A HAZZARDOUS CONDITION CONVERSATING WITH A MALE PEDESTRIAN STANDING IN THE STREET AT THE DRIVERS DOOR OF THE VEHICLE. I ASKED DRIVER TO MOVE, HE ACKNOWLEDGE, I WENT DOWN THE STREET LOOKED IN MY REAR VIEW MIRROR DRIVER REFUSED TO MOVE, I CAME BACK UP THE STREET PEDESTRIAN LOOKED IN MY DIRECTION AND DRIVER PULLED OFF BEFORE BEING STOPPED.","geometry":{"type":"Point","coordinates":[-75.1272,40.0188]}},{"objectid":479302,"districtoccur":"22","age":20,"mvc_reason":"LISTED VEHICLE OBSERVED ATTEMPTING TO PARK ON SIDEWALK OPERATING VEHICLE WITH EXTREME HEAVY DARK WINDOW TINT.","geometry":{"type":"Point","coordinates":[-75.1297,39.9818]}},{"objectid":512174,"districtoccur":"35","age":19,"mvc_reason":"DRIVER OBSERVED THE DRIVER OPERATING ABOVE VEHICLE TRAVELING SOUTHBOUND ON OLD YORK RD USING THE RIGHT SHOULDER/BIKE LANE TO OVERTAKE A LINE OF FORWARD MOVING VEHICLES CREATING A HAZARD TO OTHERS. TVR ISSUED.","geometry":{"type":"Point","coordinates":[-75.1433,40.0462]}},{"objectid":512519,"districtoccur":"35","age":20,"mvc_reason":"DRIVER OBSERVED THE DRIVER OPERATING ABOVE VEHICLE TRAVELING SOUTHBOUND ON OLD YORK RD USING THE RIGHT SHOULDER/BIKE LANE TO OVERTAKE A LINE OF FORWARD MOVING VEHICLES CREATING A HAZARD TO OTHERS. TVR ISSUED.","geometry":{"type":"Point","coordinates":[-75.1433,40.0462]}},{"objectid":514388,"districtoccur":"06","age":41,"mvc_reason":"POLICE OBSERVED THE ABV VEH TRAVELING N/B ON 3 RD STREET JUST BEFORE BROWN STREET. VEH DID NOT COME TO A COMPLETE STOP AT STOP SIGN ALSO DID NOT YIELD TO PEDESTRIAN TRAFFIC CROSSING IN MARKED CROSS WALK. VEH STOPPED AT 900 N 3RD STREET FOR INVESTIGATION. VEH CLEARS NCIC/PCIC CHECK HOWEVER BOTH DRIVER AND PASSENGER HAVE SUSPENDED LICENSES. POLICE ISSUED TICKET FOR SUSPENDED LICENSE TO DRIVER. 3RD PERSON CALLED TO AREA TO CONTINUE DRIVING VEH BY DRIVER.","geometry":{"type":"Point","coordinates":[-75.1431,39.9625]}},{"objectid":512363,"districtoccur":"25","age":22,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE TRAVELING ON THE SIDEWALK OF THE 500 BLOCK OF E WYOMING, OPERATOR WAS DRIVING THE CAR ON THE SIDEWALK FROM 560 E WYOMING  TO 500 E WYOMING, THEN THE OPERATOR DROVE THE VEHICLE ONTO THE HIGHWAY AND MADE A COMPLETE STOP AT THE GREEN STREET LIGHT. THEN THE OPERATOR STOPPED AT THE GREEN LIGHT AT 500 E WYOMING (BLOCKING THE VEHICULAR TRAFFICS FROM NATURALLY MOVING ). POLICE NICIC/PCIC CHECKED THE CAME BACK NEGATIVE. POLICE OBSERVED MALE WAS NOT WEARING THE SEATBELT. OPER","geometry":{"type":"Point","coordinates":[-75.1168,40.0206]}},{"objectid":508914,"districtoccur":"39","age":57,"mvc_reason":"LISTED OBSERVED PASSING POLICE ON THE RIGHT HAND SIDE OF THE HIGHWAY AT A HIGH RATE OF SPEED IN THE BIKE LANE. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK WITH NEGATIVE RESULTS. VERBAL WARNING AND CBI.","geometry":{"type":"Point","coordinates":[-75.1771,39.9969]}},{"objectid":509645,"districtoccur":"09","age":49,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING SOUTHBOUND ON BROAD STREET WITH A BIKE THAT WAS ATTACHED TO THE VEHICLE WHICH COMPLETELY OBSTRUCTED THE VIEW OF THE REGISTRATION PLATE. WHEN INITIALLY OBSERVING VEHICLE, POLICE WERE UNABLE TO DETERMINE WHETHER OR NOT A REGISTRATION PLATE WAS PRESENT. POLICE STOPPED VEHICLE FOR INVESTIGATION. UPON APPROACHING THE VEHICLE, POLICE FOUND THAT THERE WAS A NJ REGISTRATION PLATE ATTACHED TO THE VEHICLE. OPERATOR STATED TO POLICE THAT THE THOUGHT NEVER CROSSED HI","geometry":{"type":"Point","coordinates":[-75.165,39.9466]}},{"objectid":507305,"districtoccur":"19","age":26,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE AT THE LISTED LOCATION WITH HEAVILY TINTED WINDOWS. WHEN POLICE RAN THE VEHICLE IT CAME BACK WITH A WARRANT FOR THE OWNER OCA# 2103007317. THE VEHICLE PARKED ON THE SIDEWALK BEFORE POLICE COULD STOP IT, AND THE MALE DRIVER IMMEDIATELY GOT OUT AND STARTED WALKING NORTH BOUND ON SIMPSON STREET. IN AN ATTEMPT TO STOP THE MALE POLICE CIRCLED THE BLOCK, BUT BEFORE DOING SO POLICE SAW THE MALE WALK BACK TO THE VEHICLE A REACH INSIDE TOWARDS THE GLOVE COMPARTMENT. POL","geometry":{"type":"Point","coordinates":[-75.2493,39.9663]}},{"objectid":505183,"districtoccur":"07","age":56,"mvc_reason":"DRIVER WAS TRAVELING SOUTH ON BUSTLETON AVE. STOPPING IN THE CROSSWALK AT SEVERAL RED LIGHTS C.I.B","geometry":{"type":"Point","coordinates":[-75.0517,40.0637]}},{"objectid":506788,"districtoccur":"24","age":40,"mvc_reason":"POLICE OBSERVED THE VEHICLE PASS A VEHICLE ON A 1 LANE HIGHWAY ON THE RIGHT BETWEEN MARKED LANE AND SIDEWALK. STOPPED FOR INVESTIGATION. NCIC/PCIC NEGATIVE. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1043,39.9978]}},{"objectid":515415,"districtoccur":"18","age":29,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING SOUTHBOUND AT THE LISTED LOCATION AT A HIGH RATE OF SPEED DURING ICY CONDITIONS ON THE ROAD CAUSING A DRIVING HAZARD FOR THEMSELVES AND OTHER VEHICLES AND PEDESTRIANS ON THE HIGHWAY. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK, NEGATIVE WANTS. DRIVER GIVEN. A VERBAL WARNING AND RELEASED.","geometry":{"type":"Point","coordinates":[-75.2373,39.9501]}},{"objectid":516184,"districtoccur":"16","age":25,"mvc_reason":"POLICE OBS LISTED VEH DOUBLE PARKED IN ROADWAY OUTSIDE LISTED LOCATION WITH DRIVER IN CAR AND AMPLE SPACE TO LEGALLY PARK CAR NEXT TO SIDEWALK. POLICE HIT HORN TO SIGNAL OPER TO MOVE VEHICLE AND PARK LEGALLY. OPER EXITED VEH AND STATED THAT POLICE CAN GO AROUND HER AND THAT EVERYONE HAS DROVE AROUND. POLICE THEN STOPPED VEH FOR INVEST. OPER DID WANT WANT TO SPEAK TO POLICE AND REQUESTED A SUPERVISOR. 16SA ON LOC. VEH ISSUED PVR #49120740-3 FOR  DOUBLE PARKING. OPER WOULD NOT GIVE POLICE HER DRIV","geometry":{"type":"Point","coordinates":[-75.2202,39.9644]}},{"objectid":515228,"districtoccur":"35","age":19,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING NORTHBOUND ON TABOR RD USE THE BIKE/PARKING LANE ON THE RIGHT TO OVERTAKE ANOTHER FORWARD MOVING VEHICLE. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.111,40.0312]}},{"objectid":502836,"districtoccur":"17","age":74,"mvc_reason":"VEHICLE BEING OPERATED NORTH ON BROAD ST WITH NO LIGHTS FUNCTIONING FRONT AND REAR. HAZARD TO PEDESTRIANS.","geometry":{"type":"Point","coordinates":[-75.1659,39.9425]}},{"objectid":499270,"districtoccur":"25","age":57,"mvc_reason":"POLICE OBSERVED OPERATOR DIDN&APOS;T YIELD ON CROSSWALK WHILE PED WAS ATTEMPTING TO CROSS POLICE GAVE VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.1359,40.0121]}},{"objectid":536605,"districtoccur":"25","age":23,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE DRIVE OVER THE SIDEWALK AND OVER THE GRASS FROM 1000 W LYCOMING ST TO ENTER THE PARK. PARK GATE WAS LOCKED AND CLOSED PREVIOUSLY AT 1000 W LYCOMING ST. VEHICLE STOPPED FOR INVESTIGATION, RECORDS/WANTS CHECK CONDUCTED ON OPERATOR AND (2) PASSENGERS WITH NEGATIVE RESULTS. OPERATOR ISSUED VERBAL WARNING ONLY.","geometry":{"type":"Point","coordinates":[-75.1447,40.0141]}},{"objectid":562490,"districtoccur":"17","age":34,"mvc_reason":"POLICE RECEIVED A RADIO CALL FOR ABOVE VEHICLE BEING PARKED IN THE CROSSWALK OF ABOVE LOCATION FOR AN EXTENDED PERIOD OF TIME. UPON ARRIVAL THE VEHICLE WAS BLOCKING THE CROSSWALK. NCIC/PCIC CHECK, NO WANTS ON THE DRIVER OR VEHICLE AT THIS TIME.","geometry":{"type":"Point","coordinates":[-75.1735,39.9324]}},{"objectid":587881,"districtoccur":"02","age":28,"mvc_reason":"POLICE OBSERVED THE LISTED MOTOERCYCLE DRIVER ON THE SIDEWALK AND PARK IN FRONT OF THE WALGREENS STORE PARTICALY BLOCKING THE ENTRANCE TO THE STORE. THE MOTORCYCLE DID NOT HAVE A LICENSE PLATE. TWO MALES DISMOUNTED THE VEHICLE. THE DRIVER AND THE PASSENGER WERE BOTH CLEARED BY INVESTIGATION. BOTH THE DRIVER AND PASSENGER WERE IN VIOLATION OF MVC 3525B (PROTECTIVE EYE DEVICE)","geometry":{"type":"Point","coordinates":[-75.0672,40.0499]}},{"objectid":587000,"districtoccur":"08","age":66,"mvc_reason":"VEHICLE WAS NORTH ON ROOSEVELT BLVD. INNER LANES, DISREGARD A STEADY RED LIGHT AT PLAZA DR. AND ROOSEVELT BLVD. DRIVER WAS TRAVELING AT A HIGH RATE OF SPEED AND ALMOST STRUCK A PEDESTRIAN WHO WAS CROSSING IN THE CROSSWALK FROM THE EAST SIDE OF ROOSEVELT BLVD. TO THE WEST SIDE. NCIC CHECK SHOWED VALID REGISTRATION. DRIVER WAS INFORMED THAT A TVR WOULD BE MAILED TO THE ADDRESS ON HIS LICENSE. DRIVER WAS RELEASED FROM THE SCENE.","geometry":{"type":"Point","coordinates":[-75.0028,40.1036]}},{"objectid":594242,"districtoccur":"22","age":34,"mvc_reason":"POLICE OBSERVED VEHICLE DRIVING ON THE GRASS AND THEN ON SIDEWALK / WALKING TRAIL ON KELLY DRIVE. PEDESTRIANS OBSERVED STILL USING SIDEWALK/TRAIL AND VEHICLE HAD TO STOP AND WAIT TO LET THEM PASS SAFELY..  INVESTIGATION REVEALED DRIVE/OWNER HAD NO VALID INSURANCE FOR VEHICLE.","geometry":{"type":"Point","coordinates":[-75.1973,39.9898]}},{"objectid":577730,"districtoccur":"07","age":37,"mvc_reason":"THE OPERATOR WAS OBSERVED BY POLICE TRAVELING S/B OUTER LANES TEXTING WHILE DRIVING IN WILFUL DISREGARD FOR SURROUNDING VEHICLES/PEDESTRIANS. WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.0402,40.069]}},{"objectid":607666,"districtoccur":"18","age":63,"mvc_reason":"POLICE HEARD VEHICLE COME TO SCREECHING HALT AT ABOVE LOCATION AND OBSERVED 2 PEDESTRIANS LUNGE BACKWARDS AT CROSSWALK. POLICE WERE NOT FACING DIRECTION AT TIME AND MADE A U-TURN TO INVESTIGATE INCIDENT. POLICE CAUGHT UP TO VEHICLE AND ACTIVATED LIGHTS AND SIREN WHERE VEHICLE STOPPED PROMPTLY. DRIVER EXPLAINED SHE HAD A STEADY GREEN AND PEDESTRIANS WERE NOT PAYING ATTENTION. POLICE WERE NOT ABLE TO SEE OPERATOR HAVE A GREEN LIGHT AT TIME OF INCIDENT. NCIC PCIC GOT NEG RESULTS. OPERATOR WAS CLEAR","geometry":{"type":"Point","coordinates":[-75.2094,39.9514]}},{"objectid":617300,"districtoccur":"25","age":25,"mvc_reason":"POLICE WERE TRAVELING EAST BOUND ON 700 W LUZERNE WHEN POLICE OBSERVED THE ABOVE VEHICLE PARKED RUNNING BLOCKING THE PEDESTRIAN INTERSECTION, THE HANDY CAP RAMP AND A FIRE HYDRANT. THE VEHICLE ALSO HAD HEAVY TINT ON ALL WINDOWS INCLUDING THE FRONT WINDSHIELD. POLICE OBSERVED THE ABOVE OPERATOR WALKING AWAY FROM THE VEHICLE AND HEADING INTO THE CORNER STORE. THE PASSENGER EXITED THE FROM THE FRONT PASSENGER SEAT AND BEGAN WALKING TO THE CORNER STORE. AS POLICE EXITED THE RPC AND APPROACHED THE VE","geometry":{"type":"Point","coordinates":[-75.1395,40.0124]}},{"objectid":631433,"districtoccur":"18","age":21,"mvc_reason":"WHILE RESPONDING TO A ROBP POINT OF GUN AT 1 S. 60TH ST. THE LISTED VEHICLE WAS DOUBLE PARKED BLOCKING THE HIGHWAY AT 5900 LUDLOW ST. POLICE SIGNALED FOR THE VEHICLE TO MOVE BUT THE VEHICLE STAYED BLOCKING THE HIGHWAY. THE REAR SEAT PASSENGER THEN EXITED THE VEHICLE AND WALKED TOWARDS THE SIDEWALK. POLICE AGAIN SIGNALED FOR THE VEHICLE TO MOVE BUT THE VEHICLE STAYED BLOCKING THE HIGHWAY. POLICE STOPPED THE VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECK, NO WANTS. BMV CHECK REVEALED THE OPERATOR OF T","geometry":{"type":"Point","coordinates":[-75.239,39.9609]}},{"objectid":632154,"districtoccur":"25","age":19,"mvc_reason":"I OBSERVED THE VEHICLE GOING AROUND STOPPED TRAFFIC AND DRIVING ONTO THE SIDEWALK WHERE PEDESTRIAN, TO MAKE A RIGHT TURN FROM LEHIGH AVE ONTO AMERICAN ST.","geometry":{"type":"Point","coordinates":[-75.1352,39.9915]}},{"objectid":638957,"districtoccur":"07","age":42,"mvc_reason":"CARELESS DRIVING PASSING ANOTHER VEHICLE ON THE RIGHT WHIILE IN THE BIKE LANE TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.0289,40.1025]}},{"objectid":642333,"districtoccur":"07","age":62,"mvc_reason":"VEH OBSERVED E/B RED LION RD AT ROOSEVELT BLVD FAIL TO YEILD TO PED IN CROSSWALK.","geometry":{"type":"Point","coordinates":[-75.0152,40.0946]}},{"objectid":638658,"districtoccur":"09","age":38,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE DISREGARD STOP SIGNAL AT THE INTERSECTION OF 20TH AND CALLOWHILL. VEHICLE WAS TRAVELING N/B ON 20TH ST AND PROCEEDED TO TURN E/B ON TO CALLOWHILL NEARLY STRIKING PEDESTRIANS AS THEY ATTEMPTED TO CROSS INTERSECTION. VEHICLE STOPPED FOR INVESIGATION. CBI. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1716,39.9608]}},{"objectid":623246,"districtoccur":"09","age":47,"mvc_reason":"OPERATOR TRAVELING WEST ON BEN FRANKLIN PKWY STOPPED IN CROSSWALK TO ALLOW PASSENGERS TO EXIT VEHICLES. WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1799,39.9642]}},{"objectid":642864,"districtoccur":"09","age":22,"mvc_reason":"MALE ON BIKE WAS DRIVING IN AND OUT OF TRAFFIC PASSING VEHICLES ON RIGHT DISREGARD STOP SIGNS AND TRAFFIC SIGNAL THEN RIDDING ON SIDE WALK NIGHT\nWITHOUT A LIGHT ON BIKE","geometry":{"type":"Point","coordinates":[-75.1673,39.9583]}},{"objectid":646458,"districtoccur":"24","age":21,"mvc_reason":"VEHICLE OBSERVED STOPPED IDLING ON THE NORTHEAST CORNER OF ELLA AND INDIANA STREETS, PARTIALLY BLOCKING THE CROSSWALK, MAKING IT A HAZARD FOR PEDESTRIANS CROSSING. THE VEHICLE THEN EXITED THE SPOT AND PROCEEDED NORTH. THE VEHICLE HAD PROHIBITED TINT ON ALL WINDOWS. AN NCIC/PCIC CHECK ALSO REVEALED NO RESULTS. THE VEHICLE WAS STOPPED FOR INV. AFTER A NCIC/PCIC CHECK OF THE VIN, NO WANTS WERE REVEALED.","geometry":{"type":"Point","coordinates":[-75.1257,39.9965]}},{"objectid":645023,"districtoccur":"24","age":33,"mvc_reason":"POLICE OBSERVED THE ABOVE LISTED VEHICLE TRAVEL S/B ON HELEN ST. AND FAILED TO  SIGNAL HIS CHANGE OF LANE AND PULLED HIS VEHICLE ONTO THE  SIDEWALK  ON THE LEFT HAND SIDE OF THE STREET. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1225,39.9891]}},{"objectid":655378,"districtoccur":"25","age":24,"mvc_reason":"VEH OBS W/ ALL FRONT, SIDE, AND REAR GLASS OBSCURED BY NEAR OPAQUE BLACK TINT ILLEGALY PARKED AND OCCUPIED ON SIDEWALK OF 2800 MUTTER ST. INVEST PROVIDED OPERATOR POSSESSED THREE FIREARMS INSIDE VEHICLE AS WELL AS NARCOTICS. OPERATOR PRESENTED VALID LTCF #5100090073. ALL FIREARMS AND NARCOTICS OBSERVED IN PLAINVIEW WERE RECOVERED. OPER LTCF CONFISCATED. VEH SECURED AND TRANSPORTED TO M&AMP;W FOR EXECUTION OF S&AMP;S WARRANT. OCCUPANTS CBI. WARRANT #259107 WAS APPROVED AND EXECUTED ON THE VEH WIT","geometry":{"type":"Point","coordinates":[-75.133,39.9928]}},{"objectid":659287,"districtoccur":"16","age":58,"mvc_reason":"VEH. WAS TRAVELING E/B ON ARCH ST. AND MADE A LEFT TURN ONTO 52ND ST. CUTTING OFF A LADY WHO WAS WALKING IN THE CROSSWALK.  V.W.G","geometry":{"type":"Point","coordinates":[-75.2245,39.9616]}},{"objectid":674162,"districtoccur":"24","age":29,"mvc_reason":"POLICE OBSERVED VEHICLE PARKED ON THE SIDEWALK WITH THE ENGINE RUNNING OCCUPIED WITH ABOVE MALE SITTING IN THE DRIVER SEAT. POLICE CONDUCTED NCIC/PCIC WHICH RESULTED IN THE TAG ASSIGNED TO A HONDA. PER VIN# 1B3HB28CX8D600215 TAG ASSIGNED WAS LLK4732 TO THE ABOVE VEHICLE(DODGE). THE MALE PROVIDED PROPER PAPERWORK FOR RECENTLY PURCHASING THE VEHICLE. NO WANTS","geometry":{"type":"Point","coordinates":[-75.1274,39.9952]}},{"objectid":672394,"districtoccur":"09","age":25,"mvc_reason":"ABOVE OPERATOR WAS OBSERVED PARKED IN A BIKE LANE FOR TICKET OFFENSE WHEN APPROACHED VEHICLE TOOK OFF. VEHICLE HAD A CT REGISTRATION AND WAS EXPIRED AFTER A NCIC PCIC CHECK OF THE VEH. VEHICLE ALSO HAD REAR LIGHTS OUT AND WAS STOPPED FOR INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.166,39.9566]}},{"objectid":701270,"districtoccur":"39","age":24,"mvc_reason":"POLICE OBSERVED LISTED VEH. AT LISTED LOCATION PASSING OTHER MOTORISTS ON THE RIGHT SIDE, CLOSEST TO THE SIDEWALK, OUTSIDE OF NORMAL TRAVEL LANE. THE PASS WAS MADE WHILE OTHER MOTORIST WAS ALSO IN MOTON AND HAD NOT BEEN TURNING LEFT.\nVEH. STOPPED FOR THIS VIOLATION.\nNCIC/PCIC/BMV CHECK, NO WANTS.\nTVR ISSUED.","geometry":{"type":"Point","coordinates":[-75.1607,40.0203]}},{"objectid":704987,"districtoccur":"16","age":22,"mvc_reason":"OPER WAS TRAVELING E/B ON 4600 GIRARD AVE AT A HIGH RATE OF SPEED IN THE PARKING AND BIKE ONLY LANE.  V.W.G.","geometry":{"type":"Point","coordinates":[-75.2139,39.973]}},{"objectid":699399,"districtoccur":"18","age":29,"mvc_reason":"VEHICLE OBSERVED TRAVELING NORTHBOUND ON 56TH ST THEN WESTBOUND ON  MONTROSE WHERE VEHICLE PULLED ONTO SIDEWALK STILL MOVING WESTBOUND, VEHICLE STOPPED FOR INVESTIGATION. POLICE ASKED OCCUPANTS OF VEHICLE FOR LICENSE, REGISTRATION AND INSURANCE. BOTH OCCUPANTS PRODUCE THERE ID THROUGH THERE CELL PHONE. POLICE ASKED IF ANYONE HAD A PERMIT TO CARRY. BOTH OCCUPANTS RESPONDED &QUOT;NO&QUOT;. POLICE OBSERVED A BULGE IN OPERATORS FRONT LEFT SWEATER POCKET. WHEN POLICE ASKED WHAT&APOS;S IN THE POCKET.","geometry":{"type":"Point","coordinates":[-75.2356,39.9479]}},{"objectid":696120,"districtoccur":"25","age":28,"mvc_reason":"POLICE OBSERVED VEHICLE GO AROUND BUS VIA SIDEWALK ON RIGHT TO MAKE LEFT TURN. STOPPED FOR INVESTIGATION. NCIC/PCIC- NO WANTS. WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1502,40.0037]}},{"objectid":691019,"districtoccur":"25","age":18,"mvc_reason":"THE ABOVE VEHICLE DROVE ON THE BIKE LANE ILLEGALLY PASSING SEVERAL CARS ON THE RIGHT  AT A HIGH RATE OF SPEED. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1225,40.0087]}},{"objectid":692166,"districtoccur":"17","age":42,"mvc_reason":"POL OBS VEH TRAVELLING E/B ON 1800 DICKINSON ST. WHEN IT DISREGARDED THE STOP SIGN AT 18TH AND DICKINSON ST. NEARLY STRIKING A PEDESTRIAN THAT WAS CROSSING FROM THE NORTH TO SOUTH SIDE.  STOPPED FOR MVC 3323B.  NCIC/PCIC WITH NO WANTS.  VERBAL ONLY.","geometry":{"type":"Point","coordinates":[-75.175,39.9326]}},{"objectid":727032,"districtoccur":"17","age":62,"mvc_reason":"VEHICLE OBSERVED DOUBLE PARKED BLOCKING THE HIGHWAY SOUTHBOUND LANES AS OPERATOR CONDUCTED A CONVERSATION WITH A PEDESTRIAN FOR SEVERAL MINUTES, HOLDING UP TRAFFIC. NCIC/PCIC CHECKED WITH NEGATIVE RESULTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1867,39.9322]}},{"objectid":718441,"districtoccur":"18","age":19,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING SOUTH BOUND ON THE UNIT BLOCK OF SOUTH 52ND STREET. POLICE OBSEVERED OPERATOR STOPPING IN THE MIDDLE OF THE CROSSWALK WHICH WAS INTERFERING WITH PEOPLE WALKING ACROSS THE STREET. POLICE STOPPED VEHICLE FOR INVEST. UPON APPROACH POLICE OBSERED OPERATOR OF VEHICLE BREATHING VERY HEAVILY, UNCONTROLLABLY HAND SHAKING AND LOOKING ALL AROUND TOWARDS STREET SIGNS AS IF HE WAS TRYING TO GET AWAY. POLICE ASKED MALE TO STEP OUT THE VEHICLE TO FRISK IMMEDIATE DUE TO NERVOU","geometry":{"type":"Point","coordinates":[-75.2251,39.9585]}},{"objectid":718818,"districtoccur":"18","age":16,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING SOUTH BOUND ON THE UNIT BLOCK OF SOUTH 52ND STREET. POLICE OBSEVERED OPERATOR STOPPING IN THE MIDDLE OF THE CROSSWALK WHICH WAS INTERFERING WITH PEOPLE WALKING ACROSS THE STREET. POLICE STOPPED VEHICLE FOR INVEST. UPON APPROACH POLICE OBSERED OPERATOR OF VEHICLE BREATHING VERY HEAVILY, UNCONTROLLABLY HAND SHAKING AND LOOKING ALL AROUND TOWARDS STREET SIGNS AS IF HE WAS TRYING TO GET AWAY. POLICE ASKED MALE TO STEP OUT THE VEHICLE TO FRISK IMMEDIATE DUE TO NERVOU","geometry":{"type":"Point","coordinates":[-75.2251,39.9585]}},{"objectid":721887,"districtoccur":"35","age":23,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING N/B ON THE 5800 BLOCK OF N BROAD PASSING MULTIPLE CARS IN THE TURN ONLY LANE AND CONTINUING N/B ON BROAD STREET CAUSING VEHICLES TO SLAM ON THEIR BRAKES AND CREATING A HAZARD FOR OTHER VEHICLES AND PEDESTRIANS. VEHICLE  STOPPED AT 6000 N BROAD AND RAN THROUGH PCIC/NCIC, NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1442,40.0417]}},{"objectid":721292,"districtoccur":"35","age":54,"mvc_reason":"POLIC WERE TRAVELLING N/B ON OGONTZ WHEN THE ABV VEHICLE PASSED MULTIPLE VEHICLES AND THE POLICE IN THE BIKE LANE. VEHICLE STOPPED FOR INVESTIGATION. OPERATOR/VEHICLE/OCCUPANT RAN THROUGH PCIC/NCIC. NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1502,40.0422]}},{"objectid":735180,"districtoccur":"39","age":26,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING AT A HIGH RATE OF SPEED WESTBOUND ON 1800 W. HUNTING PARK AVE WITH TOTAL DISREGARD FOR TRAFFIC AND PEDESTRIANS IN THE AREA. VEHICLE STOPPED FOR INVESTIGATION, NCIC/PCIC CHECK WITH NEGATIVE WANTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1567,40.0146]}},{"objectid":735207,"districtoccur":"25","age":25,"mvc_reason":"POLICE OBSERVED ABOVE MOTORCYCLE BEING OPERATED AT A HIGH RATE OF SPEED IN THE MEDIAN LANE PASSING MULTIPLE CARS AT MULTIPLE INTERSECTIONS. VEH THEN WENT ONTO THE SIDEWALK AT THE ABOVE LOCATION. VEH STOPPED FOR PA MVC VIOLATIONS. NCIC/PCIC CHECK RAN ON BIKE AND OPERATOR WITH NO WANTS. OPERATOR ISSUED VERBAL WARNING AND RELEASED FROM THE LOCATION.","geometry":{"type":"Point","coordinates":[-75.1293,39.9986]}},{"objectid":733157,"districtoccur":"18","age":37,"mvc_reason":"MALE WAS SEEN DRIVING DOWN WALNUT STREET IN THE LEFT LANE SWERVING INTO THE BIKE LANE AND THEN BACK TO DRIVING LANE REPEATEDLY. AT ONE POINT THE VEHICLE DROVE IN THE BIKE LANE FOR A WHOLE CITY BLOCK BEFORE GETTING BACK OVER. THROUGHOUT OBSVERVING THIS VEHICLE, MALE WAS SEEN LOOKING DOWN AT SOMETHING WHICH MAY OF CONTRIBUED TO HIM DRIVING LIKE THIS. VEHICLE STOPPED AT ABOVE LOCATION FOR INVESTIGATION. NCIC/PCIC CHECKED NEGATIVE RESULTS. VERBAL WARNING GIVEN CBI.","geometry":{"type":"Point","coordinates":[-75.2335,39.9579]}},{"objectid":712295,"districtoccur":"24","age":41,"mvc_reason":"VEHICLE OBSERVED IDLING ON SIDEWALK, ALSO TOO CLOSE TO THE CORNER ON THE SOUTH WEST CORNER OF HARTVILLE AND CLEARFIELD. THE VEHICLE WAS STOPPED FOR INV. THE OPERATOR WAS ADVISED AND RELEASED AFTER AN NCIC/PCIC CHECK REVEALED NO WANTS.","geometry":{"type":"Point","coordinates":[-75.1205,39.9943]}},{"objectid":749536,"districtoccur":"39","age":29,"mvc_reason":"ON SIDEWALK","geometry":{"type":"Point","coordinates":[-75.162,40.0223]}},{"objectid":747750,"districtoccur":"12","age":52,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE TRAVELING W/B ON 5700 ELMWOOD CROSS INTO ONCOMING TRAFFIC TO GO AROUND MULTIPLE VEHICLES AND THEN DRIVE INTO THE BIKE LANE AND PROCEED TO GO INTO THE INTERSECTION PRIOR TO HAVING THE GREEN LIGHT AT 58 AND ELMWOOD AND 59 AND ELMWOOD. PCIC/NCIC CHECKED. NO WANTS. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.2192,39.93]}},{"objectid":748119,"districtoccur":"12","age":31,"mvc_reason":"LISTED VEHICLE OBSERVED WITH HEAVY TINT ON ALL WINDOWS TRAVELING EB ON ELMWOOD AVE SWERVING IN AND OUT OF BIKE LANE. NCIC PCIC CHECK REVEALED VEHICLE DRIVER HAD SUSPENDED PHOTO ID. TVR ISSUED. VEHICLE WAS RELEASED TO LICENSED PASSENGER. CBI","geometry":{"type":"Point","coordinates":[-75.2192,39.93]}},{"objectid":746279,"districtoccur":"12","age":37,"mvc_reason":"LISTED VEHICLE OBSERVED WITH HEAVY TINT ON ALL WINDOWS TRAVELING EB ON ELMWOOD AVE SWERVING IN AND OUT OF BIKE LANE. NCIC PCIC CHECK REVEALED VEHICLE DRIVER HAD SUSPENDED PHOTO ID. TVR ISSUED. VEHICLE WAS RELEASED TO LICENSED PASSENGER. CBI","geometry":{"type":"Point","coordinates":[-75.2192,39.93]}},{"objectid":741393,"districtoccur":"15","age":24,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED ON SIDEWALK ON 1600 BLOCK OF BRIDGE STREET AND TOTALLY BLOCKING PASSAGE FOR PEDISTRIANS. VEHICLE WAS OPERATED BY OWNER VEHICLE. POLICE RAN TAG ON VEHICLE IN ATTMEPT TO LOCATE OWNER. PCIC/NCIC SHOWS VEHICLE REGISTRATION EXPIRED IN JULY OF 2022. VEHICLE STOPPED FOR INVESTIGATION. TC FILED","geometry":{"type":"Point","coordinates":[-75.0768,40.0232]}},{"objectid":765613,"districtoccur":"39","age":42,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING W/B ON THE 2400 BLOCK OF CAMBRIA ST. AND DID NOT CLEAR THE CROSSWALK PRIOR TO MAKING A LEFT HAND TURN ON RED ONTO 24TH ST. PCIC/NCIC NO WARRANTS. POLICE ISSUED A VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.1701,39.9991]}},{"objectid":763256,"districtoccur":"16","age":34,"mvc_reason":"OPER MADE A LEFT TURN FROM S/B 39TH TO E/B FAIRMOUNT AVE AND CUT OFF A KID WHO WAS CROSSING IN THE CROSSWALK.  V.W.G.","geometry":{"type":"Point","coordinates":[-75.2001,39.9655]}},{"objectid":768309,"districtoccur":"06","age":33,"mvc_reason":"DRIVING IN BIKE LANE","geometry":{"type":"Point","coordinates":[-75.1551,39.9667]}},{"objectid":767061,"districtoccur":"18","age":36,"mvc_reason":"VEHICLE OBSERVED TRAVELING WESTBOUND ON IRVING ST WITH HEAVY TINT INCLUDING ON FRONT WINDSHIELD. VEHICLE MATCHED FLASH OF A  PATROL ALERT OF ADARK BLUE CHEVY SEDAN THAT WAS INVOLVED IN A DIRT BIKE THEFT IN THE 17TH REF#22-17-012978 VEHICLE STOPPED FOR INVESTIGATION. MALE OPERATOR HAD SUSPENDED LICENSE. MALE OPERATOR OR FRONT PASSENGER HAD NO WANTS. VERBAL WARNING ISSUED, POLICE OBSERVED MALE PARK VEHICLE AND LEAVE VEHICLE LEGALLY PARKED.","geometry":{"type":"Point","coordinates":[-75.2438,39.9574]}},{"objectid":778824,"districtoccur":"39","age":33,"mvc_reason":"POLICE OBSERVED THE LISTED VEH TRAVELING SB ON 22ND ST WITH AN UNREADABLE LICENSE PLATE WHICH WAS BEING COVERED BY A BIKE RACK, IMPEADING POLICE FROM BEING ABLE TO RUN THE TAG. THE VEH WAS STOPPED FOR INVEST, NCIC/PCIC NEG RESULTS, THE VEH WAS CBI.","geometry":{"type":"Point","coordinates":[-75.1669,39.9987]}},{"objectid":777712,"districtoccur":"08","age":51,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE ON ACADEMY RD PASS VEHICLES ON RIGHT SIDE NON RUNNING LANE (BIKE ONLY).","geometry":{"type":"Point","coordinates":[-75.0088,40.0674]}},{"objectid":769772,"districtoccur":"06","age":84,"mvc_reason":"DISREGARDED LANE MARKED FOR BIKE ONLY","geometry":{"type":"Point","coordinates":[-75.1551,39.9667]}},{"objectid":794853,"districtoccur":"39","age":20,"mvc_reason":"POLICE OBSERVED OPERATOR DRIVING A HIGHER THAN ALLOTTED SPEED TURN FROM HUNTING PARK ONTO SCHUYLER. THE OPERATOR APPEARED TO BE BEING FOLLOWED ANOTHER VEH(GREEN NISSAN ALTIMA). BOTH VEHS MADE ABRUPT LEFT TURNS ON RUFFNER WITHOUT SIGNALING. OPER CONTINUED NB ON WISSAHICKON AT A HIGH RATE OF SPEED. HE CONTINUED LEFT ON ROBERTS THEN NB ON FOX WHERE HE DROVE ON THE RS IN A BIKE LANE THE ENTIRE LENGTH OF THE STREET. \nBOTH VEHS WERE STOPPED AT LISTED LOC AND CBI.","geometry":{"type":"Point","coordinates":[-75.1692,40.004]}},{"objectid":795224,"districtoccur":"39","age":18,"mvc_reason":"POLICE OBSERVED OPERATOR DRIVING A HIGHER THAN ALLOTTED SPEED TURN FROM HUNTING PARK ONTO SCHUYLER. THE OPERATOR APPEARED TO BE BEING FOLLOWED ANOTHER VEH(GREEN NISSAN ALTIMA). BOTH VEHS MADE ABRUPT LEFT TURNS ON RUFFNER WITHOUT SIGNALING. OPER CONTINUED NB ON WISSAHICKON AT A HIGH RATE OF SPEED. HE CONTINUED LEFT ON ROBERTS THEN NB ON FOX WHERE HE DROVE ON THE RS IN A BIKE LANE THE ENTIRE LENGTH OF THE STREET. \nBOTH VEHS WERE STOPPED AT LISTED LOC AND CBI.","geometry":{"type":"Point","coordinates":[-75.1692,40.004]}},{"objectid":813190,"districtoccur":"08","age":46,"mvc_reason":"POLICE WAS PARKED AT ABOVE LOCATION AND OBSERVED ABOVE MALE DISREGARD ABOVE RED LIGHT BY MAKING A LEFT TURN W/B ON RHAWN, THERE WAS ALSO A CAR IN FRONT OF MALE MAKING A LEFT TURN WHO WAS HALF WAY IN CROSSWALK TURNING, MALE ALSO NOT WEARING SEAT BELT","geometry":{"type":"Point","coordinates":[-75.0283,40.0414]}},{"objectid":807896,"districtoccur":"35","age":20,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING WESTBOUND ON OLNEY AV USING THE BIKE LANE TO OVERTAKE OTHER FORWARD MOVING VEHICLES IN A CARELESS MANNER. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1545,40.0395]}},{"objectid":812313,"districtoccur":"24","age":28,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE AND OPERATOR PASS VEHICLE IN FRONT THROUGH THE RIGHT/BIKE LANE AND DISREGARD THE RED LIGHT AT THE INTERSECTION OF CASTOR AVE. AND KENSINGTON AVE. POLICE STOPPED VEHICLE FOR INVESTIGATION AT 1400 E. LUZERNE. OPERATOR WAS ISSUED A CITATION FOR DISREGARDING THE RED LIGHT. NFI.","geometry":{"type":"Point","coordinates":[-75.0997,40.0026]}},{"objectid":809078,"districtoccur":"12","age":40,"mvc_reason":"POLICE OBSERVED THE LISTED VEH TRAVELING N/B ON ABOVE LOCATION WITH BOTH LICENSE PLATE LIGHTS NOT FUNCTIONING AND  BIKE RACK PARTIALLY BLOCKING THE PLATE MAKING IT UNREADABLE. VEH STOPPLED FOR INVESTIGATION. NCIC PCIC CHECK YIELDED NEG RESULTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2323,39.9367]}},{"objectid":802653,"districtoccur":"18","age":27,"mvc_reason":"ABOVE VEHICLE WAS OBSERVED TRAVELING SOUTHBOUND AT A HIGH RATE OF SPEED CROSS THE INTERSECTION OF 53RD AND SPRUCE.  BECAUSE OF THE SPEED THE VEHICLE WAS TRAVELING AND CROSSING OVER A INTERSECTION THE VEHICLE HAD NEARLY BECOME AIRBORNE, CAUSING THE VEHICLE TO SWERVE A FEW TIMES TO GAIN CONTROL.  BECAUSE THE AREA RESIDENTIAL, AND HIGH IN PEDESTRIAN TRAFFIC THE ACTIONS WERE DEEMED UNSAFE AND STOPPED FOR INVESTIGATION. NCIC/PCIC-NEGATIVE FOR WANTS. OPERATOR WAS GIVEN A VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.2275,39.9572]}},{"objectid":802446,"districtoccur":"18","age":22,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE TRAVELING NORTHBOUND ON 53RD ST DISREGARD THE STOP SIGN AT THE ABOVE INTERSECTION. THE VEHICLE THEN TURNED EASTBOUND ON CHANCELLOR ST WITHOUT SIGNALING. POLICE THEN ACTIVATED THEIR LIGHTS AND SIRENS AND THE VEHICLE PULLED OVER INTO THE CROSSWALK OF 52ND AND CHANCELLOR (SOUTHEAST CORNER)","geometry":{"type":"Point","coordinates":[-75.2277,39.9561]}},{"objectid":795593,"districtoccur":"39","age":17,"mvc_reason":"POLICE OBSERVED OPERATOR DRIVING A HIGHER THAN ALLOTTED SPEED TURN FROM HUNTING PARK ONTO SCHUYLER. THE OPERATOR APPEARED TO BE FOLLOWING ANOTHER VEH(SILVER NISSAN MAX). BOTH VEHS MADE ABRUPT LEFT TURNS ON RUFFNER WITHOUT SIGNALING. OPER CONTINUED NB ON WISSAHICKON WHERE HE WAS OBS MAKING A LEFT THRU THE RED SIGNAL ONTO ROBERTS. HE THEN MADE A RIGHT ON FOX WHERE HE DROVE ON THE RIGHT SIDE IN A BIKE LANE.\nBOTH VEHS WERE STOPPED AT LISTED LOC AND CBI.","geometry":{"type":"Point","coordinates":[-75.1692,40.004]}},{"objectid":796416,"districtoccur":"18","age":54,"mvc_reason":"POLICE OBSERVED VEHICLE STOP AT THE CROSSWALK THEN MAKE A LEFT HAND TURN ON A STEADY RED SIGNAL AT 5200 SPRUCE ST, POLICE CONDUCTED A CAR STOP AND GAVE DRIVER A VERBAL WARNING. NCIC/PCIC. NO WANTS","geometry":{"type":"Point","coordinates":[-75.2261,39.9546]}},{"objectid":825980,"districtoccur":"39","age":23,"mvc_reason":"POLICE OBSERVED VEHICLE SOUTHBOUND ON BROAD STREET AT PIKE DISREGARD STEADY RED LIGHT HIGH RATE OF SPEED. THEN CONTINUE DRIVING VERY FAST SWITCHING LANES NO SIGNAL CUTTING OFF OTHER CARS WHILE PEDESTRIANS WERE IN CROSSING AREA. 5 TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.1506,40.0124]}},{"objectid":819306,"districtoccur":"06","age":40,"mvc_reason":"VEHICLE WAS TRAVELING IN BIKE LANE ON NORTH 13TH AND GOT INTO RIGHT TURN LANE BUT PROCEEDED STRAIGHT. NCIC/PCIC NO WANTS.  VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1606,39.9562]}},{"objectid":841428,"districtoccur":"39","age":14,"mvc_reason":"ALL EXTERIOR FORWARD AND REARWARD FACING LAMPS WERE NOT ACTIVATED, AS REQUIRED PER STATE LAW, SINCE IT WAS CURRENTLY A PERIOD OF REQUIRED LIGHTING. THE PERIOD I AM REFERRING TO WAS NIGHTFALL. THIS IS A HAZARD TO OTHER MOTORISTS (INCLUDING THIS OPERATOR), AS WELL AS PEDESTRIANS WHO MAY BE WALKING INTO THE ROADWAY, AS THIS CAR MAY NOT BE SEEN AT A REASONABLE DISTANCE.","geometry":{"type":"Point","coordinates":[-75.1682,40.0004]}},{"objectid":838450,"districtoccur":"14","age":35,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING E/B ON 74TH AVE DISREGARD THE STOP SIGN WITHOUT BRAKING AT AN EXSESSIVE SPEED FOR A RESIDENTIAL STREET WITH PEDESTRIANS IN THE AREA. THE VEHICLE CONTINUED TO DISREGARD THE STOP SIGNS AT 74TH AND WALNUT, ASWELL AS 75TH AND BRIAR. NCIC/PCIC NO WANTS. VERBAL WARNING GIVEN. CBI.","geometry":{"type":"Point","coordinates":[-75.1543,40.0674]}},{"objectid":839973,"districtoccur":"12","age":20,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE WITH HEAVY  TINT ON SIDE WINDOWS AND REAR WINDHSHIELD OBSTRUCTING VIEW INSIDE OF VEHICLE. VEHICLE WAS IN THE STANDING POSITION WITH HAZARDS ON AT THE CORNER OF 66TH AND CHESTER AVE BLOCKING THE CROSSWALK. POLICE INITIATED VEHICLE STOP AND MADE CONTACT WITH LISTED MALE DRIVER/OWNER. UPON APPROACH OF VEHICLE MALE WAS VISIBLY NERVOUS AND SHAKING WHEN PROVIDING PAPER WORK TO POLICE. POLICE ASKED MALE IF THERE WERE ANY WEAPONS IN VEHICLE IN WHICH HE REPLIED NO. MALE WAS","geometry":{"type":"Point","coordinates":[-75.237,39.9278]}},{"objectid":852902,"districtoccur":"06","age":54,"mvc_reason":"DRIVER WAS S/B ON 10TH STREET , ABOUT TO TURN LEFT ON MARKET W/OUT YIELDING RIGHT OF WAY TO PED ON CROSSWALK. WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1567,39.9515]}},{"objectid":837012,"districtoccur":"15","age":10,"mvc_reason":"LISTED AUTO WAS OBSERVED BY POLICE TRAVELING ON THE 5100 BLOCK OF DARRAH STREET GOING THE WRONG WAY ON A ONE WAY AND TRAVEL THROUGH THE STOP SIGN. LISTED AUTO, A BLUE SCOOTER, WAS STOPPED FOR INVESTIGATION.  BMV CHECK OF THE AUTO, WAS IN GOOD STATUS. THE OPERATOR WHO WAS A JUVENILE ALSO HAD ANOTHER JUVENILE ON THE BACK. BOTH MALES STOPPED FOR INVESTIGATION. FURTHER INVESTIGATION REVEALED THE BIKE WAS A GIFT AND THE TWO MALES WERE FURTHER INSTRUCTED BY POLICE ON THE PROPER WAY TO OPERATE THE AUTO","geometry":{"type":"Point","coordinates":[-75.0776,40.0212]}},{"objectid":856249,"districtoccur":"06","age":75,"mvc_reason":"TRAVELING EAST ON CHESTNUT IN LANE MARKED FOR BUSSES AND BIKES ONLY","geometry":{"type":"Point","coordinates":[-75.1461,39.9486]}},{"objectid":869741,"districtoccur":"18","age":22,"mvc_reason":"POLICE OBSERVED VEHICLE TURNING RIGHT ONTO COBBS CREEK PARKWAY FROM WALNUT WHILE THERE WERE PEDESTRIANS CROSSING THE STREET AND PULLED IN FRONT OF THE PEDESTRIANS, FAILING TO YIELD TO THEM IN THE CROSS WALK. POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECKED WITH NEGATIVE RESULTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2471,39.9611]}},{"objectid":870103,"districtoccur":"18","age":34,"mvc_reason":"POLICE OBSERVED VEHICLE TURNING RIGHT ONTO COBBS CREEK PARKWAY FROM WALNUT WHILE THERE WERE PEDESTRIANS CROSSING THE STREET AND PULLED IN FRONT OF THE PEDESTRIANS, FAILING TO YIELD TO THEM IN THE CROSS WALK. POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECKED WITH NEGATIVE RESULTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2471,39.9611]}},{"objectid":869743,"districtoccur":"18","age":20,"mvc_reason":"POLICE OBSERVED VEHICLE TURNING RIGHT ONTO COBBS CREEK PARKWAY FROM WALNUT WHILE THERE WERE PEDESTRIANS CROSSING THE STREET AND PULLED IN FRONT OF THE PEDESTRIANS, FAILING TO YIELD TO THEM IN THE CROSS WALK. POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECKED WITH NEGATIVE RESULTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2471,39.9611]}},{"objectid":870338,"districtoccur":"09","age":71,"mvc_reason":"VEHICLE DOUBLE PARKED IN BIKE LANE CAUSING BICYCLIST TO RIDE INTO ONCOMING TRAFFIC,    OPERATOR LOCATED AND MOVED VEHICLE FOR POLICE","geometry":{"type":"Point","coordinates":[-75.1778,39.9674]}},{"objectid":893053,"districtoccur":"06","age":63,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING SOUTHBOUND ON LISTED LOCATION TRAVELING IN A BIKE LANE ONLY LANE. NCIC/PCIC NEGATIVE RESULTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1568,39.9662]}},{"objectid":916085,"districtoccur":"18","age":22,"mvc_reason":"VEHICLE OBSERVED STOPPED AND RUNNING ON THE SIDEWALK AT ABOVE LOCATION. VEHICLE REGISTRATION EXPIRED SINCE 03/2021. VEHICLE STOPPED FOR INVESTIGATION, NO WANTS. MALE HAD PERMIT TO CARRY AND LEGAL FIREARM, REMOVED FOR DURATION OF STOP AND RETURNED. TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.2231,39.9592]}},{"objectid":913475,"districtoccur":"19","age":65,"mvc_reason":"VEHICLE OBSERVED WEST ON THOMPSON STREET THROUGH THE INTERSECTION OF 54TH AND THOMPSON. THE VEHICLE WAS OBSERVED PROCEEDING THROUGH THE INTERSECTION WHILE A FAMILY OF PEDESTRIANS WHO HAD ALREADY BEGAN CROSSING SOUTH ON 54TH ST. THE FAMILY HAD TO STOP CROSSING TO NOT BE HIT BY THE VEHICLE. PCIC NCIC NO WANTS VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.229,39.9726]}},{"objectid":905755,"districtoccur":"06","age":53,"mvc_reason":"DRIVING IN MARKED LANE BIKE ONLY","geometry":{"type":"Point","coordinates":[-75.161,39.9541]}},{"objectid":908031,"districtoccur":"25","age":35,"mvc_reason":"POLICE OBSERVED VEH ON SIDEWALK PARKED OPORATOR GOT INTO VEH AND DROVE VEH OFF OF SIDEWALK MVC 3703A. VEH HAS HEAVY TINT ALL WINDOWS INCL WINDSHIELD. OPERATOR HAS SUSPENDED PA DL. NO WANTS ON VEH. MULTIPLE TVR&APOS;S ISSUED","geometry":{"type":"Point","coordinates":[-75.1453,40.0038]}},{"objectid":903620,"districtoccur":"25","age":26,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE WITH 4 WHEELS ON THE SIDEWALK. AS THE POLICE APPROACHED TO THE VEHICLE, THE VEHICLE STARTED MOVING FORWARD. VEHICLE WAS NCIC/PCIC CHECKED CAME BACK WITH A SUSPENDED DRIVER LICENSE DUI (II). VEHICLE WAS LIVED STOPPED FROM ABOVE LOCATION AND TAKEN LOT 6 BY PPA. TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.1421,40.0034]}},{"objectid":931880,"districtoccur":"24","age":32,"mvc_reason":"VEHICLE OBSERVED DRIVING AND IDLING ON TO SIDEWALK ON THE NORTH EAST CORNER OF AUBURN CORAL. THE VEHICLE WAS STOPPED FOR INV. NO WANTS PER NCIC/PCIC.","geometry":{"type":"Point","coordinates":[-75.1189,39.9892]}},{"objectid":935227,"districtoccur":"02","age":31,"mvc_reason":"THE VEH WAS TRAV ON CASTOR AND FAILED TO YIELD TO PEDESTRIANS IN CROSSWALK AT COTTMAN, ADVISED. UPON POLICE INVEST THE DRIVER WAS NOT WEARING A SEATBELT.","geometry":{"type":"Point","coordinates":[-75.066,40.0512]}},{"objectid":935228,"districtoccur":"22","age":33,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE DISREGARD STOP SIGN AT ABOVE LOCATION. NCIC/PCIC CHECK CLEAN, NO WANTS ON VEHICLE OR DRIVER/PEDESTRIAN. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1848,39.9837]}},{"objectid":936780,"districtoccur":"18","age":39,"mvc_reason":"LISTED VEHICLE OBSERVED BY POLICE OPERATING SOUTH AT LISTED LOCATION AT A HIGH RATE OF SPEED AND NOT MAKING COMPLETE STOPS AT STOP SIGNS. VEHICLE ALSO TURNED LEFT ON A GREEN LIGHT AT 51ST AND SPRUCE AND DID NOT HAVE THE RIGHT AWAY. VEHICLE AND OPERATOR DRIVING WITHOUT CARE FOR OTHER DRIVERS AND/OR PEDESTRIANS. SFI. NCIC/PCIC NEG. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2243,39.9529]}},{"objectid":967822,"districtoccur":"25","age":20,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE PARKED ON THE SIDEWALK WHILE RUNNING AND OCCUPIED 4X. POLICE HAD ALSO RESPONDED TO THE AREA FOR A VEHICLE MATCHING THIS DESCRIPTION FOR FOUR MALES WITH GUNS AND DRUGS. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC NO WANTS. OCCUPANTS ADVISED.","geometry":{"type":"Point","coordinates":[-75.1285,39.999]}},{"objectid":967824,"districtoccur":"25","age":25,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE PARKED ON THE SIDEWALK WHILE RUNNING AND OCCUPIED 4X. POLICE HAD ALSO RESPONDED TO THE AREA FOR A VEHICLE MATCHING THIS DESCRIPTION FOR FOUR MALES WITH GUNS AND DRUGS. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC NO WANTS. OCCUPANTS ADVISED.","geometry":{"type":"Point","coordinates":[-75.1285,39.999]}},{"objectid":959130,"districtoccur":"18","age":29,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING W/B ON PINE ST WITH TINT SO HEAVY ALL AROUND POLICE COULD NOT SEE INSIDE. VEHICLE ALSO EXCEEDED WHITE CROSSWALK WHEN STOPPING AT STOP SIGN. VEHICLE THEN TURNED N/B ON S 61ST WHERE POLICE ACTIVATED LIGHTS WHERE VEHICLE PULLED OVER PROMPTLY. NCIC PCIC GOT NEG RESULTS. DRIVER WAS COOPERATIVE AND LET GO WITH WARNING","geometry":{"type":"Point","coordinates":[-75.2459,39.957]}},{"objectid":986734,"districtoccur":"17","age":54,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE AT ABOVE LISTED LOCATION TRAVELLING N/B ON S 16TH STREET WHEN HE FAILED TO A YIELD TO A CROSSING PEDESTRIAN IN THE CROSSWALK. PEDESTRIAN HAD TO JUMP OUT OF THE WAY TO AVOID BEING HIT. POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECKED, NO WANTS. POLICE ISSUED TVR: C3DM60082P2. VEHICLE RELEASED WITHOUT INCIDENT.","geometry":{"type":"Point","coordinates":[-75.1694,39.9412]}},{"objectid":987959,"districtoccur":"24","age":57,"mvc_reason":"POLICE WERE STOPPED ON 3100 EMERALD ST FACING NORTHBOUND WHEN THEY OBSERVED LISTED VEHICLE CUT THROUGH THE PARKING LOT OF &QUOT;K LAUNDROMAT&QUOT; TO DISREGARD THE STEADY RED LIGHT. POLICE WAITED FOR THE LIGHT TO TURN GREEN WHEN THEY OBSERVED THE SAME VEHICLE TRAVELING IN THE BIKE LANE ON 2000 ALLEGHENY AVE DISREGARDING REGULAR TRAFFIC FLOW. MALE MADE A RIGHT TURN ONTO 3100 FRANKFORD AVE WHEN POLICE ACTIVATED THEIR OVERHEAD LIGHTS AND SIRENS WHERE MALE PULLED OVER WITHOUT INCIDENT. DRIVER AND VE","geometry":{"type":"Point","coordinates":[-75.1137,39.993]}},{"objectid":986615,"districtoccur":"25","age":24,"mvc_reason":"THE ABOVE GOLF CART WAS BEING OPERATED ON CITY STREETS. THE VEHICLE ALSO ROAD UP ONTO THE SIDEWALK TO PASS STOP TRAFFIC. THE REAR PASSENGER FLED ON FOOT AS THE GOLF CART FLED AND WAS LOST IN THE AREA. POLICE WERE ABLE TO STOP THE THIRD MALE AT 3000 ORIANA WITH OUT INCIDENT. THE PASSENGER WAS CLEARED BY INVESTIGATION AND RELEASED.","geometry":{"type":"Point","coordinates":[-75.1339,40.0019]}},{"objectid":988090,"districtoccur":"18","age":50,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING NORTHBOUND AT THE LISTED LOCATION AT A HIGH RATE OF SPEED, WELL ABOVE THE POSTED SPEED LIMIT AND USE THE LEFT BIKE LANE ON 4100 CHESTNUT ST. AS A TURNING LANE TO TURN NORTHBOUND ONTO 1 S. 41ST. ST. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK, NEGATIVE RESULTS. VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.2042,39.957]}},{"objectid":976365,"districtoccur":"08","age":25,"mvc_reason":"POLICE OBSERVED LISTED DIRTBIKE AT 5200 LINDEN AVE (BOAT RAMP) BEING OPERATED BY LISTED MALE VIOLATION OF CITY ORDINANCE. LISTED DIRTBIKE CONFISCATED AND PLACED ON PROPERTY RECEIPT #3491650.","geometry":{"type":"Point","coordinates":[-74.992,40.0434]}},{"objectid":996612,"districtoccur":"06","age":40,"mvc_reason":"OPERATOR OBSERVED BY POLICE GOING N/B ON  9TH STREET OPERATOR FAIL TO YIELD TO PEDESTRIAN IN CROSSWALK.","geometry":{"type":"Point","coordinates":[-75.1551,39.9514]}},{"objectid":1010713,"districtoccur":"24","age":21,"mvc_reason":"POLICE NOTICE THE LISTED VEHICLE AT KENSINGTON AND E ORLEANS ST WITH NO REAR LICENSE PLATE PROPERLY VISIBLE CROSSING KENSINTON AVE THE VEHICLE THEN TURNED OFF THERE LIGHTS WHILE DRIVING ONTO 600 E INDIANA AVE GOING WESTBOUND WAS ALSO OBSERVED RIDING ON THE SIDEWALK. DURING POLICE INVESTIGATION THE MALE WAS ASKED WHY WAS HE SHAKING AND IF HE NEEDED MEDICAL ATTENION. HE STATED NO, THE MALE WAS ALSO ASKED SEVERAL TIMES TO STOP REACHING AROUND IN THE VEHICLE THE MALE WAS ASKED TO STEP OUTSIDE OF THE","geometry":{"type":"Point","coordinates":[-75.1199,39.9941]}},{"objectid":1007581,"districtoccur":"16","age":17,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVAILING W/B ON HAVERFORD TOTALLY DISREGARD THE STEADY RED LIGHT AT THE INTERSECTION OF 39TH AND HAVERFORD AS SMALL CHILDREN WERE PLAYING ON THE SIDEWALK POLICE STOPPED VEHICLE FOR INVESTIGATION NCIC/PCIC CHECK NO WANTS DRIVER GIVEN TVR FOR VIOLATION DUE TO THE PRINTER BEING DOWN IN THE RPC VIOLATION WILL BE MAILED.","geometry":{"type":"Point","coordinates":[-75.2002,39.9619]}},{"objectid":1003463,"districtoccur":"19","age":28,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE STOPPED IN THE BUS LANE AT 5601 MARKET STREET. THE DRIVER WAS OBSERVED PULLING OUT OF THE BUS LANE WITH NO TURN SIGNAL. THE DRIVER WAS OBSERVED MAKING A LEFT TURN ONTO 57TH STREET WITH NO TURN SIGNAL AND NOT LETTING A PEDESTRIAN CROSS THE STREET THAT WAS ALREADY IN THE MIDDLE OF THE INTERSECTION. POLICE STOPPED THE VEHICLE AND GAVE A VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.233,39.9611]}},{"objectid":1007745,"districtoccur":"25","age":26,"mvc_reason":"POLICE OBSERVED THE VEHICLE PARKED RUNNING WITH HEAVY TINT ON WINDOWS AT THE ITNERSECTION OF 7TH AND LUZERNE. VEHICLE OBSTRUCTING THE INTERSECTION AND CROSSWALK. POLICE STOPPED TO INVESTIGATE. PCIC/NCIC SHOWED NO WANTS, DRIVER GIVEN VERBAL WARNING AND TOLD TO PARK VEHICLE LEGALLY","geometry":{"type":"Point","coordinates":[-75.1395,40.0126]}},{"objectid":1007753,"districtoccur":"25","age":26,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE PARKED ON THE 4000 BLOCK OF N 7TH ST WITH DARK TINT WHILE STILL RUNNING BLOCKING THE CROSSWALK. VEHICLE STOPPED FOR INVESTIGATION. DURING THE INVESTIGATION, THE OPERATOR GAVE POLICE VERBAL CONSENT TO SEARCH THE VEHICLE. VEHICLE SEARCHED WITH NEGATIVE RESULTS. NCIC/PCIC NO WANTS. VERBAL WARNING GIVEN. CBI.","geometry":{"type":"Point","coordinates":[-75.1395,40.0126]}},{"objectid":1003356,"districtoccur":"24","age":31,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE PARTIALLY PARKED ON THE SIDEWALK CORNER OF ANN ST AND FRANKFORD AV RUNNING. POLICE WAS UNSURE IF THE VEHICLE WAS OCCUPIED DUE TO THE TINT ON ALL WINDOWS. PCIC/NCIC NO WANTS VERBAL WARNING GIVEN BWC ACTIVATED","geometry":{"type":"Point","coordinates":[-75.1177,39.9898]}},{"objectid":1003746,"districtoccur":"39","age":59,"mvc_reason":"PERIOD FOR REQUIRED LIGHTING:\nVEHICLE WAS SEEN DURING NIGHTFALL HOURS WITH NO EXTERIOR LIGHTING ACTIVATED, CREATING A HAZZARD TO MOTORISTS AND PEDESTRIANS ALIKE.","geometry":{"type":"Point","coordinates":[-75.1756,39.9967]}},{"objectid":1004088,"districtoccur":"39","age":35,"mvc_reason":"VEHICLE OBSERVED HEADING E/B ON LEHIGH AVE, PASSING VEHICLES ON THE LEFT. THE ROADWAY ORIENTATION IS ONE LANE W/ BIKE LANE IN EACH DIRECTION. NCIC PCIC, REFLECTS NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1756,39.9967]}},{"objectid":1016700,"districtoccur":"15","age":22,"mvc_reason":"VEHICLE OBSERVED TRAVELING N/B ON FRANKFORD. VEHICLE SWERVED OVER INTO THE PARKING LANE ALMOST STRIKING A PEDESTRIAN. VEHICLE THEN SWERVED BACK TO MIDDLE DIVIDER ALMOST STRIKING EL SUPPORT PILLAR.","geometry":{"type":"Point","coordinates":[-75.0839,40.0168]}},{"objectid":1015037,"districtoccur":"18","age":29,"mvc_reason":"ABOVE VEHICLE WAS OBSERVED TRAVELING EASTBOUND ON MARKET STREET WITH TINTED SIDE AND REAR WINDOWS OF THE VEHICLE.  TINT MATERIAL CAUSED A VISUAL OBSTRUCTION DURING NIGHT TIME HOURS. VEHICLE WAS ALSO TRAVELING AT AN UNSAFE SPEED FOR THE MARKET STREET CORRIDOR, DUE TO THE COLLEGE CAMPUS AND HEAVY PEDESTRIAN TRAFFIC IN THE AREA.  VEHICLE WAS STOPPED FOR INVESTIGATION, NCIC/PCIC-NEGATIVE FOR WANTS. MALE WAS SUBSEQUENTLY ARRESTED FOR NARCOTICS VIOLATIONS.","geometry":{"type":"Point","coordinates":[-75.2008,39.9569]}},{"objectid":1015395,"districtoccur":"24","age":46,"mvc_reason":"VEHICLE N/B ON KENSINGTON AND STOPPED IN CROSSWALK ON THE 3300 BLOCK.  OPERATOR WEARING REQUIRED SAFETY BELT.  VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1107,39.9981]}},{"objectid":1019206,"districtoccur":"25","age":38,"mvc_reason":"POLICE OBSERVED VEH ON PARKED ON SIDEWALK ON TOP OF THE HANDICAP RAMP. POLICE OBSERVED VEH WITH 2 OCCUPANTS EXIT THEN GET BACK IN AFTER APPROX 5 MINS. VEH REVERSED OFF OF SIDEWALK AND HANDICAP RAMP. POLICE STOPPED VEH FOR INVESTIGATION. NCIC/PCIC NO WANTS TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.1306,39.9926]}},{"objectid":1016229,"districtoccur":"19","age":22,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELLING S/B ON 5200 MARKET ST WHILE POLICE WERE IN REAR, POLICE OBSERVED LISTED VEHICLE WITH HEAVY TINT AROUND ALL VEHICLE, HEAVY TINT CAUSING A HAZORDOUS ENVIRONMENT TO PEDESTRIAN, POLICE AND THE OPERATOR DUE TO DIFFICULTIES SEEING OUT THE VEHICLE. NCIC/PCIC SHOWED NO WANTS, UPON VEHICLE INVESTIGATION OPERATOR WAS UNABLE TO SHOW PROPER OWNERSHIP OF VEHICLE, POLICE VERIFIED THE VEHICLE WITH A TITLE, POLICE ADVISED OPERATOR TO PARK VEHICLE AND POLICE GAVE VERBAL","geometry":{"type":"Point","coordinates":[-75.2253,39.96]}},{"objectid":1019050,"districtoccur":"25","age":33,"mvc_reason":"POLICE OBSERVED VEH ON PARKED ON SIDEWALK ON TOP OF THE HANDICAP RAMP. POLICE OBSERVED VEH WITH 2 OCCUPANTS EXIT THEN GET BACK IN AFTER APPROX 5 MINS. VEH REVERSED OFF OF SIDEWALK AND HANDICAP RAMP. POLICE STOPPED VEH FOR INVESTIGATION. NCIC/PCIC NO WANTS TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.1306,39.9926]}},{"objectid":998218,"districtoccur":"06","age":32,"mvc_reason":"OBSERVED A SILVER SUV TRAVELING NORTH ON 13TH STREET TOWARDS RACE STREET IN THE BIKE LANE. LANE CLEARLY MARKED. OPERATOR ADVISED. NCIC/PCIC NO WANTS","geometry":{"type":"Point","coordinates":[-75.1602,39.9578]}},{"objectid":1001776,"districtoccur":"08","age":27,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE PASS A TRACTOR TRAILER DRIVING NORTH BOUND ON STATE THE VEHICLE WENT INTO A DESIGNATED BIKE LANE AND PARKING LANE. POLICE ATTEMPTED TO STOP THE VEHICLE ON 9600 STATE ROAD AND IT CONTINUED TO DRIVE NORTH ON STATE INTO SALEM HARBOR. THE VEHICLE THEN STOPPED ON OLD BRIDGE ROAD AND THE OCCUPANTS ROLLED THE WINDOWS TO THE VEHICLE UP. THE VEHICLE THEN BEGAN MOVING AS IF THE PASSENGERS INSIDE THE VEHICLE WERE MOVING ALL AROUND THE CAR. THE CAR CONTINUED TO SHAKE POLICE","geometry":{"type":"Point","coordinates":[-74.9843,40.0522]}},{"objectid":999123,"districtoccur":"12","age":26,"mvc_reason":"POLICE WERE TRAVELING EASTBOUND ON 6700 NORWITCH DRIVE WHEN ABOVE VEHICLE TRAVELING EASTBOUND ON 6700 NORWITCH DR DROVE ON THE RIGHT SHOULDER INTO THE BIKE LANE AND AROUND POLICE AND THEN PROCEEDED TO DRIVE INTO ONCOMING TRAFFIC AND OVER TAKE A VEHICLE ON THE LEFT. PCIC/NCIC CHECKED. NO WANTS. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.2236,39.9143]}},{"objectid":1020690,"districtoccur":"35","age":20,"mvc_reason":"VEHICLE OBSERVED TRAVELING S/B ON OGONTZ AVE IN A MANNER THAT WAS CARELESS TO OTHER MOTORISTS AND PEDESTRIANS. WHILE EN ROUTE TO AEMC TO GET CONDITIONS ON A HCACC POLICE WERE TRAVELING S/B ON OGONTZ AVE AND OBSERVED THE LISTED VEHICLE DRIVE IN THE CENTER MEDIAN LANE, PASSING AT LEAST SIX VEHICLES THAT WERE ALSO IN MOTION. THE LISTED VEHICLE STOPPED AT THE STEADY RED TRAFFIC LIGHT IN THE LEFT TURN ONLY LANE AND WHEN THE LIGHT TURNED GREEN THE OPERATOR CUT BACK TO THE RIGHT TO CUT OFF THE VEHICLES","geometry":{"type":"Point","coordinates":[-75.1498,40.0548]}},{"objectid":1020850,"districtoccur":"35","age":24,"mvc_reason":"VEHICLE OBSERVED IN THE MIDDLE OF OGONTZ AVE DOING MULTIPLE DOUGHNUTS CAUSING HAZARDS TO MOTORIST AND PEDESTRIANS. VEHICLE STOPPED IN REAR ALLEY OF 6500 OGONTZ AVE\nDRIVER ISSUED VERBAL WARNING  , ADVISED HAZARDS","geometry":{"type":"Point","coordinates":[-75.1498,40.0548]}},{"objectid":1019825,"districtoccur":"24","age":31,"mvc_reason":"POLICE OBSERVED ABOVE DIRTBIKE TRAVELING N/B ON KENSINGTON AVE AT A HIGH RATE OF SPEED WHILE DOING WHEELIES AND SWRIVING IN AND OUT AND AROUND TRAFFIC. DIRTBIKE STOPPED AT THE INTERSECTION OF PIKE AND KENSINGTON. NCIC/PCIC CHECK RAN ON DIRTBIKE AND OPERATOR WITH NO WANTS. OPERATOR ISSUED VERBAL WARNING AND RELEASED FROM THE LOCATION.","geometry":{"type":"Point","coordinates":[-75.0991,40.0044]}},{"objectid":1041177,"districtoccur":"19","age":35,"mvc_reason":"POLICE WERE TRAVLLING S/B TOWARDS 6100 VINE WHEN POLICE OBSERVED LISTED VEHICLE WITH HEAAVY TINT AROUND ALL VEHICLE. HEAVY TINT CAUSES A HAZORDOUUS ENVIRONMENT TO OPERATOR, PEDESTRIANS, AND POLICE/ VEHICLE INVESTIGATION WAS CONDUCTED. NCIC/PCIC CHECK SHOWED NO WNATS. VERBAL WRNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2419,39.9668]}},{"objectid":1035831,"districtoccur":"03","age":18,"mvc_reason":"VEH WAS TRAVELING NORTH ON CHRISTOPHER COLUMBUS BLVD. VEH IS A DIRT BIKE WHICH WAS BEING ILLEGALLY OPERATED ON THE HIGHWAY. VEH WAS STOPPED BY POLICE FOR INVESTIGATION. NCIC/PCIC YIELDED NO WANTS. VEH WAS TOWED BY PPA TO M&AMP;W FOR MAJOR CRIMES.","geometry":{"type":"Point","coordinates":[-75.1413,39.9204]}},{"objectid":1032357,"districtoccur":"39","age":56,"mvc_reason":"OPERATING ON SIDEWALK","geometry":{"type":"Point","coordinates":[-75.1781,40.0143]}},{"objectid":1035406,"districtoccur":"18","age":36,"mvc_reason":"VEHICLE PROCEEDED THROUGH THE INTERSECTION TURNING FROM 54TH TO MARKET WITHOUT YIELDING TO THE PEDESTRIAN WALKING THROUGH THE CROSSWALK. VEHICLE WAS STOPPED FOR INVESTIGATION. NCIC/PCIC/BMV, NO WANTS. MALE WARNED AND RELEASED.","geometry":{"type":"Point","coordinates":[-75.2288,39.9604]}},{"objectid":1042849,"districtoccur":"15","age":56,"mvc_reason":"POLICE OBSERVED VEHICLE GOING SOUTH OH TORRESDALE AVE AND DISREGARD THE SOLID RED SIGNAL AT TORRESDALE AND KNORR ST. POLICE ALSO OBSERVED VEHICLE ILLEGALLY PASS A STOPPED VEHICLE AT THE RED LIGHT IN THE BIKE LANE AND GO THRU THE RED LIGHT. PCIC/NCIC NO WANTS.","geometry":{"type":"Point","coordinates":[-75.0446,40.0253]}},{"objectid":1046837,"districtoccur":"18","age":17,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING SOUTH BOUND ON 52ND ST IN THE BIKE LANE/SHOULDER TO MAKE A RIGHT HAND TURN TO TRAVEL WEST BOUND ONTO WALNUT ST. NCIC/PCIC - NO WANTS. THE OPERATOR WAS GIVEN A VERBAL WARNING. CLEARED BY INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.2253,39.9584]}},{"objectid":1049178,"districtoccur":"19","age":14,"mvc_reason":"POLICE OBSERVED THE LISTED MALE RIDING A BICYCLE ON THE SIDEWALK OF A BUSINESS CORRIDOR OF 100 N. 52. POLICE PULLED ALONGSIDE OF THE MALE AND ASKED HIM TO STOP. MALE CONTINUED N/B ON 100 N 52 AND BEGAN TO ACCELERATE. POLICE CONTINUED TO FOLLOW MALE AS HE REFUSED TO STOP. MALE TRAVELED TO 300 N WILTON WHERE HE GOT OFF THE BIKE AND BEGAN TO RUN ON FOOT WHILE GRABBING THE FRONT OF HIS WAISTBAND. POLICE GAVE CHASE INTO AN ALLEY ON 300 N WILTON WHERE MALE LIFTED HIS HOODIE AND REACHED FOR THE BLACK F","geometry":{"type":"Point","coordinates":[-75.2246,39.9618]}},{"objectid":1052228,"districtoccur":"35","age":23,"mvc_reason":"POLICE OBSERVED THE ABV VEHICLE TRAVELING E/B ON STENTON WITH AN EXPIRED REG 5/22 GOING AROUND TRAFFIC IN BIKE LANE. VEHICLE STOPPED FOR INVESTIGATION. OPERATOR/VEHICLE/OCCUPANT RAN THROUGH PCIC/NCIC. NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1438,40.0479]}},{"objectid":1054606,"districtoccur":"18","age":65,"mvc_reason":"VEHICLE OBSERVED BY POLICE S/B ON 56TH WHEN IT TURNED ONTO E/B SPRUCE WITHOUT YIELDING TO THREE PEDESTRIANS IN THE CROSSWALK K(1 ADULT AND 2 CHILDREN). VEHICLE STOPPED. NCIC/PCIC/BMV, NO WANTS. MALE ISSUED TVR AND RELEASED.\n\nMVC3542A-FAIL TO YIELD RIGHT OF WAY TO PEDESTRIANS","geometry":{"type":"Point","coordinates":[-75.2342,39.9555]}},{"objectid":1068059,"districtoccur":"18","age":51,"mvc_reason":"VEHICLE OBSERVED BY POLICE TRAVELING CLOSELY TO AN EMERGENCY VEHICLE WITH LIGHTS AND SIRENS ACTIVATED. PEDESTRIAN VEHICLE WAS ATTEMPTING TO RIDE THROUGH HEAVY TRAFFIC BY USING USING EMERGENCY VEHICLE AS THE LEAD VEHICLE. TVRS ISSUED.","geometry":{"type":"Point","coordinates":[-75.2005,39.9553]}},{"objectid":1070527,"districtoccur":"12","age":20,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED ON THE SIDEWALK ON 7000 WHEELER. WHEN POLICE ENGAGED LIGHTS AND SIRENS THE MALE BEGAN TO DRIVE AWAY BUT DID NOT STOP FOR THE POLICE. POLICE FINALLY STOPPED MALE IN THE EASTERN ALLEY OF 69TH ST. RAN THROUGH PCIC/NCIC WITH NO WANTS. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.2384,39.9179]}},{"objectid":1068792,"districtoccur":"12","age":36,"mvc_reason":"POLICE WERE HEADED WEST BOUND WHEN THE ABOVE VEHICLE PULLED OUT OF A PARKING SPOT CUTTING POLICE OFF AND THEN PROCEEDED TO DO AN ILLEGAL U-TURN OVER THE DOUBLE YELLOW LINES BLOCKING PASCHALL AND ALMOST STRIKING A PEDESTRIAN ON A SKATE BOARD. POLICE STOPPED VEHICLE FOR FURTHER INVESTIGATION. NCIC,PCICQUERY CHECK NO WANTS. TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.2357,39.9226]}},{"objectid":1067914,"districtoccur":"12","age":28,"mvc_reason":"LISTED VEH OBS TRAV S/B ON 2100 S. 65TH ST THEN TURN E/B ONTO 6400 WOODLAND AVE FAILING TO YIELD TO PEDESTRIAN CROSSING IN CROSSWALK. NCIC/PCIC NEG, MALE DRIVER UNLICENSED BUT OWNER, WHO STATED SHE WASN&APOS;T FEELING WELL, WAS SEATED IN FRONT PASSENGER SEAT. MALE &AMP; OWNER SWITCHED SEATS, WITH OWNER TAKING POSSESSION OF VEH, &AMP; BOTH ISSUED VERBAL WARNINGS.","geometry":{"type":"Point","coordinates":[-75.2355,39.9265]}},{"objectid":1064573,"districtoccur":"09","age":34,"mvc_reason":"VEHICLE TRAVELING N/B ON 20ST ST TOWARDS SPRING GARDEN ST BLOCK CROOSWALK AT INTERSECTION PREVENTING PEDESTRIANS FROM CROSSING. VEHICLE STOPPED FOR MVC VIOLATION. NEGTAIVE WANTS ON OPERATOR. OPERATOR GIVEN VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.1711,39.9635]}},{"objectid":1063900,"districtoccur":"12","age":20,"mvc_reason":"POLICE OBSERVED LISTED VEH PARKED AT 6000 REINHARD ST WITH THE KEYS IN THE IGNITION, VEHICLE RUNNING WHILE BLOCKING A CROSSWALK IN A HIGH CRIME AREA. POLICE RAN THE PA PLATE THROUGH NCIC/PCIC AND THE VEHICLE PLATE CAME BACK TO A JAGUAR BUT THE VEHICLE WAS A HONDA CIVIC. POLICE ACTIVATED OVERHEAD LIGHTS AND SIRENS AND APPROACHED THE VEHICLE. THE OPERATOR OF THE VEHICLE WAS AVOIDING EYE CONTACT WITH POLICE AND MUMBLING HIS WORDS. POLICE ASKED THE OWNER/OPERATOR OUT OF THE VEHICLE TO SPEAK WITH POL","geometry":{"type":"Point","coordinates":[-75.2299,39.9321]}},{"objectid":1066735,"districtoccur":"05","age":47,"mvc_reason":"THE OPERATOR OF THE LISTED VEHICLE MADE THE RIGHT TURN, WHILE THE LIGHT WAS RED, AGAINST THE POSTED NO TURN ON RED SIGN, AND A PEDESTRIAN WAS STARTING TO ENTER THE CROSSWALK. NCIC/PCIC/ BMV CHECK-CBI AND RELEASED WITH A WARNING.","geometry":{"type":"Point","coordinates":[-75.2177,40.031]}},{"objectid":1062002,"districtoccur":"25","age":23,"mvc_reason":"POLICE OBSERVED ABOVE VEH AT ABOVE LOCATION BEING OPERATED WITH WINDOW TINT SO DARK THAT POLICE COULD NOT SEE INTO THE VEH, THIS INCLUDED THE FRONT WINDSHIELD. THE VEH THEN ILLEGALLY PARKED BLOCKING A CROSSWALK. VEH STOPPED FOR PA MVC VIOLATIONS. NCIC/PCIC CHECK RAN ON OPERATOR AND VEH WITH NO WANTS. OPERATOR ISSUED VERBAL WARNING AND RELEASED FROM THE LOCATION.","geometry":{"type":"Point","coordinates":[-75.1316,39.9928]}},{"objectid":1074605,"districtoccur":"24","age":40,"mvc_reason":"VEHICLE WAS BLOCKING THE CROSSWALK.PCIC/NCIC MALE CAME BACK WANTED OCA #21-2603 BURLINGTON CO SHERIFFS OFFICE MOUNT HOLLY 609-265-5504. POLICE ATTEMPTED TO CONTACT. NEGATIVE RESULTS.","geometry":{"type":"Point","coordinates":[-75.1215,39.9902]}},{"objectid":1061313,"districtoccur":"25","age":41,"mvc_reason":"THE  ABOVE VEHICLE MADE A RIGHT TURN ONTO 5TH AND NEARLY STRUCK A PEDESTRIAN WALKING ACROSS THE STREET. THE VEHICLE ALSO HAD HEAVY TINT. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1381,40.0026]}},{"objectid":1086106,"districtoccur":"15","age":42,"mvc_reason":"ABOVE WAS OBSERVED TRAVELING S/B ON FRANKFORD AVE AND MADE A LEFT TURN ONTO HARBISON AVE. ABOVE DID NOT YIELD TO THE PEDESTRIANS IN THE CROSS WALK. ABOVE WAS STOPPED FOR MVC 3542-A. NO WANTS WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.0622,40.0276]}},{"objectid":1086181,"districtoccur":"25","age":31,"mvc_reason":"POLICE OBSERVED ABOVE VEH BEING OPERATED AT ABOVE LOCATION WITH TINTED WINDOWS SO DARK THAT POLICE COULD NOT SEE INTO THE VEH, THE VEH ALSO A HAD A TINTED LICENSE PLATE COVER MAKING THE TAG UNREADABLE FROM A REASONABLE DISTANCE. THE VEH THEN PARKED COMPLETLEY ON THE SIDEWALK AT THE ABOVE LOCATION ON THE SOUTHSIDE OF VENANGO. VEH STOPPED FOR PA MVC VIOLATIONS. NCIC/PCIC CHECK RAN ON OPERATOR AND VEH WITH NO WANTS. OPERATOR ISSUED VERBAL WARNING AND RELEASED FROM THE LOCATION.","geometry":{"type":"Point","coordinates":[-75.1423,40.0064]}},{"objectid":1088256,"districtoccur":"03","age":43,"mvc_reason":"P/O CAIN OBSERVED THE ABOVE VEHICLE WITH THE DEFENDANT ON THE DIRT BIKE DRIVING ON THE SIDEWALK AT 13TH AND SOUTH STREETS. DEFENDANT REFUSED TO GET OFF THE DIRT BIKE AFTER BEING TOLD MULTIPLE TIMES. DEFENDANT TRIED TO TURN THE BIKE ON AND FLEE, BUT P/O CAIN HIT THE KILL SWITCH. NCIC/PCIC CHECK, DEFENDANT IS A SCOFFLAW VIOLATOR OCA:2622336. TVR AND PVR FILED.  BWC ACTIVATED. DIRTBIKE TOWED TO PPA AUTO POUND. DIRT BIKE PLACED355 ON PR: 3550760","geometry":{"type":"Point","coordinates":[-75.1635,39.9434]}},{"objectid":1086333,"districtoccur":"09","age":47,"mvc_reason":"ABOVE OPERATOR WAS TRAVELING IN A LANE MARKED BIKE AND BUS ONLY. SIGNS ARE POSTED ON RIGHT SIDE OF STREET AND BY WHITE WRITING ON HIGHWAY ITSELF. MVC 3111A","geometry":{"type":"Point","coordinates":[-75.169,39.9515]}},{"objectid":1087746,"districtoccur":"14","age":36,"mvc_reason":"VEHICLE OBSERVED TRAVELING S/B ON OGONTZ AVE. AND PASS VEHICLE ON THE RIGHT IN BIKE LANE. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1565,40.0675]}},{"objectid":1097816,"districtoccur":"26","age":28,"mvc_reason":"ABOVE WAS OBSERVED TRAVELING ON DELAWARE AVE WHEN HE MADE AN ILLEGAL U TURN AND ALMOST HIT A PEDSTRIAN IN THE CROSSWALK. STOPPED FOR MVC. NCIC/PCIC CHECKED. NO WANTS VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1343,39.9645]}},{"objectid":1097927,"districtoccur":"17","age":29,"mvc_reason":"VEHICLE OBSERVED BY POLICE WITH ONLY CENTER BRAKE LIGHT FUNCTIONAL WHILE BOTH CORNER REAR LIGHTS WERE NOT ILLUMINATED. NCIC/PCIC CHECK REVEALED DRIVER HAD AN ID ONLY. DRIVER CALLED OWNER TO PICK VEHICLE UP WHICH WAS LEGALLY PARKED. DRIVER AND PASSENGER WAITED OUTSIDE THE CAR ON THE SIDEWALK FOR THE OWNER TO ARRIVE.  VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1659,39.9425]}},{"objectid":1080836,"districtoccur":"15","age":30,"mvc_reason":"POLICE OBS VEHICLE PARKED IN CROSSWALK FACING SOUTHBOUND ON CORNER OF TORRESDALE/PRINCETON.  QUERIED TAG THROUGH BMV AND RETURNED INSURANCE CANCELLATION.  STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC NEGATIVE. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.0398,40.0291]}},{"objectid":1078877,"districtoccur":"09","age":52,"mvc_reason":"ABOVE OPERATOR WAS TRAVELING IN BIKE AND BUS LANE WHICH IS MARKED BY SIGNS ON POLES AND IN WHITE WRITING ON THE HIGHWAY","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":1117034,"districtoccur":"24","age":25,"mvc_reason":"VEHICLE OBSERVED PARKING ON SIDEWALK AT 2100 E ORLEANS ST. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CLEARED BY INVESTIGATION. VERBAL WARNING GIVEN. BWC ACTIVATED.","geometry":{"type":"Point","coordinates":[-75.1155,39.9892]}},{"objectid":1113874,"districtoccur":"14","age":71,"mvc_reason":"P/O&APOS;S WERE STATIONARY AT LOCATION MONITORING PEDESTRIAN AND VEHICULAR TRAFFIC DUE TO A HOLIDAY EVENT IN CHESTNUT HILL. LARGE CROWDS OF ADULTS AND CHILDREN WERE ON CORNERS AS WELL AS HIGH MV TRAFFIC. POLICE HEARD A VEHICLE BLOWING ITS HORN TRAVELLING E/B ON HIGHLAND APPROACHING GERMANTOWN AVE, THEN TURN LEFT INTO THE ONCOMING W/B LANE TO PASS TWO VEHICLES ON THEIR LEFT BEFORE TURNING LEFT TO GO N/B ON GERMANTOWN AVE. POLICE HEARD THE MERCEDES CONTINUE TO BLOW ITS HORN IN HEAVY TRAFFIC BEFORE","geometry":{"type":"Point","coordinates":[-75.2065,40.076]}},{"objectid":1114671,"districtoccur":"14","age":33,"mvc_reason":"POLICE OBV VEH TRAVELING WB ON UPSAL IMPROPERLY PASS ANOTHER VEH ON THE RIGHT BY ACCELERATING AT A HIGH RATE OF SPEED AND TRAVELING INTO THE BIKE LANE. CAR/DRIVER RAN THROUGH PCIC/NCIC WITH NEG RESULTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1696,40.0637]}},{"objectid":1107386,"districtoccur":"14","age":49,"mvc_reason":"VEHICLE OBSERVED TRAVELING S/B ON THE 6600 BLOCK OF ARDLEIGH ST WHEN IT TRAVELED AROUND A SILVER CHEVROLET MALIBU AND INTO THE N/B LANE, GOING AROUND THE SILVER CHEVROLET MALIBU IN A MANNER THAT WAS CARELESS TO BOTH VEHICLES&APOS; OPERATORS AND ANY PEDESTRIANS IN THE AREA. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC, NO WANTS. TVR FILED. BWC ACTIVATED.","geometry":{"type":"Point","coordinates":[-75.1745,40.0582]}},{"objectid":1120114,"districtoccur":"39","age":23,"mvc_reason":"VEHICLE WAS SEEN SOUTH ON CLARISSA STREET, WHEREAS THE DRIVER OF THE VEHICLE BEGAN TO DRIVE ON THE SIDEWALK FOR ABOUT 60 FEET TO REACH THE ENTRANCE OF A GAS STATION, LOCATED AT 1801 WEST HUNTING PARK AVE","geometry":{"type":"Point","coordinates":[-75.1574,40.0144]}},{"objectid":1102350,"districtoccur":"12","age":21,"mvc_reason":"POLICE OBSERVED THE LISTED MALE RIDING A BICYCLE ON THE SIDEWALK WITH NO LIGHTS. POLICE STOPPED BICYCLE FOR INVESTIGATION. PCIC/NCIC CHECK NOW WANTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2268,39.9428]}},{"objectid":1106002,"districtoccur":"35","age":37,"mvc_reason":"VEHICLE OBSERVED ILLEGALLY PARKED IN THE CROSSWALK ON THE N/E CORNER OF 4TH ST AND RUSCOMB ST. AS VEHICLE PULLED OFF POLICE OBSERVED THAT ALL OF THE WINDOWS (INCLUDING THE WINDSHIELD) WHICH OBSTRUCTED THE VIEWS OF ANY/ALL OCCUPANTS AND THE TEMP TAG WAS RIPPED AND EXPIRED AS OF 10/22/22. NCIC/PCIC CHECK. DRIVER HAD A SUSPENDED CLASS C. VEHICLE RELEASED TO LICENSED OWNER WHO ARRIVED ON LOCATION.","geometry":{"type":"Point","coordinates":[-75.131,40.0257]}},{"objectid":1104267,"districtoccur":"18","age":44,"mvc_reason":"LISTED VEHICLE OBSERVED BY POLICE OPERATING EAST AT 3700 MARKET ST AND USE THE CENTER TURNING LANE TO PASS TRAFFIC ALSO GOING EAST. THIS WAS DONE IN A CARELESS MANNER FOR OTHER MOTORISTS AND PEDESTRIANS CROSSING THE STREET. SFI. NCIC/PCIC NEG. DRIVER DID NOT KNOW IT TURNED INTO 1 LANE. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1966,39.9564]}},{"objectid":1102191,"districtoccur":"25","age":27,"mvc_reason":"POLICE OBSERVED ABOVE OPERATOR OF ABOVE DIRT BIKE ALONG WITH 4 OTHERS DRIVING RECKLESSLY AND DISREGARD MULTIPLE STOP SIGNS ON THE BLOCK OF 4200 AND 4300 G STREET. POLICE OBSERVED THAT SAME GROUP ALONG WITH THE ABOVE OPERATOR AT THE ABOVE LOCATION. UPON STOP THE ABOVE OPERATOR TRIED TO LEAVE BUT EVENTUALLY GAVE UP AND HANDED POLICE THE KEYS. AN NCIC-PCIC CHECK YIELDED A NON MOTORCYCLE DRIVERS LICENSE, A VALID TO CARRY LICENSE, AND A STOLEN DIRT BIKE. AFTER CONTACTING MAJOR CRIMES THE MALE WAS PLA","geometry":{"type":"Point","coordinates":[-75.1122,40.0124]}},{"objectid":1133037,"districtoccur":"19","age":44,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING N/B ON 1500 N 52 ON THE SIDEWALK FOR AN ENTIRE BLOCK. PCIC/NCIC CHECK NO WANTS. UPON POLICE APPROACH POLICE NOTICED THE FEMALE WAS SLURRING HER WORDS. SHE ALSO KEPT REFERRING TO THE MALE OFFICER AS A FEMALE. THE VEHICLE HAD A STONG ODOR OF WHAT POLICE BELEIEVED THE BE PCP. THE FEMALE WAS ALSO OBSERVED TALKING TO HERSLEF. POLICE CALLED FOR A SOBRIETY TRAINED OFFICER TO CONDUCT A FIELD SOBRIETY TEST ON HER. POLICE OFFICER JORDAN # 3799 ARRIVED . UPON HI","geometry":{"type":"Point","coordinates":[-75.2268,39.9773]}},{"objectid":1130223,"districtoccur":"25","age":44,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE AT ABOVE LOCATION. VEHICLE HAD TINTED WINDOWS THROUGHOUT. VEHICLE ALSO PARKED NEXT TO FIRE HYDRANT AND BLOCKED CROSSWALK. VEHICLE STOPPED FOR MVC VIOLATION. NCIC/PCIC ON THE VEHICLE AND OPERATOR WITH NO WANTS. VERBAL WARNING GIVEN. BWC ACTIVATED.","geometry":{"type":"Point","coordinates":[-75.1402,39.9953]}},{"objectid":1124913,"districtoccur":"25","age":25,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE TRAVELING ON THE SIDEWALK OF THE 500 BLOCK OF E WYOMING, OPERATOR WAS DRIVING THE CAR ON THE SIDEWALK FROM 560 E WYOMING  TO 500 E WYOMING, THEN THE OPERATOR DROVE THE VEHICLE ONTO THE HIGHWAY AND MADE A COMPLETE STOP AT THE GREEN STREET LIGHT. THEN THE OPERATOR STOPPED AT THE GREEN LIGHT AT 500 E WYOMING (BLOCKING THE VEHICULAR TRAFFICS FROM NATURALLY MOVING ). POLICE NICIC/PCIC CHECKED THE CAME BACK NEGATIVE. POLICE OBSERVED MALE WAS NOT WEARING THE SEATBELT. OPER","geometry":{"type":"Point","coordinates":[-75.1168,40.0206]}},{"objectid":1124609,"districtoccur":"09","age":41,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELLING NORTH ON BROAD ST WITH NO RUNNING LIGHTS FUNCTIONING, HIGH TRAFFIC AREA WITH PEDESTRIANS IN THE BUSINESS DISTRICT CREATING A HAZARDOUS CONDITION.","geometry":{"type":"Point","coordinates":[-75.165,39.9466]}},{"objectid":1126526,"districtoccur":"35","age":19,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING NORTHBOUND ON TABOR RD USE THE BIKE/PARKING LANE ON THE RIGHT TO OVERTAKE ANOTHER FORWARD MOVING VEHICLE. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.111,40.0312]}},{"objectid":1160004,"districtoccur":"25","age":20,"mvc_reason":"THE ABOVE VEHICLE WAS PARKED ON THE SIDE WALK. THE DRIVER THEN DROVE ON THE SIDE SIDEWALK. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1356,40.0053]}},{"objectid":1173167,"districtoccur":"35","age":28,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING NORTHBOUND ON 5TH ST USING THE RIGHT SHOULDER/BIKE LANE TO OVERTAKE OTHER FORWARD MOVING VEHICLES. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1278,40.0491]}},{"objectid":1201170,"districtoccur":"06","age":40,"mvc_reason":"ABOVE VEHICLE WAS TRAVELING SOUTH BOUND ON 12TH IN THE BIKE LANE FOR SEVERAL BLOCKS.  NCIC/PCIC NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1572,39.9643]}},{"objectid":1200242,"districtoccur":"03","age":27,"mvc_reason":"POLICE OBSERVED THE LISTED MOTORCYCLE SOUTH BOUND ON CHRISTOPHER COLUMBUS WITH NO TAG DISPLAYED. FEMALE/BIKE STOPPED AT THE GAS STATION AT LISTED LOCATION. NCIC/PCIC NO WANTS/WARRANTS. VERBAL WARNING ONLY.","geometry":{"type":"Point","coordinates":[-75.1452,39.9269]}},{"objectid":1199139,"districtoccur":"02","age":24,"mvc_reason":"POLICE OBSERVED THE LISTED MOTOERCYCLE DRIVER ON THE SIDEWALK AND PARK IN FRONT OF THE WALGREENS STORE PARTICALY BLOCKING THE ENTRANCE TO THE STORE. THE MOTORCYCLE DID NOT HAVE A LICENSE PLATE. TWO MALES DISMOUNTED THE VEHICLE. THE DRIVER AND THE PASSENGER WERE BOTH CLEARED BY INVESTIGATION. BOTH THE DRIVER AND PASSENGER WERE IN VIOLATION OF MVC 3525B (PROTECTIVE EYE DEVICE)","geometry":{"type":"Point","coordinates":[-75.0672,40.0499]}},{"objectid":1190412,"districtoccur":"07","age":37,"mvc_reason":"THE OPERATOR WAS OBSERVED BY POLICE TRAVELING S/B OUTER LANE TEXTING WHILE DRIVING IN WILFUL DISREGARD FOR SURROUNDING VEHICLES/PEDESTRIANS. WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.0402,40.069]}},{"objectid":1237215,"districtoccur":"12","age":24,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE PARKED ON THE SIDEWALK AT THE ABOVE LOCATION. POLICE STOPPED THE VEH FOR INV.MALES WERE ALSO SMOKING AN UINRECOVERABLE AMOUNT OF MARIUJUANA. VEH AND OCCUPANTS RETURNED NO WANTS NCIC/PCIC.CBI","geometry":{"type":"Point","coordinates":[-75.2291,39.9449]}},{"objectid":1236912,"districtoccur":"22","age":24,"mvc_reason":"LISTED VEHICLE OBSERVED PARK ON CURB IMPEDING THE PASSAGE OF PEDESTRIANS.  DURING APPROACH PASSENGER ATTEMPTED TO EXIT VEH AND TOLD TO GET BACK IN VEHICLE. DRIVER OBSERVED MAKING SEVERAL MOVEMENTS ALSO. WHILE ASKING FOR VEH CREDENTIALS HE WAS INSTRUCTED TO  TOP REACHING AROUND. UPON FURTHER INVESTIGATION DUE TO THE MOVEMENTS RECOVERED WAS A FIREARM FROM THE CENTER CONSOLE","geometry":{"type":"Point","coordinates":[-75.1793,39.994]}},{"objectid":1259167,"districtoccur":"07","age":36,"mvc_reason":"OPERATOR OBSERVED W/B ON RED LION RD STOPPED AT RED LIGHT AND WHEN LIGHT TURNED GREEN OPERATOR SPED UP QUICKLY AND MADE A LEFT TURN INTO THE INNER LANES OF ROOSEVELT BLVD DIRECTLY IN FRONT OF ONCOMING TRAFFIC THAT HAD RIGHT OFWAY AND FAILING TO YIELD TO A PEDESTRIAN THAT WAS CROSSING BLVD","geometry":{"type":"Point","coordinates":[-75.0152,40.0946]}},{"objectid":1262188,"districtoccur":"07","age":28,"mvc_reason":"OPERATOR OBSERVED WITH VEHICLE ON SIDEWALK ON THE NORTHWEST CORNER....STATES HE LOST CONTROL OF HIS VEHICLE WHILE TURNING ONTO BUSTLETON AV FROM GRANT AV TO TRAVEL NORTHBOUND.....ISSUED VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.0375,40.0855]}},{"objectid":1258571,"districtoccur":"09","age":25,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING E/B AT LISTED LOCATION VEHICLE DISREGARD STEADY RED SIGNAL PROCEEDING THREW INTERSECTION E/B NO UNIFORM POLICE OR FLAGGER ON LOCATION WAVING OPERATING TO PROCEED THREW RED SIGNAL. SEVERAL PEDESTRIANS WERE ATTEMPTING TO CROSS THE HIGHWAY AT THE TIME OF OPERATOR RECKLESS/CARLESS BEHAVIOR. POLICE ATTEMPTED TO STOP VEHICLE AT 21ST AND MARKET. VEHICLE DID NOT STOP UNTIL 18TH AND MARKET. NCIC/PCIC CLEAR. CBI. TVR ISSUED.BODY CAMERA ACTIVATED","geometry":{"type":"Point","coordinates":[-75.1767,39.954]}},{"objectid":1268889,"districtoccur":"18","age":36,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE FAIL TO YIELD TO A PEDESTRIAN IN THE CROSSWALK WHILE TRAVELING THROUGH THE LISTED INTERSECTION. POLICE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK, NO WANTS.","geometry":{"type":"Point","coordinates":[-75.2379,39.9561]}},{"objectid":1277968,"districtoccur":"24","age":62,"mvc_reason":"ABOVE VEH MADE A LEFT TURN ON ALLEGHENY AVE FROM FRANKFORD AVE OVER TAKING ON COMING VEH;S GOING STRAIGHT ON FRANKFORD AVE THEN OVER TOOK A PED IN THE CROSSWALK. DRIVER WAS GIVEN A WARNING.","geometry":{"type":"Point","coordinates":[-75.1103,39.993]}},{"objectid":1285228,"districtoccur":"35","age":22,"mvc_reason":"POLICE OBSERVED THE VEHICLE TRAVELING NORTHBOUND ON OGONTZ AV GO AROUND A SCHOOL BUS STOPPED AT THE RED LIGHT AT CHEW AV ON THE LEFT. VEHICLE STOPPED ON COMMAND, BUT FLED POLICE AFTER THE DRIVER GAVE PAPERWORK AND HIS NAME WORD OF MOUTH. THE VEHICLE WAS LAST SEEN NORTHBOUND ON OGONTZ AV USING THE BIKE LANE AT A HIGH RATE OF SPEED BEFORE TURNING EASTBOUND ONTO GRANGE AV. POLICE GAVE FLASH INFO TO RADIO. THE VEHICLE WAS LATER LOCATED IN THE REAR OF THE DRIVERS ADDRESS. TVRS ISSUED TO OPERATOR AT T","geometry":{"type":"Point","coordinates":[-75.1508,40.0417]}},{"objectid":1301315,"districtoccur":"18","age":22,"mvc_reason":"VEHICLE OBSERVED TURNING LEFT ONTO CHESTNUT ST FROM 52ND ST WHILE FAILING TO YIELD TO ONCOMING TRAFFIC AND PEDESTRIANS IN THE CROSS WALK. STOPPED FOR INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.2251,39.9585]}},{"objectid":1312307,"districtoccur":"12","age":35,"mvc_reason":"POLICE OBSERVED VEHICLE WITH HEAVY TINT ON ALL ALL WINDOWS. POLICE COULD NOT SEE INSIDE OF THE VEHICLE. VEHICLE WAS ALSO BLOCKING THE ROADWAY, THE BIKE LANE AND TROLLY LANE. VEHICLE GAVE VERBAL WARNING TO OPERATOR FOR INFRACTIONS. PASSENGER WAS INVESTIGATED FOR NOT WEARING A SEATBELT WHILE VEHICLE WAS IN OPERATION. NCIC/PCIC CAME BACK WITH NEGATIVE RESULTS.","geometry":{"type":"Point","coordinates":[-75.2192,39.93]}},{"objectid":1309062,"districtoccur":"24","age":38,"mvc_reason":"DRIVING ON SIDEWALK","geometry":{"type":"Point","coordinates":[-75.1301,39.9943]}},{"objectid":1338019,"districtoccur":"17","age":35,"mvc_reason":"POLICE OBSERVED VEHICLE IDLING IN CROSSWALK CAUSING PEDESTRIANS TO WALK INTO STREET AND PREVENTING VEHICLES FROM TURNING.  NCIC/PCIC/BMV CHECK NO WANTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1874,39.9366]}},{"objectid":1337101,"districtoccur":"14","age":36,"mvc_reason":"PER CO 14 THE VEHICLE WENT AROUND ALL THE VEHICLE IN THE BIKE LINE AND WENT THROUGH THE LIGHT. DURING THE INVESTIGATION. THE ABOVE DRIVER INFORMED POLICE THAT HER SON WAS HAVING A MEDICAL EMERGENCY AT CHEW AND WASHINGTON LANE AND WAS ON HER WAY THERE. PCIC NCIC NO WANT CBI","geometry":{"type":"Point","coordinates":[-75.1698,40.0406]}},{"objectid":1350122,"districtoccur":"24","age":40,"mvc_reason":"OPERATOR WAS OBSERVED GOING N/B ON KENSINGTON AND MADE A U-TURN IN THE MIDDLE OF THE ENTER SECTION ON A RED LIGHT  NEARLY MAKING CONTACT WITH PEDS IN THE CROSSWALK. OPERATOR WAS DRIVING ON A PA ID. NO DRIVERS LIC","geometry":{"type":"Point","coordinates":[-75.1158,39.9952]}},{"objectid":1344942,"districtoccur":"18","age":23,"mvc_reason":"VEHICLE OBSERVED TRAVELING WESTBOUND ON IRVING ST WITH HEAVY TINT INCLUDING ON FRONT WINDSHIELD. VEHICLE MATCHED FLASH OF A  PATROL ALERT OF ADARK BLUE CHEVY SEDAN THAT WAS INVOLVED IN A DIRT BIKE THEFT IN THE 17TH REF#22-17-012978 VEHICLE STOPPED FOR INVESTIGATION. MALE OPERATOR HAD SUSPENDED LICENSE. MALE OPERATOR OR FRONT PASSENGER HAD NO WANTS. VERBAL WARNING ISSUED, POLICE OBSERVED MALE PARK VEHICLE AND LEAVE VEHICLE LEGALLY PARKED.","geometry":{"type":"Point","coordinates":[-75.2438,39.9574]}},{"objectid":1346900,"districtoccur":"15","age":64,"mvc_reason":"VEH TRAVELING S/B ON 4900 OXFORD AVE WENT AROUND VEH ON RIGHT IN BIKE LANE TO PASS VEH WHICH WAS STARTING FROM STOP AS LIGHT JUST TURNED GREEN.","geometry":{"type":"Point","coordinates":[-75.0843,40.0205]}},{"objectid":1349539,"districtoccur":"39","age":46,"mvc_reason":"WHILES POLICE WAS PATROLLING AND RESPONDING TO A R/C, ABOVE LISTED NAME KEPT HONKING ON POLICE THEN POLICE OBSERVED DEFENDANT HIGHLY SPED PASS POLICE OFFICER&APOS;S PATROL VEHICLE DISREGARDING MARKED LANES AND DROVE THROUGH ONCOMING TRAFFIC LANE DISREGARDING VEHICLES TRAVELING THROUGH SB LANE AND PEDESTRIANS. BOTH SOUTHBOUND AND NORTHBOUND LANES WERE MARKED SINGLE LANES . DEFENDANT REFUSED TO COMPLY WITH POLICE  AND PROVIDE ALL NECESSARY DOCUMENTS TO POLICE WHEN ASKED BY POLICE. DEFENDANT WAS BE","geometry":{"type":"Point","coordinates":[-75.1669,39.9987]}},{"objectid":1345129,"districtoccur":"25","age":36,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE BEING OPERATED AND PARKED AT THE TOP OF THE 3800 BLOCK OF PERCY STREET BLOCKING THE CROSSWALK WITHT THE INTERSECTING STREET OF PIKE CODE (3353(A)(1)(IV) AND PARKING NEXT TO WHILE BLOCKING A FIRE HYDRANT CODE 3353 (A)(2)(II).  MALE NCIC/PCIC NEGATIVE RESULTS. DURING POLICE INVRSTIGATION POLICE OBSERVED MALE USING A MARIJUANA GRINDER FOR A GREEN LEAFY SUBSTANCE IN WHICH THE MALE STATED IT WAS &QUOT;WEED&QUOT; POLICE RECOVERED MARIJUANA AND ISSUED A CVN # 6259701-0. M","geometry":{"type":"Point","coordinates":[-75.143,40.0098]}},{"objectid":1357300,"districtoccur":"06","age":55,"mvc_reason":"POLICE OBSERVED THE DRIVE EXIT A PARKING SPACE ON THE RIGHT SIDE OF THE STREET. THE DRIVER THEN WENT AROUND ALL VEHICLES INTO THE BIKE LANE TO PASS THEM. POLICE ACTIVATED LIGHTS AND SIRENS TO STOP THE VEHICLE. DRIVER STOPPED UPON REQUEST. HE ALSO PROVIDED POLICE WITH ALL THE PROPER DOCUMENTS REQUESTED. NCIC/PCIC CHECKED CLEARED THE DRIVER AND THE VEHICLE. DRIVER WAS GIVEN A WARNING AND LET GO.","geometry":{"type":"Point","coordinates":[-75.1622,39.9489]}},{"objectid":1357124,"districtoccur":"06","age":50,"mvc_reason":"OBSERVED A MAROON VEHICLE TRAVELING NORTH BOUND ON 13TH STREET IN THE BIKE LANE. LANE CLEARLY MARKED FOR BIKE USE ONLY. OPERATOR ADVISED. NCIC/PCIC NO WANTS.","geometry":{"type":"Point","coordinates":[-75.1622,39.9489]}},{"objectid":1357601,"districtoccur":"09","age":31,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING NB 100 S 16TH STREET ON THE SIDEWALK WHERE PEDESTRIANS WERE WALKING TO AVOID A TRAFFIC JAM. NCIC-PCIC CHECK, DRIVER WAS OPERATING VEHICLE ON A SUSPENDED LICENSE (DUI RELATED)","geometry":{"type":"Point","coordinates":[-75.1672,39.9512]}},{"objectid":1356536,"districtoccur":"17","age":31,"mvc_reason":"POLICE OBSERVED ABV FEMALE OPERATING VEHICLE DISREGARD STOP SIGN AT ABV LOCATION. PER NCIC/PCIC, FEMALE DOES NOT POSSES A VALID LICENSE. MOM (PEDESTRIAN #3) CAME TO THE LOCATION WITH A VALID LICENSE AND DROVE THE VEHICLE AWAY BECAUSE OF THE DRIVERS 3 MONTH OLD BABY IN THE VEHICLE. VEHICLE RELEASED TO MOM.","geometry":{"type":"Point","coordinates":[-75.191,39.9346]}},{"objectid":1350476,"districtoccur":"24","age":23,"mvc_reason":"POLICE OBSERVED DRIVER TAKE RED LIGHT WITH PEDESTRIANS IN WALKWAY. VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.1158,39.9952]}},{"objectid":1381230,"districtoccur":"25","age":19,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE OVERTAKING A LANE FOR BIKES TRAVELING EAST BOUND ON ALLEGHENY. UPON OBSERVATION, VEHICLE WAS STOPPED FOR INVESTIGATION. PCIC/NCIC CHECK CONDUCTED, NO WANTS. DRIVER WAS RELEASED WITH A WARNING.","geometry":{"type":"Point","coordinates":[-75.1357,39.9994]}},{"objectid":1359031,"districtoccur":"08","age":36,"mvc_reason":"VEHICLE OBSERVED TRAVELING S/B ON ACADEMY RD. VEHICLE WENT INTO THE SHOULDER AND IN THE BIKE LINE TO PASS SEVERAL VEHICLES ON THE RIGHT.","geometry":{"type":"Point","coordinates":[-75.0088,40.0674]}},{"objectid":1387638,"districtoccur":"12","age":50,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE EMERGING FROM THE DRIVEWAY ON THE GAS STATION LOCATED AT 5800 WOODLAND AVE. VEHICLE DID NOT COME TO A COMPLETE STOP BEFORE LEAVING THE DRIVEWAY BACK ONTO 58TH STREET, VEHICLE THEN TRAVELED SOUTHBOUND ON THE NORTHBOUND SHOULDER AND SIDEWALK OF 2200 S 58TH ST WHILE VEHICLES WERE TRAVELING NORTHBOUND IN THE NORTHBOUND LANE. VEHICLE THEN TRAVELED THROUGH THE NORTHBOUND LANE BEFORE MERGING BACK INTO THE SOUTHBOUND LANE. VEHICLE WAS THEN STOPPED FOR LISTED MVC. DRVIER/VE","geometry":{"type":"Point","coordinates":[-75.2246,39.9324]}},{"objectid":1388933,"districtoccur":"17","age":29,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE DOUBLE PARKED IN THE CROSSWALK AT 27TH AND TASKER ST WITH TINTED WINDOWS SO DARK POLICE COULD NOT SEE INTO THE VEHICLE. VEHICLE WAS ALSO BLOCKING PEDESTRIAN TRAFFIC FORCING PEDESTRIANS TO WALK OUT OF THE CROSSWALK AND INTO THE INTERSECTION. VEHICLE STOPPED FOR INVESTIGATION AT 28TH AND DICKINSON ST. NCIC/PCIC CHECK. NEGATIVE RSULTS FOR WARRANTS. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1894,39.9344]}},{"objectid":1401841,"districtoccur":"18","age":31,"mvc_reason":"POLICE WERE STOPPED AT THE TRAFFIC LIGHT ON THE 400 BLOCK OF SOUTH 56TH ST WAITING FOR A PEDESTRIAN TO CROSS THE CROSS WALK WHEN THE LISTED VEHICLE WENT INTO THE ONCOMING TRAFFIC LANE AND PASSED POLICE. POLICE STOPPED THE VEH FOR INVESTIGATION NCIC/PCIC CHECKED NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2342,39.9545]}},{"objectid":1401039,"districtoccur":"18","age":48,"mvc_reason":"POLICE OBSERVED VEHICLE TURNING ONTO CHESTNUT STREET TO HEAD EAST ON CHESTNUT FROM 60TH STREET AND UPON TURNING ONTO CHESTNUT DID NOT YIELD TO THE PEDESTRIANS CROSSING THE CROSSWALK, ALMOST STRIKING THE PEDESTRIANS. POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECKED WITH NEGATIVE RESULTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2411,39.9604]}},{"objectid":1404527,"districtoccur":"39","age":19,"mvc_reason":"OBSERVED VEHICLE DISREGARD STOP SIGN, PROCEEDED THROUGH CROSSWALK, THEN OBSERVED POLICE RPC AND STOPPED IN THE MIDDLE OF THE INTERACTION. STOPPED FOR INVES. UPON INVES, POLICE OBSERVED REAR AND SIDE WINDOWS TINTED DARK SHADE. PCIC/NCIC CHECK CBI WARNING ADVISED.","geometry":{"type":"Point","coordinates":[-75.174,40.0266]}},{"objectid":1425473,"districtoccur":"15","age":23,"mvc_reason":"DRIVER WAS OBSERVED MAKING LEFT ONTO FRANFORD AVE FROM RHAWN STREET AND ALMOST STRUCK PEDESTRIAN IN WALKWAY. PEDESTRIAN HAD THE RIGHT AWAY","geometry":{"type":"Point","coordinates":[-75.0283,40.0414]}},{"objectid":1426949,"districtoccur":"18","age":22,"mvc_reason":"VEHICLE OBSERVED ILLEGALLY OVERTAKING TRAFFIC BY TRAVELING IN THE BIKE/PARKING LANE, VEHICLE ALSO HAD HEAVY TINT ON ALL FOUR SIDE WINDOWS AND REAR WINDSHIELD. STOPPED FOR INVESTIGATION, NO WANTS. OPERATOR HAD PRMIT TO CARRY AND LEGAL FIREARM. FIREARM REMOVED FOR DURATION OF STOP AND RETURNED AT THE END. VERBAL WARNING ISSUED","geometry":{"type":"Point","coordinates":[-75.238,39.9463]}},{"objectid":1419347,"districtoccur":"35","age":55,"mvc_reason":"DRIVER OBSERVED TRAVELING NB ON OGONTZ AV. AT A HIGH RATE OF SPEED, PASSED THE RPC ON THE RIGHT HAND SIDE IN THE NON TRAFFIC SHOULDER AND BIKE LANE. UPON INVESTIGATION, DRIVER IS A CREDENTIALED CNA AND ENROUTE TO AN UNWELL PATIENT. CLEARED AND RELEASED WITH A VERBAL WARNING. BWC ACTIVATED","geometry":{"type":"Point","coordinates":[-75.1491,40.0373]}},{"objectid":1420159,"districtoccur":"09","age":34,"mvc_reason":"ABOVE OPER WAS OBSERVED DRIVING IN A BIKE LANE WHILE POLICE WERE STOPPED IN PARKING AREA ALONG SIDE BIKE LANE. OPERATOR STATED TO POLICE SHE IS NOT FROM THE AREA AND DIDNT KNOW SHE WAS NOT TO TRAVEL IN A BIKE LANE","geometry":{"type":"Point","coordinates":[-75.1683,39.954]}},{"objectid":1431909,"districtoccur":"35","age":20,"mvc_reason":"POLICE OBSERVED THE ABV VEHICLE TRAVELLING N/B ON OGONTZ AT A HIGH RATE OF SPEED. THE VEHICLE USED THE BIKE LANE TO OVERTAKE MULTIPLE VEHICLES. THE RAINY CONDITIONS AND HIGH SPEED AND SHARP TURN MADE THIS A VERY UNSAFE DRIVING CONDITION. VEHICLE STOPPED FOR INVESTIGATION. OPERATOR/VEHICLE RAN THROUGH PCIC/NCIC. NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.15,40.0524]}},{"objectid":1437316,"districtoccur":"18","age":47,"mvc_reason":"VEHICLE WAS OBSERVED BY POLICE N/B ON 51ST ST AT MARKET STOPPED AT A STEADY RED SIGNAL, BUT IN THE CROSSWALK. THIS ACTION PREVENTED A PRESENT PEDESTRIAN FROM BEING ABLE TO CROSS THE STREET WHEN THEY HAD THE RIGHT OF WAY. VEHICLE ALSO HAD SUN SCREENING ON THE FRONT WINDOWS. VEHICLE WAS STOPPED FOR INVESTIGATION. NCIC/PCIC/BMV, NO WANTS, BUT REG WAS EXPIRED 07/2022. OPERATOR WAS ISSUED TVRS FOR STOP REASON AND REGISTRATION AND SHE WAS WARNED FOR THE TINT ON THE FRONT WINDOWS. \n\nMVC 3542A-RIGHT OF","geometry":{"type":"Point","coordinates":[-75.223,39.9593]}},{"objectid":1456097,"districtoccur":"09","age":35,"mvc_reason":"VEHICLE WAS OBSERVED TRAVELING EAST BOUND ON PINE STREET, MAKE A RIGHT TURN ONTO BROAD STREET CUTTING OFF A FEMALE PEDSETRIAN WITHIN THE CROSSWALK CAUSING A HAZARD, VEHICLE WAS STOPPED FOR INVESTIGATION, NO WANTS VERBAL WARNING WAS ISSUED","geometry":{"type":"Point","coordinates":[-75.1652,39.9456]}},{"objectid":1451268,"districtoccur":"39","age":34,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE PULL OUT OF A PARKING SPOT ON 3800 PULASKI AT A HIGH RATE OF SPEED WITH TOTAL DISREGARD TO OTHER VEHICLES AND  PEDESTRIAN ON THE HIGHWAY. VEHICLE STOPPED FOR INVESTIGATION, NCIC/PCIC CHECK WITH NO WANTS. VERBAL WARNING GIVEN TO THE OPERATOR.","geometry":{"type":"Point","coordinates":[-75.1561,40.0115]}},{"objectid":1445918,"districtoccur":"22","age":33,"mvc_reason":"ABOVE OBSERVED EB ON CB MOORE, MADE LEFT ONTO N BROAD STREET ALMOST STRIKING PEDESTRIANS IN THE CROSS WALK, SIGNS ARE POSTED THAT LEFT TURNS ARE PROHIBITED, NCIC/PCIC REVEAL OPERATOR DOES NOT HAVE A LICENSE.  TVRS ISSUED, BELOW PASSENGER WITH VALID LICENSE WAS GIVEN PERMISSION BY OWNER TO OPERATE VEHICLE","geometry":{"type":"Point","coordinates":[-75.1579,39.9787]}},{"objectid":1444814,"districtoccur":"35","age":30,"mvc_reason":"14DC OBSERVED VEHICLE OVERTAKING VEHICLES ON THE RIGHT HAND SIDE AND DRIVE DOWN BIKE LANE.","geometry":{"type":"Point","coordinates":[-75.136,40.0462]}},{"objectid":1442658,"districtoccur":"01","age":29,"mvc_reason":"VEH WAS DOUBLE PARKED IN A BIKE LANE WITH DARK TINTED WINDOWS AND NO FLASHERS OPERATING. NCIC/PCIC NO WANTS VERBAL WARNING GIVEN CBI.","geometry":{"type":"Point","coordinates":[-75.1746,39.925]}},{"objectid":1472761,"districtoccur":"15","age":32,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING SOUTH BOUND ON TORRESDALE AVE OVERTAKE A SEPTA BUS BY CROSSING OVER THE DOUBLE YELLOW LINE ALMOST STRIKING A PEDESTRIAN.  POLICE STOPPED FOR INVESTIGATION.  PCIC/NCIC CHECKED NO WANTS. VERAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.0422,40.0265]}},{"objectid":1470966,"districtoccur":"35","age":24,"mvc_reason":"VEHICLE WAS OBSERVED FACING EAST BOUND ON WINDRIM COMPLETELY BLOCKING THE CROSSWALK ON THE SOUTH EAST CORNER, VEHICLE ALSO HEAVILY TINTED, NCIC AND PCIC OK","geometry":{"type":"Point","coordinates":[-75.1443,40.0308]}},{"objectid":1496630,"districtoccur":"12","age":50,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE TRAVELING W/B AT THE ABOVE LOCATION. UPON OBSERVATION POLICE OBSERVED THE ABOVE VEHICLE APPROACHING A RED LIGHT. UPON OBSERVATION POLICE OBSERVED THE ABOVE VEHICLE TRYING TO TURN RIGHT ON RED, WHEN A PEDESTRIAN WAS WALKING ACROSS AN INTERSECTION IN A CROSSWALK. THE ABOVE VEHICLE ALMOST STRUCK THE PERSON.","geometry":{"type":"Point","coordinates":[-75.2303,39.9222]}},{"objectid":1497105,"districtoccur":"06","age":46,"mvc_reason":"DISREGAEDED LANE MARKED FOR BIKES ONLY","geometry":{"type":"Point","coordinates":[-75.1575,39.9631]}},{"objectid":1502152,"districtoccur":"24","age":44,"mvc_reason":"POLICE OBSERVE ABOVE VEHICLE RUNNING AT ABOVE LOCATION ON COMPLETELY BLOCKING THE CROSSWALK ON THE SOUTHEAST CORNER WHILE FACING WEST ON ANN ST, VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1105,39.9842]}},{"objectid":1505599,"districtoccur":"25","age":43,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED ON THE SIDEWALK WITH TWO OCCUPANTS INSIDE THE CAR. POLICE RAN VEHICLE THROUGH NCIC/PCIC. PA TAG WAS NOT REGISTERED TO VEHICLE. POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECKED. VEHICLE IN STOLEN STATUS. DRIVER OF VEHICLE WAS ARRESTED TRANSPORTED TO 25TH. POLICE RELEASED VEHICLE TO OWNER. STOLEN AUTO DC#22-25-024387","geometry":{"type":"Point","coordinates":[-75.1399,39.9967]}},{"objectid":1504515,"districtoccur":"16","age":27,"mvc_reason":"OPER WAS TRAVELING E/B ON LANCASTER AVE AND MADE A RIGHT TURN ALMOST STRIKING A PEDESTRIAN IN THE CROSSWALK AT 42ND ST.  V.W.G.","geometry":{"type":"Point","coordinates":[-75.2076,39.9664]}},{"objectid":1503144,"districtoccur":"19","age":36,"mvc_reason":"POLICE WERE TRAVELLING S/B TOWARDS 6000 RACE ST WHEN POLICE OBSERVED LISTED VEHICLE AHEAD OF US WITH HEAVY TINT AROUND ALL VEHICLE, POLICE WERE UNABLE TO VIEW INSIDE THE VEHICLE, HEAVY TINT CAUZES A HAZORDOUS ENVIRONMENT TO DRIVER, PEDESTRIAN AND POLICE. OPERATOR OF THE VEHICLE WAS ALSO CIRCLING THE BLOCK. WHEN POLICE ACTIVATED OVERHEAD LIGHTS AND CONDUCTED VEHICLE INVESTIGATION OPERATOR STATED SHE WAS LOOKING FOR PARKING EVEN THOUGH OPERATOR PASSED PLENTY OF PARKING SPOTS. VEHICLE INVESTIGATION","geometry":{"type":"Point","coordinates":[-75.2404,39.9651]}},{"objectid":1505440,"districtoccur":"25","age":42,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED ON THE SIDEWALK WITH TWO OCCUPANTS INSIDE THE CAR. POLICE RAN VEHICLE THROUGH NCIC/PCIC. PA TAG WAS NOT REGISTERED TO VEHICLE. POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECKED. VEHICLE IN STOLEN STATUS. DRIVER OF VEHICLE WAS ARRESTED TRANSPORTED TO 25TH. POLICE RELEASED VEHICLE TO OWNER. STOLEN AUTO DC#22-25-024387","geometry":{"type":"Point","coordinates":[-75.1399,39.9967]}},{"objectid":1488711,"districtoccur":"07","age":31,"mvc_reason":"DRIVER DISREGARDED A DO NOT ENTER SIGN ON PRIVATE PROPERTY AT AN UNSAFE HIGH RATE OF SPEED WHILE PEDESTRIANS AND MOTOR VEHICLE TRAFFIC WERE IN THE AREA.","geometry":{"type":"Point","coordinates":[-75.0322,40.0908]}},{"objectid":1488079,"districtoccur":"39","age":19,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED BLOCKING CROSSWALK AT GRATZ/WINGOHOCKING STS WITH VEHICLE RUNNING AND OPERATOR IN DRIVER SEAT WHEN POLCIE RAN BMV CHECK OF VEHICLE WHICH RETURNED NO RECORDS. OPERATOR PROVIDED PINK SLIP FOR VEHICLE. NCIC/PCIC CHECK NO WANTS. CBI","geometry":{"type":"Point","coordinates":[-75.155,40.0223]}},{"objectid":1488450,"districtoccur":"19","age":25,"mvc_reason":"ABOVE DRIVER WAS TRAVELING N/B ON 63RD ST AND IMPROPER PASING ON THE RIGHT OF SEPTA TROLLEY WHILE PEDESTRIANS WAS TRYING TO EXIT THE TROLLEY. NCIC PCIC NO WANTED. A WARNING WAS GIVEN","geometry":{"type":"Point","coordinates":[-75.2465,39.9782]}},{"objectid":1513406,"districtoccur":"03","age":28,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE INITIALLY DOUBLE PARKED IN THE BIKE LANE ON THE CORNER OF 700 OREGON. POLICE THAN OBSERVED THE LISTED VEHICLE PULL OUT OF THE BIKE LANE AND TRAVEL WB THROUGH THE INTERSECTION ON TO THE 800 BLOCK OF OREGON AT AN SLOW RATE OF SPEED (LESS THAN 10 MPH). POLICE OBSERVED THE LISTED VEHICLE CONTINUE AT THIS RATE OF SPEED AND CONTINUE DRIVING WB GOING INTO SWERVING BETWEEN THE TRAFFIC LANE AND THE BIKE LANE NOT ALLOWING VEHICLES TO PASS. AS A RESULT, THE VEHICLE WAS ST","geometry":{"type":"Point","coordinates":[-75.1616,39.9155]}},{"objectid":1523740,"districtoccur":"07","age":35,"mvc_reason":"POLICE OBSERVED THE DEFT PASS VEHICLES AT A HIGH RATE OF SPEED BY GOING INTO CENTER MEDIAN CAUSING A HAZARDOUS CONDITION TO OTHER MOTORISTS AND PEDESTRIANS\n\n\nVERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.0299,40.1004]}},{"objectid":1508890,"districtoccur":"19","age":26,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELLING S/B ON 54TH AND RACE ST WHEN POLICE WERE TRACELLING W/B FROM LOCATION. POLICE OBSERVED LISTED VEHICLE WITH HEAVY TINT AROUND ALL VEHICLE. HEAVY TINT CAUSES A HAZORDOUS ENVIRONMENT TO OPERATOR, PEDESTRIANS AND POLICE. NCIC./PCIC CHECK ALSO SHOWES THE REGISTRATION HASNT BEEN UPDATED SINCE MARCH 2022. OPERATOR WAS ABLE TO SUCCESFULLY PARK AND POLICE DID NOT TOW VEHICLE. VERBAL WARNING WAS GIVEN TO OPERATOR.","geometry":{"type":"Point","coordinates":[-75.2286,39.9605]}},{"objectid":1538081,"districtoccur":"12","age":21,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE TRAVELING N/B ON 58TH WILLOWS IMPROPER PASSED 3 VEHICLES ON THE RIGHT USING THE BIKE LANE. VEHICLE THEN PROCEEDED TO DRIVE AT A HIGH SPEED AND DISREGARDED A STOP SIGN ON 5800 THOMAS AVE. POLICE INVESTIGATE NCIC/PCIC NEG RESULTS. TVRS ISSUED FOR VIOLATIONS","geometry":{"type":"Point","coordinates":[-75.2337,39.9403]}},{"objectid":1540039,"districtoccur":"07","age":27,"mvc_reason":"DEF DISREGARDED STOP WHILE PEDESTRIAN WAS CROSSING.BMV CHECK CBI VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.0492,40.0617]}},{"objectid":1543332,"districtoccur":"25","age":19,"mvc_reason":"POLICE OBSERVED THE LISTED TINTED VEHICLE PARKED  ON THE SIDEWALK ONCE POLICE PULL UP NEXT TO THE VEHICLE POLICE SEEN A MALE IN THE DRIVER SEAT. ITS APPEARED TO POLICE THAT THE MALE LOOKED UP AND SEEN POLICE AND STARTED TO REACH AROUND IN THE VEHICLE. PCIC/NCIC NO WANTS VEBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1394,39.9936]}},{"objectid":1563392,"districtoccur":"39","age":32,"mvc_reason":"VEHICLE EAST ON HUNTING PARK AVE, FAILED TO STOP AT RED TRAFFIC SIGNAL AT THE INTERSECTION OF HUNTING PARK AV &AMP; STOKLEY STREET, SHOWING NO REGARD FOR THE SAFETY OF OTHER MOTORISTS &AMP; PEDESTRIANS ALIKE. UPON SPEAKING WITH THE DRIVER, SHE SAYS HER &QUOT;FOOT SLIPPED OFF THE BRAKE.&QUOT;","geometry":{"type":"Point","coordinates":[-75.1704,40.0084]}},{"objectid":1562672,"districtoccur":"03","age":37,"mvc_reason":"POLICE OBSERVED LISTED OPERATOR IN LISTED VEHICLE, IMPROPERLY PASS A PEDESTRIAN ON A SKATEBOARD DRIVING ON THE OPPOSITE SIDE OF THE ROAD ALMOST STRIKING A VEHICLE HEAD-ON. VEHICLE STOPPED FOR INVESTIGATION (ALL CHECKS CONDUCTED W/ NO WANTS CBI). VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1534,39.9377]}},{"objectid":1554103,"districtoccur":"12","age":30,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE DRIVING W/B AT THE ABOVE LOCATION. UPON OBSERVATION POLICE OBSERVED THE ABOVE VEHICLE TRAVELING IN A BIKE LANE, AND THE SHOULDER AT THE ABOVE LOCATION, INSTEAD OF AN ACTUAL LANE. POLICE STOPPED VEHICLE FOR INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.2203,39.9266]}},{"objectid":1553913,"districtoccur":"18","age":19,"mvc_reason":"VEHICLE OBSERVED STOPPED AND RUNNING ON THE SIDEWALK AT ABOVE LOCATION. VEHICLE REGISTRATION EXPIRED SINCE 03/2021. VEHICLE STOPPED FOR INVESTIGATION, NO WANTS. MALE HAD PERMIT TO CARRY AND LEGAL FIREARM, REMOVED FOR DURATION OF STOP AND RETURNED. TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.2231,39.9592]}},{"objectid":1556661,"districtoccur":"22","age":28,"mvc_reason":"POLICE OBSERVED THE LISTED DRIVER OPERATING HIS VEHICLE IN A CARELESS MANNER, BY MAKING AN ABRUPT TURN ONTO COLLEGE AVE FROM 22ND STREET, AND DRIVING ONTO THE SIDEWALK. POLICE AACTIVATED HIS EMERGENCY LIGHTS AND THE DRIVER PULLED OVER. WHEN ASKED WHY HE MADE THE TURN IN SUCH A MANNER, HE STATED THAT AN UNKNOWN BLACK MALE WAS LOOKING INOT HIS CAR AND MADED SOME SORT OF GESTURE THAT MADE HIM NERVOUS. NCIC/PCIC CHECK OF THE VEHICLE AND DRIVER SHOWED NEGATIVE FOR WANTS OR ANYTHING ELSE. THE DRIVER/O","geometry":{"type":"Point","coordinates":[-75.1721,39.9748]}},{"objectid":1557021,"districtoccur":"07","age":51,"mvc_reason":"POLICE WHILE STOPPED AT LOCATION OBSERVED A CHILD DRIVING AROUNG A GREEN SMALL DIRTBIKE UNATTENDED. POLICE STOPPED CHILD AND CONTACTED PARENTS TO PICK UP CHILD AND DIRT BIKE. NO TVR ISSUED AT THIS TIME.","geometry":{"type":"Point","coordinates":[-75.0466,40.0743]}},{"objectid":1565726,"districtoccur":"07","age":24,"mvc_reason":"THE LISTED OPERATOR OBSERVED BY POLICE TRAVELING W/B ON WELSH RD AT A HIGH RATE OF SPEED IN WILFULL DISREGARD FOR SURROUNDING VEHICLES/PEDESTRIANS.","geometry":{"type":"Point","coordinates":[-75.0483,40.1001]}},{"objectid":1567045,"districtoccur":"14","age":22,"mvc_reason":"VEHICLE OBSERVED TRAV. S/B ON 20TH AND FAILED TO STOP AT MUTIPLE POSTED STOP SIGNS ALL THE WAY UP TO FORREST AVE. \n\nVEHICLE TRAVELING AT HIGH RATE OF SPEED THROUGH THE STOP SIGNS CAUSING NUMEROUS TRAFFIC HAZARDS FOR PEDESTRIANS AND VEHICLE&APOS;S. \nVEHHICLE STOPPED FOR INVESTIGATION AT WASHINGTON LANE. VERBAL WARNING ISSUED TO DRIVER","geometry":{"type":"Point","coordinates":[-75.1508,40.0659]}},{"objectid":1547768,"districtoccur":"22","age":26,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE DISREGARD STOP SIGN AT ABOVE LOCATION. NCIC/PCIC CHECK CLEAN, NO WANTS ON VEHICLE OR DRIVER/PEDESTRIAN. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1848,39.9837]}},{"objectid":1546657,"districtoccur":"24","age":23,"mvc_reason":"POLICE OBSERVED THE BELOW VEHICLE TRAVELING NORTH BOUND AT A HIGH RATE OF SPEED AT THE LIGHT ON CASTOR AVE AND LUZERNE ST DISREGARDING PEDESTRIANS. POLICE ACTIVATED EMERGENCY LIGHTS AND SIRENS AND THE DRIVER STOPPED SHORTLY AFTER.  NCIC/PCIC NO WANTS VERBAL WARNING GIVEN. DRIVER WAS ADVISED TO SLOW DOWN.  BOTH OCCUPANTS CLEARED BY INVESTIGATION. BWC ACTIVATED.","geometry":{"type":"Point","coordinates":[-75.1007,40.0075]}},{"objectid":1547201,"districtoccur":"24","age":22,"mvc_reason":"POLICE OBSERVED THE LISTED DIRTBIKE OPERATING ON THE HIGHWAY. POLICE STOPPED THE LISTED DIRTBIKE DURING CITY WIDE ATV DETAIL. POLICE SECURED HIS FIREARM DURING INVESTIGATION. PCIC/NCIC CHECKED NO WANTS, VALID PERMIT. VEHICLE CONFISCATED TO M&AMP;W VIA G UNIT. FIREARM RETURNED, MALE RELEASED. PVR 12-1133(2) ISSUED TO OPERATOR, BIKE PLACED ON PROPERTY RECEIPT 3540800.","geometry":{"type":"Point","coordinates":[-75.1102,40.0161]}},{"objectid":1578452,"districtoccur":"24","age":30,"mvc_reason":"PROHIBITED ON SIDEWALK","geometry":{"type":"Point","coordinates":[-75.0979,40.0049]}},{"objectid":1591812,"districtoccur":"06","age":30,"mvc_reason":"WHILE ON PATROL IN A MARKED RPC TRAVELING WB ON 900 PARRISH ST, WE OBSERVED THIS VEHICLE TRAVELING SB ON 10TH ST. THE VEHICLE MADE A RIGHT (WB) TURN ONTO PARRISH WITHOUT STOPPING AT THE STOP SIGN. VEHICLE ALSO WENT UP ON THE SIDEWALK AS IT TURNED. NCIC NO WANTS, BMV VALID PA REGISTRATION. WARNINGS GIVEN TO THE OPERATOR, VEHICLE WAS CBI.","geometry":{"type":"Point","coordinates":[-75.1533,39.9673]}},{"objectid":1588081,"districtoccur":"16","age":62,"mvc_reason":"OPER WAS TRAVELING E/B ON 3900 LANCASTER AVE AND MADE A LEFT TURN ALMOST STRIKING A PEDESTRIAN IN THE CROSSWALK.  V.W.G.","geometry":{"type":"Point","coordinates":[-75.2001,39.962]}},{"objectid":1575140,"districtoccur":"25","age":36,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE PARKED ON THE SIDEWALK WHILE RUNNING AND OCCUPIED 4X. POLICE HAD ALSO RESPONDED TO THE AREA FOR A VEHICLE MATCHING THIS DESCRIPTION FOR FOUR MALES WITH GUNS AND DRUGS. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC NO WANTS. OCCUPANTS ADVISED.","geometry":{"type":"Point","coordinates":[-75.1285,39.999]}},{"objectid":1599470,"districtoccur":"24","age":52,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE MAKE A RIGHT TURN ONTO 1800 ORLEANS STREET WITHOUT USING A TURN SIGNAL. POLICE ALSO OBSERVED THE VEHICLE FAIL TO STOP AT A RED LIGHT. THE VEHICLE STOPPED COMPLETELY PASSED THE PAINTED WHITE STOP LINE AND BLOCKED AN ENTIRE CROSSWALK CAUSING PEDESTRIAN TRAFFIC TO CROSS IN BETWEEN VEHICLES. NCIC/PCIC ON THE VEHICLE AND OPERATOR WITH NO WANTS. FEMALE OPERATOR WAS HIGHLY IRATE. TVRS ISSUED FOR MVC VIOLATIONS. BWC ACTIVATED. VEHICLE STOPPED IN A HIGH CRIME AREA.","geometry":{"type":"Point","coordinates":[-75.12,39.9929]}},{"objectid":1600573,"districtoccur":"24","age":29,"mvc_reason":"VEHICLE OVERTOOK RPC H35 ON THE RIGHT USING THE PARKING/BIKE LANE.","geometry":{"type":"Point","coordinates":[-75.1178,39.9942]}},{"objectid":1600457,"districtoccur":"24","age":24,"mvc_reason":"PARKED WITHIN 20 FEET OF CROSSWALK","geometry":{"type":"Point","coordinates":[-75.1279,39.9952]}},{"objectid":1612481,"districtoccur":"24","age":58,"mvc_reason":"POLICE OBSERVED ABOVE VEH DRIVE ONTO THE SHOULDER/SIDEWALK AT THE INTERSECTION OF KENSINGTON AND VENANGO AROUND ANOTHER VEH WHICH WAS PROPERLY STOPPED AT THE RED LIGHT FACING S/B. THE VEH ALSO HAD NON-WORKING REAR BRAKE LIGHTS. VEH STOPPED FOR PA MVC VIOLATIONS. NCIC/PCIC CHECK RAN ON VEH AND OPERATOR WITH NO WANTS. MALE ISSUED VERBAL WARNING AND RELEASED FROM THE LOCATION.","geometry":{"type":"Point","coordinates":[-75.1062,40.0005]}},{"objectid":1608452,"districtoccur":"18","age":32,"mvc_reason":"POLICE OBS LISTED VEH EXIT THE W.B TRAVEL LANE  AND ENTER THE BIKE  LANE FOR THE  LENGTH OF THE ENTIRE BLOCK PASSING A ALL TRAFFIC ON THE LEFT. VEH STOPPED FOR INVEST. NCIC/PCIC RAN NEG RESULTS. VERBAL WARING GIVE.","geometry":{"type":"Point","coordinates":[-75.2385,39.9585]}},{"objectid":1610177,"districtoccur":"24","age":35,"mvc_reason":"POLICE OBSERVED ABOVE MOTORCYCLE DRIVE INTO THE TURNING LANE AT THE ABOVE LOCATION A GO AROUND MULTIPLE VEH STOPPED AT THE RED LIGHT. THE MOTORCYCLE ALSO HAD NO VISIBLE LICENSE PLATE. VEH STOPPED FOR PA MVC VIOLATIONS. NCIC/PCIC CHECK RAN ON OPERATOR AND BIKE WITH NO WANTS. OPERATOR ISSUED VERBAL WARNING AND RELEASED FROM THE LOCATION.","geometry":{"type":"Point","coordinates":[-75.1113,39.994]}},{"objectid":1608808,"districtoccur":"18","age":32,"mvc_reason":"WHILE ON PATROL, POLICE OBS THE ABV VEH TRAVELLING W/B IN THE LEFT TRAVEL LANE IN A SCHOOL ZONE, DURING SCHOOL HOURS. POLICE THEN OBS VEH CROSS THE SOLID WHITE LINE, DRIVING ONTO THE BIKE LANE TO OVERTAKE THE VEHICLE IN FRONT OF IT, AND THEN CROSS BACK OVER THE SOLID WHITE LINE INTO THE TRAVEL LANE. VEHICLE ALSO DID NOT UTILIZE A TURN SIGNAL. POLICE STOPPED VEHICLE FOR INVEST. NCIC/PCIC CHECK, NO WANTS NO WARRANTS. VERBAL WARNING ISSUE. VEHICLE RELEASED WITHOUT INCIDENT.","geometry":{"type":"Point","coordinates":[-75.2385,39.9585]}},{"objectid":1610962,"districtoccur":"06","age":28,"mvc_reason":"DEFENDANT FAILED TO YIELD PEDESTRIAN IN CROSSWALK CROSSING THE 1100 BLK OF MARKET ST ALMOST STRIKING PEDESTRIAN. DEFENDANT GIVEN WARNING AND CBI","geometry":{"type":"Point","coordinates":[-75.1591,39.9517]}},{"objectid":1604552,"districtoccur":"16","age":27,"mvc_reason":"WHILE STOPPED FACING E/B ON LANCASTER AV POLICE OBSERVED MALE OPERATING LISTED VEHICLE TRAVELING W/B ON LANCASTER AV ENTER THE ONCOMING TRAFFIC LANE TO OVERTAKE A SEPTA BUS DISCHARGING PASSENGERS.  AS VEHCLE BEGAN TO PASS BUS PEDESTRIANS WERE ATTEMPTING TO CROSS, WITHIN THE CROSSWALK, THAT WERE NEARLY HIT BY OPERATOR AS HE CUT BACK IN FRONT OF THE BUS TO THE APPROPRIATE TRAVEL LANE.   MALE BRIEFLY STOPPED BUT THEN CONTINUED W/B THROUGH THE SOLID RED SIGNAL.   VEHICLE STOPPED FOR INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.2025,39.9632]}},{"objectid":1605944,"districtoccur":"19","age":31,"mvc_reason":"POLICE WERE TRAVELLING W/B TOWARDS 5900 MARKET WHILE LISTED VEHICLE WAS IN FRONT. WHEN POLICE OBSERVED LISTED VEHICLE WITH HEAVY TINT AROUND ALL VEHICLE. TINT CREATES A HAZORDOUS ENVIRONEMNT TO THE OPERATOR, POLICE AND PEDESTRIANS. VEHICLE INVESTIGATION WAS CONDUCTED. NCIC/PCIC CHECK SHOWED NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2391,39.9618]}},{"objectid":1602576,"districtoccur":"24","age":29,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVILING SOUTH BOUND ON KENSINGTON AVE PASSING 3100 G ST WHEN VEHICLE RAN THE RED STEADY SIGNAL IN FRONT OF POLICE. VEHICLE WAS RAN THROUGH PCIC AND NCIC WITH NEGATIVE RESULTS. FEMALE OF THE VEHICLE WAS THEN RELEASED AND WAS GIVING A VERBAL WARNING DUE TO HIGH TRAFFIC OF PEDESTRIAN WALKING","geometry":{"type":"Point","coordinates":[-75.1158,39.9953]}},{"objectid":1621121,"districtoccur":"06","age":34,"mvc_reason":"VEHICLES OBSERVED TRAVELING WESTBOUND ON MARKET STREET FROM 12TH, IN THE BUS/BIKE ONLY LANE. VEHICLE STOPPED UPON SIGNALING AND OPERATOR ADVISED.","geometry":{"type":"Point","coordinates":[-75.1602,39.9519]}},{"objectid":1625363,"districtoccur":"03","age":20,"mvc_reason":"POLICE OBSERVED THE MALE SPINNING THE TIRES OF HIS VEHICLE AND SPINNING THE VEHICLE IN A DANGEROUS FASHION IN A BUSY SHOPPING CENTER PARKING LOT DURING BUSINESS HOURS. MALE KNOWINGLY AND WILLINGLY ENGAGED IN THE UNSAFE DRIVING OF HIS VEHICLE PUTTING OTHER DRIVERS AND PEDESTRIANS LIVES AND SAFETY AT RISK. MALE STOPPED FOR INVESTIGATION. VEH AND MALE CLEARED BY INVESTIGATION. MALE VERY IRRATE AND AGITATED AND KEPT YELLING TOWARDS POLICE TO HURRY UP AND ASKED WHAT WAS TAKING SO LONG. MALE ISSUED 3","geometry":{"type":"Point","coordinates":[-75.1402,39.9187]}},{"objectid":1622413,"districtoccur":"25","age":25,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING WITH TINT ON WINDOWS. POLICE ALSO OBSERVED DRIVER PARK IN THE CROSSWALK AT MASCHER AND CAMBRIA. POLICE STOPPED VEHICLE FOR INVESTIGATION. PCIC/NCIC CAME BACK GOOD NO WANTS. VERBAL ONLY.","geometry":{"type":"Point","coordinates":[-75.1323,39.9943]}},{"objectid":1622496,"districtoccur":"25","age":18,"mvc_reason":"THE ABOVE BIKE WAS TRAVELING SOUTH AGAINST THE FLOW OF TRAFFIC ON FRONT ST. FRONT ST IS A ONE WAY ONLY NORTH BOUND. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.13,39.9956]}},{"objectid":1648283,"districtoccur":"16","age":30,"mvc_reason":"OPER MADE A RIGHT TURN ONTO 3800 LANCASTER AVE AND CUT OFF PEDESTRIANS WHO WERE CROSSING S/B IN THE CROSS WALK.  V.W.G.","geometry":{"type":"Point","coordinates":[-75.197,39.9602]}},{"objectid":1648295,"districtoccur":"07","age":30,"mvc_reason":"POLICE OBSERVED THE DRIVER RECKLESSLY DRIVING THROUGH THE RITE AID PARKING LOT AT A HIGH RATE OF SPEED IN AN ATTEMPT TO GET TO THE OTHER SIDE OF ROOSEVELT BLVD SOUTH BOUND WITHOUT HAVING TO WAIT FOR TRAFFIC, DRIVER HAD A TOTAL DISREGARD FOR PEDESTRIANS ENTERING AND EXITING THE RITE AID STORE...POLICE ACTIVATED LIGHTS AND SIRENS AND FEMALE ONLY PULLED OVER AFTER GETTING STUCK AT THE TRAFFIC LIGHT AT 7700 ROOSEVELT BLVD... CITATION WAS ISSUED TO DRIVER FOR RECKLESS DRIVING AND EXPIRED VEHICLE REGI","geometry":{"type":"Point","coordinates":[-75.045,40.0589]}},{"objectid":1647963,"districtoccur":"02","age":14,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING W/B ON MAGEE STOP AT A RED SIGNAL AT LORETTO. OPERATOR CLEARED INTERSECTION AND PROCEEDED TO TURN S/B ONTO LORETTO FROM MAGEE AGAINST RED SIGNAL. \nBMV CHECK WAS CONDUCTED AND VEHICLE WAS IN STOLEN STATUS GUARD FOR PRINTS TAKEN DURING POINT OF GUN CARJACKING. \nI NOTIFED POLICE RADIO AND GAVE LOCATION OF VEHICLE AND AWAITED BACK UP. VEHILE CAME TO A STOP AT 4640 ROOSEVELT BLVD ON SIDEWALK. BOTH DRIVER AND PASSENGER FLED ON FOOT. BOTH MALES WERE STOPPED AND ARRESTE","geometry":{"type":"Point","coordinates":[-75.0765,40.0426]}},{"objectid":1648306,"districtoccur":"18","age":43,"mvc_reason":"VEHICLE WAS OBSERVED BY POLICE GOING AROUND A STATIONARY TROLLEY ON THE LEFT WHILE IT WAS UNLOADING PASSENGERS. THIS ACTION WAS DONE AND THE VEHICLE DROVE THROUGH THE CROSSWALK AND STOPPED IN THE INTERSECTION TO WAIT AT THE RED SIGNAL. VEHICLE WAS STOPPED FOR INVESTIGATION DUE TO THE CARELESS OPERATION OF THE OPERATOR. NCIC/PCIC/BMV, NO WANTS. MALE WAS WARNED AND RELEASED","geometry":{"type":"Point","coordinates":[-75.2322,39.9478]}},{"objectid":1644892,"districtoccur":"26","age":36,"mvc_reason":"LISTED OPERATOR DISREGARDED CAUTION TAPE, DROVE ON THE SIDEWALK, AND DROVE INTO AN ACTIVE CRIME SCENE.","geometry":{"type":"Point","coordinates":[-75.1339,39.9773]}},{"objectid":1631606,"districtoccur":"24","age":14,"mvc_reason":"WHILE TRAVELING BEHIND THE ABOVE VEHICLE AT THE ABOVE LOCATION, POLICE OBSERVED THAT THE VEHICLE HAD VERY HEAVY TINT ALL THE WAY AROUND. BEFORE POLICE COULD ACTIVATE THEIR EMERGENCY LIGHTS, THE VEHICLE PULLED INTO AN ILLEGAL PARKING SPOT WHICH WAS FULLY BLOCKING THE CROSSWALK. POLICE STOPPED THE VEHICLE WITHOUT INCIDENT. DURING THE STOP, THE DRIVER WAS BREATHING VERY FAST WITH HIS STOMACH TREMBLING. HE APPEARED TO BE NERVOUS DURING HIS POLICE QUESTIONS. THE FRONT SEAT PASSENGER REFUSED TO GIVE H","geometry":{"type":"Point","coordinates":[-75.1238,39.9951]}},{"objectid":1665144,"districtoccur":"09","age":29,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELLING SB ON BROAD AT WALNUT STREET, DISREGARD A STEADY RED SIGNAL AT LISTED LOCATION. INFRACTION OCCURED WITHIN A HIGH PEDESTRIAN FOOT TRAFFIC INTERSECTION. THIS IS A VIOLATION OF PA MVC 3112A31. VEHICLE STOPPED FOR INVESTIGATION IMMEDIATELY UPON ACTIVATION OF AUDIBLE SIRENS AND LIGHTS. NCIC/PCIC CHECK, YIELDING OPERATOR OLN 31247374, IN SUSPENDED STATUS. LIVESTOP ELGIBILE, BUT LICENSED DRIVER PASSENGER IN VEHICLE. OPERATOR GAVE PERMISSION FOR MOTHER WITH VALI","geometry":{"type":"Point","coordinates":[-75.1641,39.9505]}},{"objectid":1665145,"districtoccur":"06","age":31,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELLING SB ON BROAD AT SANSOM STREET, DISREGARD A STEADY RED SIGNAL WITHIN A HIGH PEDESTRIAN FOOT TRAFFIC INTERSECTION. THIS IS A VIOLATION OF PA MVC 3312(A)(3)(1), VEHICLE STOPPED FOR INVESTIGATION IMMEDIATELY UPON ACTIVATION OF AUDIBLE SIRENS AND LIGHTS. NCIC/PCIC CHECK, YIELDING NEGATIVE RESULTS. A VERBAL WAS WARNING ISSUED. SUBSEQUENTLY RELEASED WITHOUT INCIDENT.","geometry":{"type":"Point","coordinates":[-75.1641,39.9505]}},{"objectid":1663206,"districtoccur":"24","age":22,"mvc_reason":"DURING ATV CONFISCATION DETAIL. LISTED DRIVER WAS OBSERVED TRAVELING S/B ON K ST OPERATING THE LISTED DIRT BIKE WITHOUT BEING REGISTERED OR TAG. VEHICLE CONFISCATED TO PPD AUTO POUND. PVR ISSUE AND PROPERTY # 3567402","geometry":{"type":"Point","coordinates":[-75.1042,40.0113]}},{"objectid":1657727,"districtoccur":"39","age":31,"mvc_reason":"DEF OBS DRIVING IN AND OUT OF TRAFFIC AND PASSING NUMEROUS VEHICLE ON THE RIGHT SIDE IN BIKE LANE. WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1623,40.022]}},{"objectid":1658043,"districtoccur":"18","age":30,"mvc_reason":"VEHICLE WAS OBSERVED TRAVELING NORTHBOUND AT A HIGH RATE OF SPEED WHILE CROSSING INTO THE PARKING LANE TO PASS SEVERAL VEHICLES ON THE RIGHT. BECAUSE OF THE VEHICLES SPEED, FLOW / AMOUNT OF TRAFFIC, AND ALOT OF PEDESTRIAN TRAFFIC. THIS WAS NOT DONE SO IN A SAFE MANNER AND THE VEHICLE WAS STOPPED FOR INVESTIGATION. NCIC/PCIC-NEGATIVE FOR WANTS. OPERATOR WAS GIVEN A VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.2253,39.9584]}},{"objectid":1667429,"districtoccur":"19","age":37,"mvc_reason":"ABV VEH STOPPED INN THE RUNNING LANE OF TRAFFIC BLOCKING THE BIKE LANE AND FORCING VEH TO GO IN THE OPPOSITE LANE OF TRAVEL TO GET BY. DRIVER HAS NO WANTS AND WAS GIVEN A WARNING","geometry":{"type":"Point","coordinates":[-75.2374,39.969]}},{"objectid":1651891,"districtoccur":"35","age":21,"mvc_reason":"WORKING IN FULL UNIFORM IN A MARKED POLICE VEHICLE AND TRAVELLING NB ON 2ND ST APPROACHING DUNCANNON AVE. POLICE OBSERVED THE LISTED VEHICLE DOING DONUTS IN THE CENTER OF THE INTERSECTION IN THE RAIN WITH OTHER VEHICLES AND PEDESTRIANS PRESENT SHOWING A CARELESS DISREGARD FOR PERSONS AND PROPERTY. POLICE STOPPED THE VEHICLE AT THE LISTED LOCATION FOR INVESTIGATION. NCIC/PCIC RETURNED NO WANTS ON THE OCCUPANTS OR VIN. TVR ISSUED FOR CARELESS DRIVING.","geometry":{"type":"Point","coordinates":[-75.1269,40.0296]}},{"objectid":1653020,"districtoccur":"18","age":28,"mvc_reason":"VEH OBS TRAVELING IN BIKE LANE TO ILLEGALLY PASS VEHICLES ON THE LEFT. STOPPED FOR INVESTIGATION. NO WANTS. VERBAL WARNING ISSUED","geometry":{"type":"Point","coordinates":[-75.2435,39.9591]}},{"objectid":1650948,"districtoccur":"12","age":32,"mvc_reason":"POLICE OBSERVED VEHICLE PARKED AND IDLING ON SIDEWALK ON NORTHBOUND SIDE. POLICE STOPPED FOR INVESTIGATION. PCIC/NCIC QUERY RESULTED IN NEG WANTS. POLICE ISSUED VERBAL WARNING. CBI.","geometry":{"type":"Point","coordinates":[-75.2267,39.9275]}},{"objectid":1673360,"districtoccur":"18","age":38,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED BLOCKING THE CROSSWALK AT THE INTERSECTION OF 58TH ST. / CATHERINE ST. THE VEHICLE WAS PROHIBITING PEDESTRIANS FROM USING THE CROSSWALK. ALSO, THE VEHICLE HAD WINDOW TINT ON ALL WINDOWS OF THE VEHICLE MAKING IT DIFFICULT FOR POLICE TO SEE INSIDE THE VEHICLE. POLICE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK, NO WANTS. \nLISTED TCS ISSUED FOR VIOLATIONS 3353 A1IV PROHIBITIONS IN SPECIFIED PLACES AND 4524B WINDSHIELD OBSTRUCTIONS AND WIPERS.","geometry":{"type":"Point","coordinates":[-75.2393,39.9504]}},{"objectid":1686523,"districtoccur":"02","age":24,"mvc_reason":"POLICE OBSERVED THE VEHILE TRAVELING WEST ON PRINCETON AVE AND DISREGUARTED A 4 WAY STOP SIGN AT THE INTERSECTION WITH LORETTO AVE. THE DRIVER ALSO DISREGUARTED A SECONDS STOP SIGN AT BRIGHTON ST. THE DRIVER DID NOT HAVE A DRIVERS LICENSE, ONLY A BRAZILAIN PASSPORT. TVR ISSUED. VEHICLE WAS LEGGAYLY PARKED ON THE SIDEWALK.","geometry":{"type":"Point","coordinates":[-75.0706,40.0489]}},{"objectid":1686532,"districtoccur":"02","age":27,"mvc_reason":"POLICE OBSERVED THE VEHILE TRAVELING WEST ON PRINCETON AVE AND DISREGUARTED A 4 WAY STOP SIGN AT THE INTERSECTION WITH LORETTO AVE. THE DRIVER ALSO DISREGUARTED A SECONDS STOP SIGN AT BRIGHTON ST. THE DRIVER DID NOT HAVE A DRIVERS LICENSE, ONLY A BRAZILAIN PASSPORT. TVR ISSUED. VEHICLE WAS LEGGAYLY PARKED ON THE SIDEWALK.","geometry":{"type":"Point","coordinates":[-75.0706,40.0489]}},{"objectid":1688757,"districtoccur":"25","age":23,"mvc_reason":"WHILE TRAVELING W/B ON 500 E WYOMING AVE APPROACHING D STREET POLICE OBSERVED ABOVE VEH GO INTO ONCOMING TRAFFIC TO PASS A SEPTA BUS AND ANOTHER VEH AND ALMOST STRIKE A PEDESTRIAN. THE VEH THEN DISREGARDED THE STEADY RED LIGHT AT THE INTERSECTION OF D &AMP; WYOMING. VEH STOPPED FOR PA MVC VIOLATIONS. NCIC/PCIC CHECK RAN ON VEH, OPERATOR AND PASSENGER. PASSENGER HAD VALID PERMIT TO CARRY. OPERATOR ISSUED VERBAL WARNING AND VEH AND OCCUPANTS RELEASED FROM THE LOCATION.","geometry":{"type":"Point","coordinates":[-75.1161,40.0205]}},{"objectid":1681431,"districtoccur":"07","age":20,"mvc_reason":"DEF WAS NB ON VERREE AND USED CENTER MEDIAN LANE TO PASS MULTIPLE VEHICLES AT HIGH RATE OF SPEED UNTIL HE CAME UPON PEDESTRIAN CROSSING SIGNS WHICH FORCED DEF BACK INTO NB LANE CUTTING OFF VEHICLES","geometry":{"type":"Point","coordinates":[-75.0699,40.0789]}},{"objectid":1681779,"districtoccur":"35","age":20,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING WESTBOUND ON STENTON AV WHEN THE OPERATOR USED THE RIGHT SHOULDER AND BIKE LANE TO OVERTAKE SEVERAL OTHER FORWARD MOVING VEHICLES. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1474,40.0499]}},{"objectid":1690194,"districtoccur":"24","age":21,"mvc_reason":"VEHICLE OBSERVED IDLING ON THE CROSSWALK ON THE SOUTH EAST CORNER OF GLENDALE AND LUZERNE. THE VEHIICLE WAS BLOCKING THE CROSSWALK, MAKING IT HAZARDOUS FOR PEDESTRIANS CROSSING THE STREET. THE VEHICLE WAS STOPPED FOR INV.","geometry":{"type":"Point","coordinates":[-75.1018,40.0061]}},{"objectid":1690935,"districtoccur":"01","age":57,"mvc_reason":"WHILE ASSIGNED TO PHILLIES (CITIZENS BANK PARK) L&AMP;I DETAIL, ABOVE VEHICLE SEEN OPERATING WESTBOUND AT LISTED LOCATION WITHOUT USING A TURN SIGNAL WHEN TURNING OFF OF 10TH STREET ONTO PATTISON AV. VEHICLE THEN PROCEED WEST ON PATTISON AV WEAVING IN AND OUT OF THE 2 TRAVEL LANES (NOT DRIVING STRAIGHT) WITHOUT SIGNALING YELLING OUT OF THE WINDOW OF THE VAN AT VENDORS ON THE SIDEWALKS. WITH THE VEHICLE BECOMING A HAZZARD ON THE ROAD WAY TO PEDESTRIANS AND OTHER MOTORIST, THE VAN WAS THEN STOPPED","geometry":{"type":"Point","coordinates":[-75.171,39.9051]}},{"objectid":1689186,"districtoccur":"22","age":32,"mvc_reason":"VEHICLE HAD A BIKE RACK OBSCURING THE PLATE UNABLE TO READ OPERATOR ADVISED","geometry":{"type":"Point","coordinates":[-75.1664,39.9859]}},{"objectid":1691717,"districtoccur":"06","age":24,"mvc_reason":"VEHICLE OBSERVED PARKED WHILE ENGINE RUNNING IN THE BIKE LANE THAT GOES E/B ON THE 100O BLOCK OF PINE STREET. THE VEHICLE WAS BLOCKING THE BIKE LANE COMPLETELY CAUSING A CYCLIST TO ENTER INTO THE SINGLE E/B TRAVEL LANE FOR VEHICLES. NCIC/PCIC NO WANTS. VERBAL WARNED. VEHICLE AND OPERATOR IN GOOD STANDING.","geometry":{"type":"Point","coordinates":[-75.1583,39.9447]}},{"objectid":1692611,"districtoccur":"18","age":31,"mvc_reason":"POLICE OFFICER WAS ATTEMPTING TO CROSS INTERSECTION ON FOOT. AS A RESULT, DRIVER OF VEHICLE REFUSED TO SLOW DOWN OR YIELD TO PEDESTRIAN TRAFFIC WHILE OFFICER WAS CROSSING INTERSECTION. UPON FURTHER POLICE INVESTIGATION, IT WASS DISCOVERED THAT VEHICLE IS UNREGISTERED. TVRS ISSUED.","geometry":{"type":"Point","coordinates":[-75.2123,39.9413]}},{"objectid":1694685,"districtoccur":"09","age":45,"mvc_reason":"ABOVE OPER WAS TRAVELING IN LEFT LANE WHICH IS FOR BIKE AND BUS ONLY","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":1695705,"districtoccur":"07","age":62,"mvc_reason":"VEHICLE SOUTH ON BUSTLETON WITH NO HEADLIGHTS OR RUNNING LIGHTS IN LIGHT RAIN AND LOW VISIBILITY ON WET ROAD DANGER TO SELF  OTHER MOTORIST AND PEDESTRIANS VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.0334,40.0901]}},{"objectid":1695020,"districtoccur":"09","age":30,"mvc_reason":"ABOVE OPERATOR WAS TRAVELING IN BIKE AND BUS ONLY LANE MARKED BY SIGNS AND IN WHITE WRITING ON HIGHWAY.","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":1695031,"districtoccur":"09","age":20,"mvc_reason":"OPERATOR WAS TRAVELING IN BUS AND BIKE ONLY LANE CLEARLY MARKED BY WHITE WRITING ON HIGHWAY AND ON SIGNS POSTED ON POLES","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":1710366,"districtoccur":"18","age":31,"mvc_reason":"VEH WAS TRAVELING S/B ON 42ND ST AT PINE. DRIVER FAILED TO YIELD TO A PED CROSSING IN THE MARKED CROSSWALK. VEH STOPPED FOR THE VIOLATION. NCIC/PCIC CHECK OK. WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2076,39.9512]}},{"objectid":1706296,"districtoccur":"07","age":62,"mvc_reason":"VEHICLE OBSERVED TRAVELING THE WRONG WAY S/B ON BUSTLETON IN THE BIKE LANE TO PULL INSIDE THE SHOPPING CENTER, VEHICLE AND OPERATOR RAN NCIC/PCIC NO WANTS.","geometry":{"type":"Point","coordinates":[-75.0167,40.0937]}},{"objectid":1705976,"districtoccur":"02","age":22,"mvc_reason":"VEHICLE OBSERVED ABRUPTLY MAKING A U TURN AT A HIGH RATE OF SPEED PRIOR TO BEING SURE THE AREA WAS CLEAR OF ANY ONCOMING TRAFFIC OR PEDESTRIANS. NO WANTS, VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.0693,40.0444]}},{"objectid":1705411,"districtoccur":"26","age":74,"mvc_reason":"POLICE OBSERVED LISTED VEH TRAVELING SOUTH ON AMERICAN BEHIND SEPTA BUS. SPETA BUS CAME TO A STOP TO PICK UP PASSENGERS LISTED VEH OVER TOOK THE BUS ON THE LEFT HAND SIDE CROSSING OVER THE MARKED BIKE LANE AND IN COMING TRAFFIC. NCIC PCIC NO WANTS CLEARED AFTER INVEST","geometry":{"type":"Point","coordinates":[-75.1378,39.9847]}},{"objectid":1706586,"districtoccur":"17","age":27,"mvc_reason":"ABOVE OPERATOR OBSERVED TRAVELING S/B ON S. BROAD ST WITH HER HEADLIGHTS OUT AND A BIKE RACK COVERING HER PLATE. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1659,39.9425]}},{"objectid":1717522,"districtoccur":"18","age":28,"mvc_reason":"VEHICLE WAS OBSERVED BY POLICE N/B ON 52ND ST WHEN IT USED THE CENTER NON TRAVEL LANE TO DRIVE AROUND ANOTHER VEHICLE WHICH WAS ALSO TRAVELING N/B. THE PASSING ON THE VEHICLE WAS DONE IN AN UNSAFE MANNER IN AN AREA WITH HIGH PEDESTRIAN TRAFFIC. VEHICLE WAS STOPPED ON 5200 LOCUST. THE MALE EXITED THE VEHICLE QUICKLY AND WAS DETAINED BY POLICE. NCIC/PCIC/BMV CHECK SHOWED THE MALE DID NOT HAVE A VALID OPERATOR&APOS;S LICENSE. THE MALE HAD ARRIVED AT HIS DESTINATION AND WAS PARKED LEGALLY. HE WAS IS","geometry":{"type":"Point","coordinates":[-75.2261,39.9545]}},{"objectid":1699623,"districtoccur":"14","age":30,"mvc_reason":"POLICE OBSERVER VEHICLE TRAVELING SOUTHBOUND ON OGONTZ AVE AT A HIGH RATE OF SPEED IN WET CONDICTIONS GOING IN AND OUT OF TRAFFIC AND PASSING OTHER VEHICLES TRAVELING IN THE SAME DIRECTION ON THE RIGHT IN THE BIKE LANE. VEHICLE ALSO DISREGARDED A STEADY RED SIGNAL. VEHICLE STOPPED FOR INVESTIGATION. POLICE COULD SMELL A STRONG ODOR OF MARIJUANA COMING FROM THE VEHICLE. PCIC/NCIC NEGATIVE RESULTS. TVR WAS FILED DUE TO ISSUES WITH THE PRINTER.","geometry":{"type":"Point","coordinates":[-75.1573,40.0701]}},{"objectid":1699627,"districtoccur":"14","age":24,"mvc_reason":"POLICE OBSERVER VEHICLE TRAVELING SOUTHBOUND ON OGONTZ AVE AT A HIGH RATE OF SPEED IN WET CONDICTIONS GOING IN AND OUT OF TRAFFIC AND PASSING OTHER VEHICLES TRAVELING IN THE SAME DIRECTION ON THE RIGHT IN THE BIKE LANE. VEHICLE ALSO DISREGARDED A STEADY RED SIGNAL. VEHICLE STOPPED FOR INVESTIGATION. POLICE COULD SMELL A STRONG ODOR OF MARIJUANA COMING FROM THE VEHICLE. PCIC/NCIC NEGATIVE RESULTS. TVR WAS FILED DUE TO ISSUES WITH THE PRINTER.","geometry":{"type":"Point","coordinates":[-75.1573,40.0701]}},{"objectid":1730350,"districtoccur":"14","age":77,"mvc_reason":"VEHICLE OBSERVED TRAVELING N/B ON GERMANTOWN AVE BEING OPERATED IN A CARELESS MANNER AND WITHOUT REGARD FOR OTHER VEHICLES AND PEDESTRIANS. WHILE TRAVELING N/B ON GERMANTOWN AVE, THE LISTED VEHICLE WAS OBSERVED TAILGATING A RED MINIVAN IN FRONT OF IT. POLICE WERE IN A MARKED RPC BEHIND THE LISTED BLACK VEHICLE WHEN BOTH VEHICLES CAME TO A STOP AT THE STEADY RED TRAFFIC SIGNAL AT GERMANTOWN AVE &AMP; E TULPEHOCKEN ST. THE BLACK VEHICLE THEN PROCEEDED INTO THE SHOULDER LANE TO THE RIGHT OF THE MIN","geometry":{"type":"Point","coordinates":[-75.1798,40.042]}},{"objectid":1727983,"districtoccur":"06","age":23,"mvc_reason":"POLICE OBSERVED LISTED MALE DRIVING N/B ON BROAD WHEN VEHICLES DRIVER DISREGARDED STEADY RED LIGHT, MALE WAS DRIVING WITH A GROUP OF ATV AND DIRTBIKES","geometry":{"type":"Point","coordinates":[-75.165,39.9453]}},{"objectid":1727687,"districtoccur":"25","age":25,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE TRAVELING ON THE SIDEWALK OF THE 500 BLOCK OF E WYOMING, OPERATOR WAS DRIVING THE CAR ON THE SIDEWALK FROM 560 E WYOMING  TO 500 E WYOMING, THEN THE OPERATOR DROVE THE VEHICLE ONTO THE HIGHWAY AND MADE A COMPLETE STOP AT THE GREEN STREET LIGHT. THEN THE OPERATOR STOPPED AT THE GREEN LIGHT AT 500 E WYOMING (BLOCKING THE VEHICULAR TRAFFICS FROM NATURALLY MOVING ). POLICE NICIC/PCIC CHECKED THE CAME BACK NEGATIVE. POLICE OBSERVED MALE WAS NOT WEARING THE SEATBELT. OPER","geometry":{"type":"Point","coordinates":[-75.1168,40.0206]}},{"objectid":1741064,"districtoccur":"07","age":58,"mvc_reason":"VEHICLE SOUTH BOUND FAILED TO YEILD TO PEDESTRIANS IN CROSSWALK","geometry":{"type":"Point","coordinates":[-75.0442,40.0602]}},{"objectid":1743220,"districtoccur":"14","age":29,"mvc_reason":"VEH OBSERVED TRAVELING WB ON SIDEWALK AT ABV LOC, VEH STOPPED FOR INVESTIGATION, VERBAL WARNING GIVEN, CBI","geometry":{"type":"Point","coordinates":[-75.1697,40.0407]}},{"objectid":1740907,"districtoccur":"35","age":60,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING EASTBOUND ON STENTON AV USING THE BIKE LANE AND RIGHT SHOULDER TO OVERTAKE SEVERAL FORWARD MOVING VEHICLES WAITING AT THE LIGHT AT OLD YORK RD AND THEN AGAIN AT BROAD ST. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1363,40.0465]}},{"objectid":1722337,"districtoccur":"25","age":24,"mvc_reason":"THE ABOVE VEHICLE WAS TRAVELLING AT A HIGH RATE OF SPEED IN THE RAIN APPROACHING A STEADY RED LIGHT. THE ABOVE VEHICLE HAD HEAVY TINT ON ALL WINDOWS. THE VEHICLE ATTEMPTED TO STOP AT THE LAST MINUTE AND THE VEHICLE BEGAN TO SLIDE IN THE RAIN THROUGH THE PEDESTRIAN CROSS WALK. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1388,39.992]}},{"objectid":1746626,"districtoccur":"18","age":25,"mvc_reason":"VEHICLE WAS OBSERVED BY POLICE AT THE LOCATION WITH NO HEADLIGHTS OR TAILLIGHTS ACTIVATED ON THE VEHICLE. THE LIGHTING OUTSIDE REQUIRED LIGHTING OF THE VEHICLE TO ADEQUATELY ALERT PEDESTRIAN AND VEHICULAR TRAFFIC TO ITS PRESENCE ON THE HIGHWAY. SUNSET FOR THE DAY WAS AT 6:01PM. DURING THE VEHICLE INVESTIGATION, A FIREARM WAS RECOVERED FOR THE OPERATOR AND LONE OCCUPANT&APOS;S HOODY POCKET. NCIC/PCIC/BMV REVEALED THE VEHICLE WAS PROPERLY REGISTERED AND THE MALE WAS NOT PERMITTED TO CARRY A FIREAR","geometry":{"type":"Point","coordinates":[-75.2312,39.9591]}},{"objectid":1744346,"districtoccur":"12","age":34,"mvc_reason":"POLICE OBSERVED ABOVE DRIVER OPERATNG LISTED VEHICLE STOPPED AT RED LIGHT (58/LINDBERGH) IN RIGHT TURN ONLY LANE. UPON CHANGE TO GREEN LIGHT, DRIVER IN LISTED VEHICLE DID NOT TURN BUT CONTINUED E/B OVERTAKING ALL VEHICLES USING BIKE LANE. NCIC/PCIC NO WANTS. DRIVER RELEASED WITH A VERBAL WARNING. BWC ACTIVATED.","geometry":{"type":"Point","coordinates":[-75.2196,39.9274]}},{"objectid":1744717,"districtoccur":"35","age":41,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING SOUTHBOUND ON 5TH ST USING THE RIGHT SHOULDER/BIKE LANE TO OVERTAKE OTHER FORWARD MOVING VEHICLES. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1299,40.0397]}},{"objectid":1743424,"districtoccur":"17","age":45,"mvc_reason":"POL OBS VEH STOPPING IN THE MIDDLE OF THE CROSSWALK ON THE SOUTHWEST CORNER OF THE 1300 BLOCK OF S. 19TH ST.  WHICH PREVENTED TRAFFIC FROM BEING ABLE TO MAKE A RIGHT TURN ONTO 19TH ST.  STOPPED FOR MVC 3710.  NCIC/PCIC NO WANTS.  VERBAL ONLY.","geometry":{"type":"Point","coordinates":[-75.1671,39.9743]}},{"objectid":1748792,"districtoccur":"16","age":28,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING S/B ON 48TH ST AT A HIGH RATE OF SPEED WITH ANOTHER BLACK UNKNOWN VEHICLE TAKING MULTIPLE STOP SIGNS AND RED LIGHTS ON 48TH ST KICKING UP DUST IN THE STREET WITH NO DISREGARD FOR OTHER VEHICLES OR PEDESTRIANS POLICE ACTIVED LIGHTS THE LISTED VEHICLE CONTINUED TO TRAVEL S/B ON 48TH UNTIL FINALLY STOPPING AT LISTED LOCATION AS POLICE APPROACHED THE LISTED DRIVER MADE A MOVEMENT FORWARD WITH HIS HEAD DOWN AND THEN SIT STRAIGHT BACK IN HIS SEAT POLICE ASKED M","geometry":{"type":"Point","coordinates":[-75.217,39.9591]}},{"objectid":1793875,"districtoccur":"24","age":25,"mvc_reason":"POLICE WERE TRAVELING EB ON THE 100 BLOCK OF E ALLEGHENY WHEN THEY CAME INTO CONTACT WITH THE LISTED VEHICLE DOUBLE PARKED IN THE BIKE LANE NOT MOVING WITH THE HAZARD LIGHTS ON. NCIC/PCIC CHECK LISTED VEHICLE CAME BACK TO A VEHICLE IN STOLEN STATUS. UPON FURTHER INVESTIGATION VEHICLE WAS FOUND TO NOT BE IN STOLEN STATUS. THE REGISTRATION WAS EXPIRED, LISTED MALE UPDATED REGISTRATION THROUGH PENDOT WHILE POLICE HAD VEHICLE STOPPED. MALE ISSUED VERBAL WARNING. CBI.","geometry":{"type":"Point","coordinates":[-75.1286,39.9984]}},{"objectid":1851530,"districtoccur":"12","age":22,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE PARKED ON THE SIDEWALK AT THE ABOVE LOCATION. POLICE STOPPED THE VEH FOR INV.MALES WERE ALSO SMOKING AN UINRECOVERABLE AMOUNT OF MARIUJUANA. VEH AND OCCUPANTS RETURNED NO WANTS NCIC/PCIC.CBI","geometry":{"type":"Point","coordinates":[-75.2291,39.9449]}},{"objectid":1840742,"districtoccur":"35","age":60,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING EASTBOUND ON STENTON AV WHEN THE DRIVER USED THE BIKE LANE/SHOULDER ON THE RIGHT TO PASS A MARKED PATROL VEHICLE AND PROCEED THROUGH THE RED LIGHT AT OLD YORK RD IN THE RAIN CREATING A HAZARD. TVR ISSUED.","geometry":{"type":"Point","coordinates":[-75.1408,40.0473]}},{"objectid":1841801,"districtoccur":"25","age":23,"mvc_reason":"THE ABOVE VEHICLE HAD HEAVY TINT ON ALL WINDOWS. THE VEHICLE ALSO DROVE ONTO THE SIDEWALK AS IT MADE A RIGHT TURN ONTO BROAD ST. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1496,40.0107]}},{"objectid":1875542,"districtoccur":"24","age":15,"mvc_reason":"VEH OBSERVED N ON KENSINGTON AND MAKE A RIGHT ONTO ALLEGHENNY AT A HIGH RATE OF SPEED CAUSING PEDESTRIANS TO JUMP OUT OF THE WAY","geometry":{"type":"Point","coordinates":[-75.1134,39.9965]}},{"objectid":1878568,"districtoccur":"03","age":80,"mvc_reason":"ABOVE VEHICLE WAS TRAVELING W/B ON PINE ST, PROCEEDED TO TURN LEFT ON BROAD ST WHILE IGNORING PEDESTRIANS CROSSING THE STREET. VEHICLE NEARLY MADE CONTACT WITH PED. VEHICLE WAS STOPPED, INVESTIGATED THEN RELEASED WITH A VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.1653,39.9447]}},{"objectid":1878737,"districtoccur":"24","age":27,"mvc_reason":"STOPPED ON SIDEWALK","geometry":{"type":"Point","coordinates":[-75.1274,39.9952]}},{"objectid":1879145,"districtoccur":"07","age":27,"mvc_reason":"DRIVER TRAVELING NORTH ON BUSTLETON AVE. AT GRANT STOPPED IN THE CROSSWALK","geometry":{"type":"Point","coordinates":[-75.0384,40.0845]}},{"objectid":1869928,"districtoccur":"03","age":67,"mvc_reason":"VEH OBSERVED E/B 1100 PATTISON AVE FAIL TO YIELD TO PEDS IN CROSSWALK.","geometry":{"type":"Point","coordinates":[-75.1685,39.9048]}},{"objectid":1868387,"districtoccur":"25","age":21,"mvc_reason":"VEHICLE OBSERVED OPERATING ON THE SIDEWALK WHILE TRAVELING W/B ON LEHIGH AVE AT 2ND ST. FURTHER INVEST SHOWED OPERATOR HAD AN EXP ID AND BMV CHECK OF DIRTBIKE SHOWED IT WAS IN STOLEN STATUS AFTER RUNING VIN# THROUGH BMV. MALE TAKEN INTO CUSTODY AND TRANSPORTED TO 25TH CCTV FOR PROCESSING. DIRTBIKE RECOVERED BY TOW.","geometry":{"type":"Point","coordinates":[-75.1349,39.9914]}},{"objectid":1886033,"districtoccur":"35","age":21,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING SOUTHBOUND ON RISING SUN AV USED THE RIGHT BIKE LANE/PARKING LANE TO OVERTAKE SEVERAL OTHER FORWARD MOVING VEHICLES AT A HIGH RATE OF SPEED. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1149,40.0345]}},{"objectid":1868242,"districtoccur":"22","age":29,"mvc_reason":"DRIVER OPERATED VEHICLE WEST ON GLENWOOD AND FAILED TO STOP PROPERLY AT A STEADY RED SIGNAL. VEHICLE WAS BLOCKING PEDESTRIAN CROSSWALK AND INTO THE INTERSECTION. VEHICLE ALSO HAD TINTED WINDOWS, UNABLE TO SEE DRIVER FROM A REASONABLE DISTANCE. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1816,39.9833]}},{"objectid":1867089,"districtoccur":"39","age":25,"mvc_reason":"ON THE ABOVE DATE AND TIME OFFICERS OBSERVED THE ABOVE VEHICLE IN THE AREA OF 18TH AND BUTLER DRIVING ERRATICALLY, WEAVING IN AND OUT OF TRAFFIC AND DRIVING THE WRONG WAY ON A ONE WAY STREET. OFFICERS PULLED ALONG SIDE THE BIKE AND INSTRUCTED THE MALE TO TAKE THE BIKE INSIDE THE HOUSE. MALE SPED OFF AT A HIGH RATE OF SPEED ON THE SIDEWALK CAUSING PEDESTRIANS TO HAVE TO MOVE OUT OF THE WAY. OFFICERS CONTINUED WITH THEIR PATROL AROUND THE AREA. APPROXIMATELY 5 MINUTES LATER OFFICERS COULD HEAR THE","geometry":{"type":"Point","coordinates":[-75.156,40.0099]}},{"objectid":1897938,"districtoccur":"35","age":23,"mvc_reason":"POLICE OBSERVED THE VEHICLE TRAVELING NORTHBOUND ON OGONTZ AV GO AROUND A SCHOOL BUS STOPPED AT THE RED LIGHT AT CHEW AV ON THE LEFT. VEHICLE STOPPED ON COMMAND, BUT FLED POLICE AFTER THE DRIVER GAVE PAPERWORK AND HIS NAME WORD OF MOUTH. THE VEHICLE WAS LAST SEEN NORTHBOUND ON OGONTZ AV USING THE BIKE LANE AT A HIGH RATE OF SPEED BEFORE TURNING EASTBOUND ONTO GRANGE AV. POLICE GAVE FLASH INFO TO RADIO. THE VEHICLE WAS LATER LOCATED IN THE REAR OF THE DRIVERS ADDRESS. TVRS ISSUED TO OPERATOR AT T","geometry":{"type":"Point","coordinates":[-75.1508,40.0417]}},{"objectid":1896562,"districtoccur":"22","age":22,"mvc_reason":"FEMALE DROVE WELL OVER POSTED SPEED LIMIT OF 25 MPH ON 1700 N 19TH STREET AS POLICE WERE SPEAKING TO A PEDESTRIAN. THE SPEED OF VEH SHOOK THE RPC THE OFFICER WAS SITTING IN. POLICE WERE ABLE TO CATCH UP TO VEH AT A RED LIGHT AT SUSQUEHANNA AND 19TH STREETS. VEH STOPPED FEMALE WARNED. NO WANTS.","geometry":{"type":"Point","coordinates":[-75.1659,39.9798]}},{"objectid":1899144,"districtoccur":"06","age":30,"mvc_reason":"THE SGT OBSERVED THE DRIVER OF THE SUBJECT VEHICLE FAIL TO STOP FOR TWO (2) STEADY RED LIGHTS WHILE TRAVELING EB ON MARKET ST. THE FIRST WAS AT 12TH ST, THE SECOND AT 11TH ST. SEVERAL PEDESTRIANS WERE IN THE INTERSECTIONS AT THE TIME.","geometry":{"type":"Point","coordinates":[-75.1599,39.9519]}},{"objectid":1919410,"districtoccur":"24","age":28,"mvc_reason":"POLICE WERE AT THE REDLIGHT AT TULIP AND ALLEGHENY WHEN OBSERVING ABOVE VEHICLE TRAVEL THROUGH THE INTERSECTION NB ON TULIP AT SUCH A HIGH RATE OF SPEED IT WOULD BE IMPOSSIBLE TO STOP FOR PEDESTRIANS OR EMERGENCY VEHICLES. VEHICLE STOPPED FOR INVESTIGATION RAN ON NCIC/PCIC NO WANTS VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1061,39.9903]}},{"objectid":1918050,"districtoccur":"12","age":25,"mvc_reason":"POLICE OBS. VEHICLE DRIVING ON SIDEWALK E/B ON 6100 ELMWOOD AVENUE AND BLOCKING THE SIDEWALK COMPLETELY OF PEDESTRIAN FLOW. POLICE STOPPED FOR INVESTIGATION AND NCIC/PCIC QUERY RESULTED IN NEGATIVE RESULTS, NO WANTS. POLICE ISSUED VERBAL WARNING FOR VIOLATION.","geometry":{"type":"Point","coordinates":[-75.2249,39.926]}},{"objectid":1911762,"districtoccur":"35","age":21,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING N/B ON THE 5800 BLOCK OF N BROAD PASSING MULTIPLE CARS IN THE TURN ONLY LANE AND CONTINUING N/B ON BROAD STREET CAUSING VEHICLES TO SLAM ON THEIR BRAKES AND CREATING A HAZARD FOR OTHER VEHICLES AND PEDESTRIANS. VEHICLE  STOPPED AT 6000 N BROAD AND RAN THROUGH PCIC/NCIC, NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1442,40.0417]}},{"objectid":1911836,"districtoccur":"35","age":50,"mvc_reason":"POLIC WERE TRAVELLING N/B ON OGONTZ WHEN THE ABV VEHICLE PASSED MULTIPLE VEHICLES AND THE POLICE IN THE BIKE LANE. VEHICLE STOPPED FOR INVESTIGATION. OPERATOR/VEHICLE/OCCUPANT RAN THROUGH PCIC/NCIC. NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1502,40.0422]}},{"objectid":1913314,"districtoccur":"39","age":17,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING WESTBOUND ON 2000 W ALLEGHENY AVE ON THE SIDEWALK WITH NO HEADLAMPS OR REFLECTORS ON THE VEHICLE. VEHICLE WAS CAUSING A HAZARD TO FOOT TRAFFIC IN THE AREA. VEHICLE STOPPED FOR INVESTIGATION, OPERATOR RAN NCIC/PCIC WITH NO WANTS. VERBAL WARNING GIVEN TO THE OPERATOR.","geometry":{"type":"Point","coordinates":[-75.1625,40.0028]}},{"objectid":1932444,"districtoccur":"39","age":34,"mvc_reason":"DRIVER WAS OBSERVED OPERATING A MOTOR VEHICLE AT A HIGH RATE OF SPEED IN A RESIDENTIAL NEIGHBORHOOD CAUSING A HAZARD TO VEHICLE AND PEDESTRIAN TRAFFIC\n\nDRIVER AND VEHICLE CLEARED BY IN-VEST\n\nVERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1746,39.9982]}},{"objectid":1941386,"districtoccur":"39","age":21,"mvc_reason":"WHILE ON PATROL AS 39S6 IN MARKED RPC 3915 IN FULL UNIFORM, P/O SUTTON #7111 OBSERVED A DARK BLUE CHEVY EQUINOX PA TAG# LNC3813, NO TINT, TRAVELING SOUTH BOUND ON 18TH STREET TOWARDS WINGOHOCKING. THE VEHICLE DROVE THROUGH THE CLEARLY POSTED STOP SIGN LOCATED AT 18TH AND WINGOHOCKING AS A PEDESTRIAN WAS TRYING TO CROSS. VEHICLE TURNED EAST BOUND ONTO 1700 WINGOHOCKING A HIGH RATE OF SPEED.  I ACTIVATED MY LIGHTS AND SIRENS AND GOT BEHIND THE VEHICLE. AFTER THE VEHICLE PULLED OVER, I OBSERVED THE","geometry":{"type":"Point","coordinates":[-75.1563,40.0209]}},{"objectid":1958439,"districtoccur":"17","age":51,"mvc_reason":"POLICE OBSERVED ABV FEMALE OPERATING VEHICLE DISREGARD STOP SIGN AT ABV LOCATION. PER NCIC/PCIC, FEMALE DOES NOT POSSES A VALID LICENSE. MOM (PEDESTRIAN #3) CAME TO THE LOCATION WITH A VALID LICENSE AND DROVE THE VEHICLE AWAY BECAUSE OF THE DRIVERS 3 MONTH OLD BABY IN THE VEHICLE. VEHICLE RELEASED TO MOM.","geometry":{"type":"Point","coordinates":[-75.191,39.9346]}},{"objectid":1955810,"districtoccur":"06","age":56,"mvc_reason":"OBSERVED A GOLD SEDAN TRAVELING NORTH ON 13TH STREET IN THE BIKE LANE. CLEARLY MARKED. OPERATOR ADVISED. NCIC/PCIC NO WANTS","geometry":{"type":"Point","coordinates":[-75.1622,39.9489]}},{"objectid":1958118,"districtoccur":"08","age":36,"mvc_reason":"VEHICLE OBSERVED TRAVELING S/B ON ACADEMY RD. VEHICLE WENT INTO THE SHOULDER AND IN THE BIKE LINE TO PASS SEVERAL VEHICLES ON THE RIGHT.","geometry":{"type":"Point","coordinates":[-75.0088,40.0674]}},{"objectid":1968340,"districtoccur":"17","age":28,"mvc_reason":"POLICE STOPPED LISTED VEHICLE OBSERVED TRAVELLING EB ON SOUTH STREET OBSTRUCTING THE PROTECTED BIKE LANE ALMOST RESULTING IN COLLISION WITH PEDACYCLIST TRAVELLING IN THE SAME DIRECTION ON THE SINGLE LANE ROADWAY. NCIC/PCIC CHECK, YIELDING NEGATIVE RESULTS. VERBAL WARNING GIVEN. THE OTHER PARTY WALKED OFF AND DID NOT WANT TO FILE A REPORT. VERBAL WARNING GIVEN, SUBSEQUENTLY RELEASED WITHOUT INCIDENT.","geometry":{"type":"Point","coordinates":[-75.1786,39.9453]}},{"objectid":1973682,"districtoccur":"19","age":15,"mvc_reason":"POLICE TRAVELING W/B ON 5300 HAVERFORD AVE OBSERVED ABOVE VEHICLE TRAVELING E/B ON HAVERFORD AVE. WHEN THE DRIVER OF THE SUBARU MADE EYE CONTACT WITH POLICE HE IMMEDIATELY DROVE OFF AT A HIGH RATE OF SPEED DRIVING ON THE SIDEWALK AT THE INTERSECTION OF HAVERFORD AND VINE ST THEN S/B ON WILTON ST. POLICE WENT S/B ON WILTON ST AND OBSERVED THE VEHICLE THEN GOING E/B ON ARCH ST. POLICE WENT ON 52ND AND OBSERVED THE VEHICLE STUCK IN TRAFFIC AT 52ND AND ARCH ST. POLICE ACTIVATED LIGHTS AND SIRENS TO","geometry":{"type":"Point","coordinates":[-75.2246,39.9616]}},{"objectid":1973685,"districtoccur":"19","age":16,"mvc_reason":"POLICE TRAVELING W/B ON 5300 HAVERFORD AVE OBSERVED ABOVE VEHICLE TRAVELING E/B ON HAVERFORD AVE. WHEN THE DRIVER OF THE SUBARU MADE EYE CONTACT WITH POLICE HE IMMEDIATELY DROVE OFF AT A HIGH RATE OF SPEED DRIVING ON THE SIDEWALK AT THE INTERSECTION OF HAVERFORD AND VINE ST THEN S/B ON WILTON ST. POLICE WENT S/B ON WILTON ST AND OBSERVED THE VEHICLE THEN GOING E/B ON ARCH ST. POLICE WENT ON 52ND AND OBSERVED THE VEHICLE STUCK IN TRAFFIC AT 52ND AND ARCH ST. POLICE ACTIVATED LIGHTS AND SIRENS TO","geometry":{"type":"Point","coordinates":[-75.2246,39.9616]}},{"objectid":1974112,"districtoccur":"18","age":20,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE TRAVELING NORTHBOUND ON 53RD ST DISREGARD THE STOP SIGN AT THE ABOVE INTERSECTION. THE VEHICLE THEN TURNED EASTBOUND ON CHANCELLOR ST WITHOUT SIGNALING. POLICE THEN ACTIVATED THEIR LIGHTS AND SIRENS AND THE VEHICLE PULLED OVER INTO THE CROSSWALK OF 52ND AND CHANCELLOR (SOUTHEAST CORNER)","geometry":{"type":"Point","coordinates":[-75.2277,39.9561]}},{"objectid":1982969,"districtoccur":"14","age":31,"mvc_reason":"ABOVE LISTED VEHICLE HAD THE ENGINE ON AND WAS STANDING ON THE SIDEWALK OF ABOVE LISTED LOCATION WITH HEAVILY TINTED WINDOWS (MVC VIOLATION 4524(E)). POLICE RAN ABOVE LISTED PA TAG LWY3709 THROUGH NCIC/PCIC AND CAME BACK UNREGISTERED. LISTED VEHICLE WAS STOPPED FOR INVESTIGATION. UPON FURTHER INVESTIGATION, ABOVE LISTED DRIVER STATED THAT HE JUST PURCHASED THE VEHICLE AND PROVIDED PROPER DOCUMENTATION. CBI. A VERBAL WARNING WAS GIVEN FOR THE MVC VIOLATION 4524(E).","geometry":{"type":"Point","coordinates":[-75.1755,40.0507]}},{"objectid":1990607,"districtoccur":"17","age":35,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE DOUBLE PARKED IN THE CROSSWALK AT 27TH AND TASKER ST WITH TINTED WINDOWS SO DARK POLICE COULD NOT SEE INTO THE VEHICLE. VEHICLE WAS ALSO BLOCKING PEDESTRIAN TRAFFIC FORCING PEDESTRIANS TO WALK OUT OF THE CROSSWALK AND INTO THE INTERSECTION. VEHICLE STOPPED FOR INVESTIGATION AT 28TH AND DICKINSON ST. NCIC/PCIC CHECK. NEGATIVE RSULTS FOR WARRANTS. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1894,39.9344]}},{"objectid":1989257,"districtoccur":"12","age":45,"mvc_reason":"POLICE OBSERVED LISTED VEH TRAVELING N/B ON 2200 S 58TH ST WHEN POLICE OBSERVED LISTED VEH CROSS THE DOUBLE YELLOW LINES SEVERAL TIMES AND CROSS OVER INTO THE BIKE LANE. POLICE STOPPED VEH FOR INVESTIGATION. NCIC/PCIC, CBI. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.2246,39.9324]}},{"objectid":2011990,"districtoccur":"18","age":27,"mvc_reason":"VEHICLE WAS OBSERVED TRAVELING SOUTHBOUND ON 58TH STREET FOR SEVERAL BLOCKS AT A HIGHER RATE OF SPEED THAN OTHER TRAFFIC TRAVELING AT THE SPEED LIMIT. VEHICLE THAN TURNED EASTBOUND ON WASHINGTON WITHOUT SIGNALING OR COMPLETELY STOPPING AT THE INTERSECTION. ALL WHILE TRAVELING IN AN UNLIT SECTION OF RESIDENTIAL HOUSING POSING A RISK FOR A PEDESTRIAN ACCIDENT. VEHICLE WAS STOPPED FOR INVESTIGATION, NCIC/PCIC-NEGATIVE FOR WANTS OPERATOR WAS GIVEN A VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.2391,39.9504]}},{"objectid":2019373,"districtoccur":"15","age":17,"mvc_reason":"LISTED AUTO WAS OBSERVED BY POLICE TRAVELING ON THE 5100 BLOCK OF DARRAH STREET GOING THE WRONG WAY ON A ONE WAY AND TRAVEL THROUGH THE STOP SIGN. LISTED AUTO, A BLUE SCOOTER, WAS STOPPED FOR INVESTIGATION.  BMV CHECK OF THE AUTO, WAS IN GOOD STATUS. THE OPERATOR WHO WAS A JUVENILE ALSO HAD ANOTHER JUVENILE ON THE BACK. BOTH MALES STOPPED FOR INVESTIGATION. FURTHER INVESTIGATION REVEALED THE BIKE WAS A GIFT AND THE TWO MALES WERE FURTHER INSTRUCTED BY POLICE ON THE PROPER WAY TO OPERATE THE AUTO","geometry":{"type":"Point","coordinates":[-75.0776,40.0212]}},{"objectid":2020707,"districtoccur":"22","age":55,"mvc_reason":"ABOVE OBSERVED EB ON CB MOORE, MADE LEFT ONTO N BROAD STREET ALMOST STRIKING PEDESTRIANS IN THE CROSS WALK, SIGNS ARE POSTED THAT LEFT TURNS ARE PROHIBITED, NCIC/PCIC REVEAL OPERATOR DOES NOT HAVE A LICENSE.  TVRS ISSUED, BELOW PASSENGER WITH VALID LICENSE WAS GIVEN PERMISSION BY OWNER TO OPERATE VEHICLE","geometry":{"type":"Point","coordinates":[-75.1579,39.9787]}},{"objectid":2031630,"districtoccur":"06","age":30,"mvc_reason":"WHILE ON PATROL IN A MARKED RPC, WE WERE FACING SB AT THE INTERSECTION OF 8TH AND SPRUCE. WE OBSERVED THIS VEHICLE TRAVELING WB ON SPRUCE, MAKE A LEFT (SB) TURN ONTO 8TH STREET. THIS VEHICLE NARROWLY MISSED STRIKING A BICYCLIST WHO WAS IN THE BIKE LANE. VEHICLE WAS STOPPED FOR INVESTIGATION. NCIC NO WANTS, BMV VALID PA REGISTRATION. 48S SYSTEM SHOWED NO PRIOR STOPS. VEHICLE WAS CBI.","geometry":{"type":"Point","coordinates":[-75.1548,39.9457]}},{"objectid":2029559,"districtoccur":"09","age":43,"mvc_reason":"ABOVE VEHICLE WAS TURNING N/B ON BROAD ST WHILE FAILING TO YIELD FOR PEDESTRIANS. VEHICLE NEARLY MADE CONTACT WITH A PEDESTRIAN WHO WAS CROSSING THE STREET. VEHICLE WAS STOPPED, INVESTIGATED AND RELEASED WITH A VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.1652,39.9456]}},{"objectid":2032780,"districtoccur":"12","age":25,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE WITH HEAVY  TINT ON SIDE WINDOWS AND REAR WINDHSHIELD OBSTRUCTING VIEW INSIDE OF VEHICLE. VEHICLE WAS IN THE STANDING POSITION WITH HAZARDS ON AT THE CORNER OF 66TH AND CHESTER AVE BLOCKING THE CROSSWALK. POLICE INITIATED VEHICLE STOP AND MADE CONTACT WITH LISTED MALE DRIVER/OWNER. UPON APPROACH OF VEHICLE MALE WAS VISIBLY NERVOUS AND SHAKING WHEN PROVIDING PAPER WORK TO POLICE. POLICE ASKED MALE IF THERE WERE ANY WEAPONS IN VEHICLE IN WHICH HE REPLIED NO. MALE WAS","geometry":{"type":"Point","coordinates":[-75.237,39.9278]}},{"objectid":2041161,"districtoccur":"09","age":36,"mvc_reason":"OP STOPPED IN THE BIKE LANE SIGN POSTED NO STOPPING WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1662,39.9484]}},{"objectid":2040130,"districtoccur":"07","age":33,"mvc_reason":"DEFT WENT AROUND TRAFFIC THAT WAS STOPPED AT A RED SIGNAL ON THE SHOULDER WHILE TRAVELING W/B, PASSING APPROX 10 VEHICLES AT A HIGH RATE OF SPEED CAUSING A HAZARD TO OTHER MOTORISTS AND PEDESTRIANS\n\nVERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.0276,40.1018]}},{"objectid":2038299,"districtoccur":"25","age":71,"mvc_reason":"POLICE OBSERVED ABV VEHICLE TRAVELING S/B OVERTAKE MULITPLE VEHICLES AND PROCEED THROUGH STEADY RED LIGHT. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK YIELDED NEG RESULTS. OPERATOR TOLD POLICE HE THOUGHT THE COUNTDOWN CLOCK FOR THE CROSSWALK AT &QUOT;0&QUOT; WOULD SUFFICE HIS PASSING THROUGH THE LIGHT. TVR FILED, PRINTER NOT WORKING.","geometry":{"type":"Point","coordinates":[-75.1275,40.0069]}},{"objectid":2053716,"districtoccur":"25","age":23,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING EAST BOUND ON ONTARIO ST. VEHICLE DISREGARDED A STEADY RED LIGHT AT THE INTERSECTION ON 2ND AND ONTARIO. POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECKED MALE HAD AN ACTIVE WARRANT. MALE WAS ARRESTED AND TRANSPORTED TO 25TH CCTV. MALE DID NOT HAVE A DRIVERS LICENSE AND VEHICLE WAS BLOCKING THE CROSSWALK. VEHICLE WAS LIVE STOPPED TOWED LOT 6.","geometry":{"type":"Point","coordinates":[-75.1291,40.0017]}},{"objectid":2057591,"districtoccur":"06","age":50,"mvc_reason":"DISREGARDED MARKED LANE FOR BUSES AND BIKES ONLY EAST ON CHESTNUT STREET FROM 4TH","geometry":{"type":"Point","coordinates":[-75.1461,39.9486]}},{"objectid":2055342,"districtoccur":"18","age":40,"mvc_reason":"ABV MADE A UNSAFE U TURN IN THE MIDDLE OF THE ENTER SECTION NEARLY MAKING CONTACT WITH A CYCLIST IN THE BIKE LANE. WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2357,39.9571]}},{"objectid":2053182,"districtoccur":"14","age":30,"mvc_reason":"POLICE OBSERVED VEH ILLEGALLY PASS TRAFFIC ON THE RIGHT WHILE DISREGARDING RED SIGNAL.  POLICE IMMEDIATELY ACTIVIATED LIGHTS AND SIRENS AND OPER IGNORED POLICE SIGNALS REFUSING TO PULL OVER.  POLICE DEACTIVIATED LIGHTS AND DID NOT PURSUE.  VEH STOPPED FOR INVEST AT 1 E UPSAL AFTER OPER PULLED OVER TO PICK UP A PEDESTRIAN.  OPER IMMEDIATELY DETAINED DUE TO FAILURE TO OBEY POLICE COMMANDS.  TVR&APOS;S ISSUED.","geometry":{"type":"Point","coordinates":[-75.1734,40.0599]}},{"objectid":2049252,"districtoccur":"35","age":22,"mvc_reason":"POLICE OBSVD. VEHICLE STOPPED ON AN ANGLE IMPEDING THE BIKE AND PARKING LANES ON 6200 OLD YORK ROAD.  VEHICLE THAN CONTINUED TO MOVE AND MADE A RIGHT ONTO STENTON TO HEAD EB.  VEHICLE GOT INTO RIGHT TURNING LANE ONLY AND STOPPED IN THE MIDDLE BLOCKING THE FLOW OF TRAFFIC ON A GREEN LIGHT.  VEHICLE THAN CONTINUE TO MOVE TRAVELING EB THAN MADE A RIGHT TO HEAD SB.  VEHICLE HAD HEAVY WINDOW TINT MAKING IT EXTREMELY DIFFICULT FOR POLICE TO OBSERVE OPERATOR AND OR ANY OCCUPANTS INSIDE.  VEHICLE ALSO H","geometry":{"type":"Point","coordinates":[-75.1429,40.0475]}},{"objectid":2063670,"districtoccur":"01","age":42,"mvc_reason":"POLICE WERE TRAVELING S/B ON BROAD ST IN FULL UNIFORM AND MARKED RPC WHEN LISTED VEHICLE TURNED IN FRONT OF POLICE AND ANOTHER VEHICLE FAILING TO YIELD TO VEHICLES WITH RIGHT OF WAY, CAUSING HAZARDOUS CONDITIONS TO PEDESTRIANS AND OTHER MOTORISTS. PCIC/NCIC NO WANTS, TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.17,39.9231]}},{"objectid":2082903,"districtoccur":"09","age":25,"mvc_reason":"POLICE OBSERVED THE VEHICLE PARKED IN THE BIKE LANE ON 1700 SPRUCE ST, UNOCCUPIED KEYS IN THE IGNITION, DOORS UNLOCKED. POLICE OBSERVED THIS WHILE TRAVELING WESTBOUND ON SPRUCE POLICE STOPPED FOR INVESTIGATION, POLICE OBSERVED THE DRIVER OF THE VEHICLE EXIT A BUILDING ON 1700 SPRUCE, POLICE INITIATED A VEHICLE INVESTIGATION FOR A VIOLATION OF MVC 3701-A UNATTENDED MOTOR VEHICLE. NCIC/PCIC CHECK NO WANTS TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.1697,39.9476]}},{"objectid":2101526,"districtoccur":"02","age":54,"mvc_reason":"FAILURE TO YIELD TO PEDESTRIAN ON CROSSWALK","geometry":{"type":"Point","coordinates":[-75.07,40.0372]}},{"objectid":2158503,"districtoccur":"24","age":36,"mvc_reason":"POLICE OBSERVED THE BELOW VEHICLE TRAVELING NORTH BOUND AT A HIGH RATE OF SPEED AT THE LIGHT ON CASTOR AVE AND LUZERNE ST DISREGARDING PEDESTRIANS. POLICE ACTIVATED EMERGENCY LIGHTS AND SIRENS AND THE DRIVER STOPPED SHORTLY AFTER.  NCIC/PCIC NO WANTS VERBAL WARNING GIVEN. DRIVER WAS ADVISED TO SLOW DOWN.  BOTH OCCUPANTS CLEARED BY INVESTIGATION. BWC ACTIVATED.","geometry":{"type":"Point","coordinates":[-75.1007,40.0075]}},{"objectid":2166445,"districtoccur":"01","age":23,"mvc_reason":"OFFICERS FLAGGED DOWN BY PEDESTRIANS AND STATED THERE&APOS;S AN BABY INSIDE THE DEFENDANT&APOS;S VEHICLE UNATTENDED. AFTER A FEW MINUTES THE DEFENDANT RETURNED AND STATED SHE LEFT HER 2 YEAR OLD DAUGHTER IN THE VEHICLE TO WALK A FEW BLOCKS TO THE STORE. CITATION ISSUED AND DEFENDANT RELEASED WITH HER CHILD.","geometry":{"type":"Point","coordinates":[-75.1539,39.9422]}},{"objectid":2153249,"districtoccur":"18","age":25,"mvc_reason":"POLICE OBSERVED LISTED VEHHICLE TRAVELING W/ ONN 6100 LUDLOW ON THE SIDEWALK. A VEHICLE INVESTIGATION WAS CONDUCTD OWNER/OPERATOR RAN THROUGH NCIC/PCIC YIELLDING NEGATIVE WANTS. VEHICLE WAS A RENTAL. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2436,39.9615]}},{"objectid":2150271,"districtoccur":"24","age":22,"mvc_reason":"PARKING IN A CROSSWALK","geometry":{"type":"Point","coordinates":[-75.1092,39.9967]}},{"objectid":2149215,"districtoccur":"12","age":23,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE TRAVELING N/B ON THE 2400 S. 67TH ST DRIVE INTO THE BIKE LANE TO OVERTAKE VEHICLE IN FRONT OF HIM. NCIC/PCIC REVEALED A SUSPENDED PA LICENSE. VEHICLE LEAGALLY PARKED AS IT DIDN&APOS;T MEET PHILA LIVESTOP REQUIREMENTS.\nBELOW TVR&APOS;S FILED.","geometry":{"type":"Point","coordinates":[-75.2369,39.9237]}},{"objectid":2184937,"districtoccur":"14","age":21,"mvc_reason":"VEHICLE OBSERVED TRAV. S/B ON 20TH AND FAILED TO STOP AT MUTIPLE POSTED STOP SIGNS ALL THE WAY UP TO FORREST AVE. \n\nVEHICLE TRAVELING AT HIGH RATE OF SPEED THROUGH THE STOP SIGNS CAUSING NUMEROUS TRAFFIC HAZARDS FOR PEDESTRIANS AND VEHICLE&APOS;S. \nVEHHICLE STOPPED FOR INVESTIGATION AT WASHINGTON LANE. VERBAL WARNING ISSUED TO DRIVER","geometry":{"type":"Point","coordinates":[-75.1508,40.0659]}},{"objectid":2177641,"districtoccur":"09","age":20,"mvc_reason":"POLICE OBSERVED THE DRIVER SPEED OFF FROM THE INTERSECTION OF 15TH AND SANSOM ST AT A HIGH RATE OF SPEED MAKING THE TIRES SCREECH WHILE PEDESTRIANS WERE CROSSING THE STREET. DRIVER RAN THROUGH NCIC/PCIC. NEGATIVE FOR WANTS","geometry":{"type":"Point","coordinates":[-75.1658,39.9503]}},{"objectid":2190119,"districtoccur":"25","age":24,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE PARKED ON THE SIDEWALK WHILE RUNNING AND OCCUPIED 4X. POLICE HAD ALSO RESPONDED TO THE AREA FOR A VEHICLE MATCHING THIS DESCRIPTION FOR FOUR MALES WITH GUNS AND DRUGS. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC NO WANTS. OCCUPANTS ADVISED.","geometry":{"type":"Point","coordinates":[-75.1285,39.999]}},{"objectid":2192807,"districtoccur":"01","age":30,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE/DRIVER TRAVELING EAST BOUND ON 2400 WOLF ST., VEHICLE/DRIVER THEN PROCEEDED THROUGH THE INTERSECTION ALMOST STRIKING A PEDESTRIAN AND HER IN DOG IN THE CROSSWALK. NCIC/PCIC/BMV, NEGATIVE RESULTS. CBI VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1869,39.924]}},{"objectid":2192484,"districtoccur":"12","age":31,"mvc_reason":"POLICE WERE TRAVELING EASTBOUND ON 6700 NORWITCH DRIVE WHEN ABOVE VEHICLE TRAVELING EASTBOUND ON 6700 NORWITCH DR DROVE ON THE RIGHT SHOULDER INTO THE BIKE LANE AND AROUND POLICE AND THEN PROCEEDED TO DRIVE INTO ONCOMING TRAFFIC AND OVER TAKE A VEHICLE ON THE LEFT. PCIC/NCIC CHECKED. NO WANTS. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.2236,39.9143]}},{"objectid":2194067,"districtoccur":"22","age":20,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE SLAM ON BRAKES AND A MALE DRIVER EXITED THE VEHICLE AND OPENED THE BACK DOOR AND APPEARED TO BE YELLING INTO THE REAR SEAT. POLICE PULLED BEHIND VEHICLE AND THE VEHICLE THEN DROVE AT A HIGH RATE OF SPEED THROUGH A LOT LOCATED ON 25TH AND DIAMOND NARROWLY MISSING A PEDESTRIAN WALKING THROUGH. THE VEHICLE THEN DROVE THE WRONG WAY ON NORRIS TO 24TH STREET. POLICE FOLLOWED THE VEHICLE AND IT CAME TO A SUDDEN STOP AT 24TH AND TAYLOR. THE MALE DRIVER EXITED THE VEHICL","geometry":{"type":"Point","coordinates":[-75.1732,39.9848]}},{"objectid":2176877,"districtoccur":"25","age":18,"mvc_reason":"THE ABOVE VEHICLE DROVE ONTO THE SIDEWALK AS HE WAS REVERSING IN THE PARKING LOT AT THE ABOVE LOCATION. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.134,40.0204]}},{"objectid":2172067,"districtoccur":"24","age":19,"mvc_reason":"OFFICERS OBSERVED LISTED VEHICLE PARKED ON SIDEWALK ON 3400 BRADOCK ST RUNNING WITH HEAVY TINT. WHEN OFFICERS WENT TO MAKE CONTACT WITH THE INDIVIDUALS THE BACKSEAT PASSENGER EXITED THE VEHICLE AND BEGAN TO RUN N/B ON BRADOCK ST. OFFICER MARTIN LOST SIGHT OF HIM ONCE HE TURNED ON FRANKFORD AVE, FLASH WAS GIVEN OUT OVER RADIO WITH NEG RESULTS. FRONT SEAT DRIVER AND FRONT SEAT PASSENGER WERE BRIEFLY DETAINED WHEN OFFICERS CONDUCTED THE FRISK OF THE VEHICLE FOR OFFICERS SAFETY. WHEN OFFICER GALAZKA","geometry":{"type":"Point","coordinates":[-75.1062,39.9962]}},{"objectid":2171407,"districtoccur":"15","age":27,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE DO A BURNOUT AT ABOVE LOCATION ALMOST STRIKING A PEDESTRIAN. NCIC/PCIC CHECK, NO WANTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.0325,40.0315]}},{"objectid":2171876,"districtoccur":"07","age":75,"mvc_reason":"POLICE OBSERVED VEHICLE PASSING  VEHICLES ON THE RIGHT SIDE ON BIKE LANE WHEN PROHIBITED UPON IN DRIVER STATED SHE THOUGHT VEHICLE WAS TURNING AND WAS GIVEN A WARNING AT THIS TIME.","geometry":{"type":"Point","coordinates":[-75.0124,40.0992]}},{"objectid":2196049,"districtoccur":"06","age":35,"mvc_reason":"OPERATOR OBSERVED BY POLICE TRAVELING N/B ON 9TH STRET,OPERATOR FAIL TO YIELD TO PED IN CROSSWALK.","geometry":{"type":"Point","coordinates":[-75.1551,39.9514]}},{"objectid":2199140,"districtoccur":"16","age":30,"mvc_reason":"OPER WAS TRAVELING W/B ON FAIRMOUNT AVE AND DISREGARDED THE STOP SIGN ALMOST STRIKING A PEDESTRIAN IN THE CROSSWALK. OPER DID STOP AFTER PASSING CROSSWALK TO AVOID STRIKING THE PEDESTRIAN.  TVR ISSUED","geometry":{"type":"Point","coordinates":[-75.1949,39.966]}},{"objectid":2200720,"districtoccur":"24","age":44,"mvc_reason":"POLICE OBSERVED DRIVER MAKING A TURN AND NEARLY STRIKING PEDESTRIANS WHO WERE WALKING ON ALLEGHENY AVE. DRIVER SAYS HE WAS DISTRACTED BY HIS GPS. VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.1153,39.9967]}},{"objectid":2209070,"districtoccur":"24","age":33,"mvc_reason":"ABV VEH WAS STOPPED BLOCKING THE CROSSWALK WITH ANY HAZARDS LIGHTS OR ANY ACTIVITY AROUND THE VEH. W/B TRAFFIC HAD TO GO AROUND THE ABV VEH AFTER THE E/B TRAFFIC PASSES. THE VEH ALSO HAD NO TAGGED DISPLAYED. OPERATOR GIVEN A WARNING.","geometry":{"type":"Point","coordinates":[-75.1066,39.9967]}},{"objectid":2205032,"districtoccur":"18","age":18,"mvc_reason":"VEHICLE WAS OBSERVED TRAVELING NORTHBOUND ON 45TH STREET TRAVELING AT A HIGH RATE OF SPEED. VEHICLE WAS PASSING NORMAL SPEED VEHICLES AND WEAVING BETWEEN CARS.  THE 100 BLOCK OF SOUTH 45TH STREET IS A LOW LIT BLOCK WITH A HIGH PEDESTRIAN TRAFFIC WHERE CAUTION WHILE DRIVING SHOULD BE USED. VEHICLE WAS STOPPED FOR INVESTIGATION, NCIC/PCIC-NEGATIVE FOR WANTS. BMV REVEALED THE VEHICLE WAS UNREGISTERED AND A TVR WAS ISSUED TO THE OPERATOR.","geometry":{"type":"Point","coordinates":[-75.211,39.9583]}},{"objectid":2208005,"districtoccur":"05","age":68,"mvc_reason":"VEHICLE OBSERVED TRAVELLING S/B ON 6500 HENRY AVE AND PASSING TRAFFIC IN THE BIKE LANE AND MEDIAN. STOPPED FOR INVESTIGATION. NCIC/PCIC/BMV-CBI VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2142,40.0401]}},{"objectid":2210077,"districtoccur":"39","age":32,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING WEST BOUND ON ALLEGHENY ENTER THE BIKE LANE WITH NO TURN SIGNAL WHILE WAITING IN TRAFFIC AT A STEADY RED SIGNAL AND ENTER BACK ONTO WEST ALLEGHENY FROM THE BIKE LANE CUTTING OFF WESTBOUND TRAFFIC. POLICE ACTIVATED LIGHTS AND SIRENS AND CONDUCTED AN INVESTIGATION OF THE VEHICLE. NCIC/PCIC CHECKED NO WANTS. TC ISSUED TO DRIVER.","geometry":{"type":"Point","coordinates":[-75.1122,39.995]}},{"objectid":2227880,"districtoccur":"25","age":28,"mvc_reason":"THE ABOVE VEHICLE DROVE ONTO THE SHOULDER BIKE LANE TO ILLEGALLY PASS TRAFFIC ON THE RIGHT THAT WAS STOPPED FOR A RED LIGHT. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1142,40.0032]}},{"objectid":2232226,"districtoccur":"18","age":27,"mvc_reason":"POLICE OBSERVED MALE RIDING HIS BICYCLE E/B ON THE SIDEWALK AT 5200 MARKET ST. MALE STOPPED FOR INVESTIGATION. NCIC/PCIC/BMV SHOWS MALE HAS ACTIVE ARREST WARRANT OCA #817JU FOR PAROLE VIOLATION. MALE ARRESTED AND TRANSPORTED TO 18TH DISTRICT FOR PROCESSING. MALES BICYCLE TRANSPORTED TO HIS RESIDENCE AT 5232 MASTER ST PER MALES REQUEST.","geometry":{"type":"Point","coordinates":[-75.2253,39.96]}},{"objectid":2228921,"districtoccur":"12","age":27,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE TRAVELING W/B AT THE ABOVE LOCATION. UPON OBSERVATION POLICE OBSERVED THE ABOVE VEHICLES&APOS; PLATE BELONGING TO A FORD. HOWEVER THE VEHICLE IN FRONT OF POLICE WAS A TOYOTA. POLICE ALSO OBSERVED THE ABOVE VEHICLE GO TO THE SIDE OF A TROLLEY, ALMOST STRIKING TWO PEDESTRIANS AS THE TROLLEY WAS UNLOADING PEOPLE. POLICE STOPPED THE ABOVE VEHICLE FOR INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.2295,39.9289]}},{"objectid":2228643,"districtoccur":"24","age":33,"mvc_reason":"VEH OBSERVERED PASSING OTHER VEH&APOS;S FOR 2 BLOCKS IN THE BIKE LANE ALMOST STRIKING OTHER MOVING &AMP; PARKED VEH&APOS;S. NCIC CHECKED WITH NEG RESULTS. WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1291,39.9984]}},{"objectid":2231095,"districtoccur":"14","age":19,"mvc_reason":"VEHICLE OBSERVED WEST ON 100 E HERMAN AT A HIGH RATE OF SPEED NEARLY STRIKE PARKED VEHICLE, MULTIPLE PEDESTRIANS IN AREA. FEMALE ADVISED","geometry":{"type":"Point","coordinates":[-75.1775,40.0426]}},{"objectid":2229733,"districtoccur":"18","age":38,"mvc_reason":"VEHICLE WAS SEEN PARKED IN THE BIKE LANE ON THE SOUTH SIDE OF WALNUT. VEHICLE THEN ALMOST CAUSED AN ACCIDENT TRYING TO MURGE INTO TRAFFIC ON WALNUT DUE TO NOT UTILIZING A RIGHT TURNING SIGNAL. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECKED NEGATIVE RESULTS VERBAL WARNING GIVEN CBI.","geometry":{"type":"Point","coordinates":[-75.2357,39.9582]}},{"objectid":2222051,"districtoccur":"24","age":29,"mvc_reason":"PARKED WITHIN 20 FEET OF CROSSWALK","geometry":{"type":"Point","coordinates":[-75.1279,39.9952]}},{"objectid":2222410,"districtoccur":"25","age":31,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE TRAVELING E/B ON CAMBRIA ST. VEHICLE HAD HEAVY TINTED WINDOWS THROUGHOUT. THE VEHICLE FAILED TO USE THE RIGHT TURN SIGNAL PRIOR TO TURNING ONTO 2800 N 4TH STREET. THE VEHICLE PULLED ONTO THE SIDEWALK BLOCKING PEDESTRIAN TRAFFIC. POLICE ACTIVATED LIGHTS AND STOPPED THE VEHICLE FOR MVC VIOLATIONS. DURING THE VEHICLE INVESTIGATION THE OPERATOR BECAME NERVOUS WHILE COMMUNICATING WITH POLICE. POLICE REMOVED THE OPERATOR TO CONDUCT A SAFETY FRISK FOR WEAPONS. P/O KNOX","geometry":{"type":"Point","coordinates":[-75.138,39.9937]}},{"objectid":2225403,"districtoccur":"18","age":22,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICE TRAVELING WESTBOUND ON THE 5800 BLOCK OF WALNUT ST. THE VEHICLE USED THE BIKE LANE ON THE LEFT SIDE OF THE ROAD TO PASS OTHER VEHICLES. VEHICLE STOPPED FOR INVESTIGATION. DRIVER/VEHICLE RAN THROUGH NCIC/PCIC. NO WANTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2385,39.9585]}},{"objectid":2236695,"districtoccur":"08","age":18,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE PASS A TRACTOR TRAILER DRIVING NORTH BOUND ON STATE THE VEHICLE WENT INTO A DESIGNATED BIKE LANE AND PARKING LANE. POLICE ATTEMPTED TO STOP THE VEHICLE ON 9600 STATE ROAD AND IT CONTINUED TO DRIVE NORTH ON STATE INTO SALEM HARBOR. THE VEHICLE THEN STOPPED ON OLD BRIDGE ROAD AND THE OCCUPANTS ROLLED THE WINDOWS TO THE VEHICLE UP. THE VEHICLE THEN BEGAN MOVING AS IF THE PASSENGERS INSIDE THE VEHICLE WERE MOVING ALL AROUND THE CAR. THE CAR CONTINUED TO SHAKE POLICE","geometry":{"type":"Point","coordinates":[-74.9843,40.0522]}},{"objectid":2232901,"districtoccur":"19","age":25,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELLING S/B ON 5200 MARKET ST WHILE POLICE WERE IN REAR, POLICE OBSERVED LISTED VEHICLE WITH HEAVY TINT AROUND ALL VEHICLE, HEAVY TINT CAUSING A HAZORDOUS ENVIRONMENT TO PEDESTRIAN, POLICE AND THE OPERATOR DUE TO DIFFICULTIES SEEING OUT THE VEHICLE. NCIC/PCIC SHOWED NO WANTS, UPON VEHICLE INVESTIGATION OPERATOR WAS UNABLE TO SHOW PROPER OWNERSHIP OF VEHICLE, POLICE VERIFIED THE VEHICLE WITH A TITLE, POLICE ADVISED OPERATOR TO PARK VEHICLE AND POLICE GAVE VERBAL","geometry":{"type":"Point","coordinates":[-75.2253,39.96]}},{"objectid":2220631,"districtoccur":"24","age":22,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE PULL IN FRONT OF POLICE AT ABOVE LOCATION WITH DARK TINT.  POLICE WERE UNABLE TO SEE INSIDE THE VEHICLE.  THE OPERATOR IMMEDIATELY EXITED AND WALKED TO ANOTHER MALE ON THE SIDEWALK AND BEGAN TALKING.  THE TEMP TAG ON THE VEHICLE WAS COUNTERFEIT.  POLICE STOPPED ABOVE MALE AND PASSENGER FOR INVES.  POLCIE RAN VIN OVER THE AIR THROUGH BMV WHICH RETURNED IN STOLEN STATUS OCA #21-24-057332.  THE VIN MATCHED THE STOLEN VEHICLE.  POLICE DETAINED BOTH THE OPERATOR AND PASS","geometry":{"type":"Point","coordinates":[-75.1176,39.9954]}},{"objectid":2217538,"districtoccur":"12","age":54,"mvc_reason":"POLICE OBSERVED VEHICLE PARKED ON SIDEWALKING TURNED ON AND UNREGISTERED VEHICLE EXPIRATION 8/22. POLICE STOPPED FOR INVESTIGATION. PCIC/NCIC QUERY RESULTED IN NEG WANTS. POLICE ISSUED VERBAL WARNING. CBI.","geometry":{"type":"Point","coordinates":[-75.2324,39.9283]}},{"objectid":2250916,"districtoccur":"14","age":30,"mvc_reason":"VEHICLE WAS OBSERVED TRAVELING ON SHEDAKER AT A QUICK PACE BELIEVED TO BE HIGHER THAN THE POSTED SPEED MPH. THEN WHILE ON SHEDAKER ONTO RUBICAM FAILING TO COME TO A COMPLETE STOP AT THE POSTED STOP SIGN AT SHEDAKER AND RUBICAM STREETS AND AGAIN FAILING TO STOP AT RUBICAM AND STENTON AV. AS POLICE CAUGHT UP TO THE VEHICLE AND GOT BEHIND IT ON STENTON AV THE OPERATOR IMMEDIATELY BEGAN MOVING AROUND HEAVILY IN THE VEHICLE ALMOST CAUSING THE VEHICLE TO HIT THE NO PARKING POST ON THE SIDEWALK/ CURB L","geometry":{"type":"Point","coordinates":[-75.1581,40.0309]}},{"objectid":2250609,"districtoccur":"19","age":53,"mvc_reason":"POLICE OBSERVED THE SCOOTER BEING RIDDEN/DRIVEN BY MALE OPERATOR AND A SMALL BOY. THE SCOOTER WAS WEST BOUND ON VINE AT THE 6000 BLOCK DRIVING IN THE BIKE LANE PASSING TRAFFIC INCLUDING POLICE. THE SMALL BOY ON THE BACK WAS NOT WEARING PROTECTIVE HEAD GEAR AS REQUIRED BY LAW. NO WANTS OR WARRANTS. ALSO,THE SCOTTER WASNT REGISTERED SINCE 2021. VERBAL WARNINGS ONLY.  OWNER CAME TO LOCATION TO REGISTER THE SCOOTER.","geometry":{"type":"Point","coordinates":[-75.2401,39.9665]}},{"objectid":2246352,"districtoccur":"35","age":38,"mvc_reason":"DRIVER WAS OBSERVED OPERATING  VEHICLE TRAVELING WESTBOUND ON 1300 W OLNEY WHEN THE DRIVER TURNED RIGHT ONTO BROAD ST WITHOUT SIGNALING TURN CAUSING A HAZARD TO OTHERS. THIS AREA IS HEAVY WITH PEDESTRIAN TRAFFIC DUE TO THE TRANSPORTATION CENTER AND MULTIPLE SHOPS. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1429,40.0386]}},{"objectid":2244970,"districtoccur":"35","age":36,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING SOUTHBOUND ON 10TH ST DISREGARD THE STOP SIGN AT LOUDON ST. WHEN POLICE TURNED AROUND THE VEHICLE DROVE ONTO THE SIDEWALK CREATING A HAZARD. VEHICLE WAS LATER OBSERVED TRAVELING SOUTHBOUND ON 5TH ST AND PULLED OVER UPON SIGNAL. VEBRAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1332,40.0244]}},{"objectid":2245080,"districtoccur":"19","age":39,"mvc_reason":"POLICE OBSERVED MALE TRAVELING EASTBOUND ON LANSDOWNE AVE., IMPROPERLY PASS TRAFFIC WAITING AT A STEADY RIGHT LIGHT AND FOR THE CITY TRASH TRUCK TO MOVE OVER BY GOING INTO THE WESTBOUND LANE.  BY DOING SO MALE ALMOST HIT PEDESTRIAN CROSSING THE STREET IN THE WESTBOUND LANE. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2355,39.9764]}},{"objectid":2241701,"districtoccur":"25","age":29,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE PARKED ON THE SOUTHEAST CORNER OF RORER AND WESTMORELAND STS. VEHICLE WAS COMPLETELY BLOCKING THE CROSSWALK. POLICE RAN THE TAG AND THE VEHICLE HAD AN EXPIRED REGISTRATION. VEHICLE REVERSED AND DROVE S/B ON RORER ST AND THEN PARKED NEXT TO A FIRE HYDRANT. POLICE STOPPED VEHICLE FOR MVC VIOLATION. NCIC/PCIC ON THE VEHICLE WITH NO WANTS. MALE OPERATOR TOLD POLICE THAT HE HAD A PERMIT TO CARRY A FIREARM AND THAT HE HAD HIS FIREARM IN HIS FRONT WAISTBAND. P.O RAMUNO REC","geometry":{"type":"Point","coordinates":[-75.121,39.9984]}},{"objectid":2261464,"districtoccur":"35","age":20,"mvc_reason":"WORKING IN FULL UNIFORM IN A MARKED POLICE VEHICLE AND TRAVELLING NB ON 2ND ST APPROACHING DUNCANNON AVE. POLICE OBSERVED THE LISTED VEHICLE DOING DONUTS IN THE CENTER OF THE INTERSECTION IN THE RAIN WITH OTHER VEHICLES AND PEDESTRIANS PRESENT SHOWING A CARELESS DISREGARD FOR PERSONS AND PROPERTY. POLICE STOPPED THE VEHICLE AT THE LISTED LOCATION FOR INVESTIGATION. NCIC/PCIC RETURNED NO WANTS ON THE OCCUPANTS OR VIN. TVR ISSUED FOR CARELESS DRIVING.","geometry":{"type":"Point","coordinates":[-75.1269,40.0296]}},{"objectid":2267325,"districtoccur":"09","age":32,"mvc_reason":"VEHICLE OBSERVED DRIVING ON THE BIKE LANE WHILE TRAVELING W/B ON SPRUCE ST. AT 16 STREET. CBI WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1682,39.9474]}},{"objectid":2270307,"districtoccur":"18","age":23,"mvc_reason":"OPERATOR OBSERVED TRAVELING SOUTH ON 39TH ST IN THE ONCOMING N/B LANE WITH TOTAL DISREGARD FOR PEDESTRIAN SAFETY AND  RIGHT OF WAY TRAFFIC. POLICE STOPPED S/B ON 39TH ST @ WALNUT ST AT LIGHT. OPERATOR INFORMED CITATION TO BE FILED.","geometry":{"type":"Point","coordinates":[-75.2014,39.9539]}},{"objectid":2270691,"districtoccur":"35","age":49,"mvc_reason":"DRIVER OF ABOVE VEHICLE OBSERVED WB ON NEDRO AV. AND NB ON 2ND ST. AT A HIGH RATE OF SPEED, BYPASS SEVERAL DOUBLE PARKED VEHICLES, NEARLY STRIKING TWO OF THEM. DRIVER STOPPED HALFWAY IN THE CROSSWALK OF 200 W CHAMPLOST AV. WHILE STOPPED AT THE RED LIGHT. DRIVER STOPPED AND A RECORDS CHECK WAS NEGATIVE. MALE STATED HE WAS A MECHANIC AND WAS TEST DRIVING A CAR THAT HE WAS REPAIRING. WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1241,40.0419]}},{"objectid":2270117,"districtoccur":"25","age":25,"mvc_reason":"ABOVE MALE WAS OPERATING VEHICLE WITH HEAVILY TINTED WINDOWS AND PARKED ON THE CORNER OF E AND ONTARIO STREET FACING NORTH COMPLETELY BLOCKING THE CROSSWALK, POLICE EXIT VEHICLE TO CONDUCT CARSTOP AND MALE ATTEMPTED TO FLEE ON FOOT PUSHING PAST OFFICERS, MALE HAD TO BE TAKEN TO THE GROUND DURING INCIDENT, RECOVERED FROM UNDERNEATH THE PASSENGER SEAT WAS 2 LOADED MAGAZINES AND A 9MM GLOCK 17 WITH AN EXTENDED MAGAZINE LOADED, REFER TO PHILADELPHIA PROPERTY RECEIPT FOR FURTHER INFORMATION, MALE DOE","geometry":{"type":"Point","coordinates":[-75.119,39.9991]}},{"objectid":2274058,"districtoccur":"39","age":26,"mvc_reason":"POLICE OBSERVED THE LISTED VEH TRAVELING EB ON QUEEN LN WITH ILLEGAL SUN SCREENING PREVENTING POLICE FROM IDENTIFYING THE NUMBER OF OCCUPANTS IN THE VEH. THE VEH WAS ALSO OBSERVED TRAVELING AT A HIGH RATE OF SPEED WITHOUT REGARD FOR PEDESTRIANS OR OTHER TRAFFIC. THE VEH WAS STOPPED FOR INVEST, NCIC/PCIC NEG RESULTS, THE VEH WAS CBI","geometry":{"type":"Point","coordinates":[-75.1704,40.03]}},{"objectid":2289106,"districtoccur":"18","age":18,"mvc_reason":"POLICE OBSERVED VEHICLE PARKED AT 58TH AND BALTIMORE LEAVE PARKING SPOT WITHOUT USING A TURN SIGNAL AND CAUSING A DISTURBANCE WITH PEDESTRIAN CROSSING. POLICE ACTIVATED LIGHTS WHERE VEHICLE STOPPED PROMPTLY. DRIVER WAS COOPERATIVE. NCIC PCIC GOT NEG RESULTS. RELEASED WITH WARNING","geometry":{"type":"Point","coordinates":[-75.2398,39.9473]}},{"objectid":2288505,"districtoccur":"12","age":26,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING N/B ON S 51ST STREET ATTEMPT TO MAKE A RIGHT TURN E/B ON WILLOWS AVE FAILING TO YIELD TO PEDESTRIANS. LISTED VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC YIELDS NO WANTS. VERBAL WARNING ISSUED","geometry":{"type":"Point","coordinates":[-75.2229,39.9456]}},{"objectid":2284805,"districtoccur":"18","age":31,"mvc_reason":"POLICE OBSERVED VEHICLE DISREGARD A RED LIGHT AT 51ST AND CHESTNUT THEN PROCEED TO DRIVE AT A HIGH RATE OF SPEED IN THE BIKE LANE ON CHESTNUT STREET. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC NEGATIVE RESULTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2214,39.9579]}},{"objectid":2284202,"districtoccur":"17","age":21,"mvc_reason":"POL OBS MALE RIDING LISTED E BIKE SOUTHBOUND ON THE 1300 BLOCK OF S. 17TH ST. WHEN THE RIDER DISREGARDED THE CLEARLY POSTED STOP SIGN AT THE INTERSECTION OF 17TH AND REED ST.  STOPPED FOR MVC 3323B.  NCIC/PCIC WITH NO RESULTS.  MALE IS FROM ALGERIA AND HAS NO STATE ID.  VERBAL WARNING ONLY.  BWC.","geometry":{"type":"Point","coordinates":[-75.1725,39.9347]}},{"objectid":2284621,"districtoccur":"16","age":37,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING WEST ON ASPEN WITH DEFECTIVE DRIVERS SIDE HEAD LIGHT AND REAR MIDDLE BRAKE LIGHT IN VIOLATION OF 4303-B.NCIC / PCIC NEG RESULTS BMV DISPLAYED OPERATOR UNLICENSED. WHILE CONDUCTING VEHICLE INVESTIGATION ABOVE PEDESTRIAN APPROACHED POLICE AND IDENTIFIED HERSELF AS OPERATORS SISTER AND STATED SHE WOULD TAKE CONTROL OF THE VEHICLE. BMV DISPLAYED VALID DRIVERS LICENSE. VERBAL WARNING GIVEN AND RELEASED WITHOUT INCIDENT.","geometry":{"type":"Point","coordinates":[-75.2004,39.9665]}},{"objectid":2284322,"districtoccur":"18","age":25,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED BLOCKING THE CROSSWALK AT THE INTERSECTION OF 58TH ST. / CATHERINE ST. THE VEHICLE WAS PROHIBITING PEDESTRIANS FROM USING THE CROSSWALK. ALSO, THE VEHICLE HAD WINDOW TINT ON ALL WINDOWS OF THE VEHICLE MAKING IT DIFFICULT FOR POLICE TO SEE INSIDE THE VEHICLE. POLICE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK, NO WANTS. \nLISTED TCS ISSUED FOR VIOLATIONS 3353 A1IV PROHIBITIONS IN SPECIFIED PLACES AND 4524B WINDSHIELD OBSTRUCTIONS AND WIPERS.","geometry":{"type":"Point","coordinates":[-75.2393,39.9504]}},{"objectid":2293296,"districtoccur":"09","age":27,"mvc_reason":"ABOVE OPERATOR WAS TRAVELING EAST ON CHESTNUT ST IN BIKE AND BUS ONLY LANE LANE IS MARKED BY SIGNS ON POLLS AS WELL AS IN WHITE WRITING ON THE HIGHWAY","geometry":{"type":"Point","coordinates":[-75.1705,39.9516]}},{"objectid":2294002,"districtoccur":"16","age":29,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING WESTBOUND FROM THE ABOVE LOCATION. VEHICLE USED THE SHOULDER LANE AND BIKE LANE TO GO AROUND A VEHICLE TRAVELING WESTBOUND. NCIC/PCIC CHECK NO WANTS. CBI","geometry":{"type":"Point","coordinates":[-75.2163,39.9717]}},{"objectid":2294364,"districtoccur":"18","age":29,"mvc_reason":"VEHICLE  WAS OBSERVED BY POLICE USING THE RIGHT SHOULDER (NON TRAVEL LANE) TO PROCEED AROUND TWO VEHICLES STOPPED AT THE STEADY RED SIGNAL ON E/B BALTIMORE AT 44TH STREET. THE VEHICLE THEN PROCEEDED THROUGH THE SAME RED SIGNAL AND CONTINUED E/B ON BALTIMORE. THESE ACTIONS WERE PERFORMED WHILE A LARGE EVENT WAS BEING HOSTED IN CLARK PARK WITH HUNDREDS OF PEDESTRIANS PRESENT. POLICE STOPPED THE VEHICLE FOR INVESTIGATION. NCIC/PCIC/BMV, NO WANTS. MALE OPERATOR ISSUED A TVR AND RELEASED.","geometry":{"type":"Point","coordinates":[-75.2115,39.9492]}},{"objectid":2293658,"districtoccur":"16","age":39,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING WESTBOUND ON LANCASTER AVE, MAKE A LEFT TURN ONTO WYALUSING AVE TO GO WESTBOUND DISREGARD THE PEDESTRIAN WALKING ACROSS THE STREET AND PUSHING A STROLLER. NCIC/PCIC CHECK DONE WITH NEGATIVE RESULTS FOR WANTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2163,39.9717]}},{"objectid":2278082,"districtoccur":"06","age":51,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE WITH HEAVY DARK TINTED WINDOWS ILLEGALLY PARKED ON THE SIDEWALK RUNNING AT ABOVE LOCATION. VEHICLE STOPPED FOR INVESTIGATION. POLICE RAN OPERATOR THROUGH NCIC/PCIC NO WANTS VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1517,39.963]}},{"objectid":2278086,"districtoccur":"06","age":51,"mvc_reason":"DRIVING ON THE SIDEWALK","geometry":{"type":"Point","coordinates":[-75.1517,39.963]}},{"objectid":2276462,"districtoccur":"35","age":19,"mvc_reason":"POLICE OBS ABV VEH E/B ON STENTON CROSS OVER A BIKE LANE INTO A TURNING WITHOUT ANY SIGNAL. NCIC/PCIC-NO WANTS. VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.1438,40.0479]}},{"objectid":2274750,"districtoccur":"39","age":25,"mvc_reason":"POLICE OBSERVED THE LISTED VEH TRAVELING EB ON QUEEN LN WITH ILLEGAL SUN SCREENING PREVENTING POLICE FROM IDENTIFYING THE NUMBER OF OCCUPANTS IN THE VEH. THE VEH WAS ALSO OBSERVED TRAVELING AT A HIGH RATE OF SPEED WITHOUT REGARD FOR PEDESTRIANS OR OTHER TRAFFIC. THE VEH WAS STOPPED FOR INVEST, NCIC/PCIC NEG RESULTS, THE VEH WAS CBI","geometry":{"type":"Point","coordinates":[-75.1704,40.03]}},{"objectid":2276471,"districtoccur":"35","age":61,"mvc_reason":"DRIVER WAS OBSERVED OPERATING VEHICLE TRAVELING EASTBOUND ON STENTON AV USE THE  BIKE LANE TO PASS SEVERAL OTHER VEHICLES INCLUDING A MARKED PATROL CAR ON THE RIGHT. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1438,40.0479]}},{"objectid":2276474,"districtoccur":"35","age":19,"mvc_reason":"POLICE OBS ABV VEH E/B ON STENTON CROSS OVER A BIKE LANE INTO A TURNING WITHOUT ANY SIGNAL. NCIC/PCIC-NO WANTS. VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.1438,40.0479]}},{"objectid":2313394,"districtoccur":"08","age":41,"mvc_reason":"VEHICLE OBSERVED TRAVELING N/B ON TORRESDALE PASSING OTHER VEHICLES ON THE RIGHT ON THE BIKE LANE. NCIC/PCIC NO WANTS. TVR FILED.","geometry":{"type":"Point","coordinates":[-75.0114,40.0497]}},{"objectid":2303197,"districtoccur":"22","age":17,"mvc_reason":"LISTED VEHICLE OBSERVED ATTEMPTING TO PARK ON SIDEWALK OPERATING VEHICLE WITH EXTREME HEAVY DARK WINDOW TINT.","geometry":{"type":"Point","coordinates":[-75.1297,39.9818]}},{"objectid":2305410,"districtoccur":"15","age":63,"mvc_reason":"VEH OBSERVED DRIVING IN THE SIDEWALK AT THE LISTD LOCATION. MALE STATED HE WAS JUST UNLOADING A A/C UNIT INTO THE PROPERTY ON THE CORNER, CBI","geometry":{"type":"Point","coordinates":[-75.043,40.0328]}},{"objectid":2306484,"districtoccur":"09","age":36,"mvc_reason":"ABOVE OPERATOR WAS OBSERVED TRAVELING IN RIGHT HAND LANE WHICH IS MARKED BY SIGNS AND ON HIGHWAY BIKE AND BUS ONLY VEH WAS STOPPED FOR INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":2306504,"districtoccur":"09","age":63,"mvc_reason":"OPERATOR WAS OBSERVED DRIVING IN BIKE AND BUS ONLY LANE WHICH IS MARKED BY SIGNS AND ON HIGHWAY IN WHITE WRITING.","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":2305806,"districtoccur":"09","age":67,"mvc_reason":"OPERATOR WAS TRAVELING EAST ON CHESTNUT ST IN BIKE AND BUS ONLY LANE LANE IS MARKED BY SIGNS AND IN WHITE WRITING ON HIGHWAY","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":2307267,"districtoccur":"15","age":18,"mvc_reason":"POLICE OBSERVED THE ABOVE LISTED VEHICLE TRAVELING N/B ON FRANKFORD AVE. MAKE A RIGHT HAND TURN TRAVELING E/B. WHICH IS A ONE WAY STREET FOR W/B TRAFFIC.  THE VEHICLE ALSO FAILED TO YIELD FOR PEDESTRIANS CROSSING THE STREET. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.0483,40.0326]}},{"objectid":2313858,"districtoccur":"19","age":25,"mvc_reason":"POLICE WERE TRAVELLING W/B ON 5901 MARKET ST WHILE LISTED VEHEICLE WAS AHEAD WHEN POLICE OBSERVED ISTED VEHICLE FAILING TO MAINTAIN A SINGLE LANE, LISTED VEHICLE KEPT CROSSING OVER TO THE BIKE LANE. VEHICLE INVESTIGATION WAS CONDUCTED NCIC/PCIC CHECK SHOWED NO WANTS VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2389,39.9617]}},{"objectid":2315299,"districtoccur":"18","age":22,"mvc_reason":"POLICE OBSERVED LISTED SCOOTER TRAVELING S/B ON 60TH ST WHEN THE SCOOTER DISREGARDED A STOP SIGN CUTTING OFF OTHER TRAFFIC AND CAME OFF OF THE LANE OF TRAVEL AND BEGAN DRIVING ON THE SIDEWALK AND MATCHED THE FLASH DESCRIPTION FOR A THEFT IN PROGRESS WHICH WAS 3 BLACK MALES IN HOODIES RIDING STOLEN SCOOTERS IN THE AREA WHICH WERE WHITE, RED, AND BLACK IN COLOR (DC 22-18-049060). . POLICE ATTEMPTED TO STOP THE SCOOTER BUT THE OPERATOR DID NOT STOP FOR POLICE. POLICE OBSERVED THE OPERATOR DROP THE","geometry":{"type":"Point","coordinates":[-75.2454,39.9504]}},{"objectid":2299912,"districtoccur":"03","age":22,"mvc_reason":"P/O HARPER #6941 WAS OUT OF HIS VEHICLE HELPING PEDESTRIANS CROSS THE STREET BY UTILIZING THE POSTED WESTSIDE CROSSWALK LOCATED ON 1300 PATTISON AVENUE; WHEN POLICE OBSERVED A WHITE STATION WAGON DRIVING WESTBOUND IN THE RIGHT LANE AT A HIGH RATE OF  SPEED THAT THE PEOPLE IN THE CROSSWALK HURRIED OUT OF THE STREET IN FEAR OF BEING HIT BY ABOVE. POLICE HOLLERED YO IN A LOUD VOICE. \n\n\nP/O HARPER #6941 ABOVE LISTED VEHICLE STOPPED ABOVE LISTED VEHICLE NORTHBOUND AT BROAD AND HARTRANFT STREET. A REC","geometry":{"type":"Point","coordinates":[-75.1695,39.9048]}},{"objectid":2301491,"districtoccur":"26","age":37,"mvc_reason":"POLICE OBSERVED OPERATOR TRAVELING E/B AT 400 W DIAMOND ST WITH EXPIRED INSPECTION AND EMISSION STICKERS. OPERATOR UNLICENSED DRIVER. TVR&APOS;S FILED TO OWNER AND OPERATOR OF VEHICLE. VEHICLE WAS NOT LIVESTOP DUE TO EXTREME HEAT AND CHILDREN INSIDE VEHICLE. PEDESTRIAN/ FAMILY MEMBER 22-26-027280 CAME TO LOCATION AND PROVIDED A VALID LICENSE.","geometry":{"type":"Point","coordinates":[-75.1405,39.9826]}},{"objectid":2301861,"districtoccur":"03","age":36,"mvc_reason":"VEHICLE OBSERVED IN OPERATION WITH EXPIRED PAPER TEMP TAG (9/25/2022), MAKING  IT UNREGISTERED. UPON INVEST, OPERATOR UNLICENSED. LISTED PEDESTRIAN WAS CHECKED FOR A VALID MD LICENSE AND PERMITTED TO OPERATE VEHICLE AND PARK IT NEARBY LEGALLY. OPERATOR ADVIDES TO PROPERLY REGISTER VEHICLE. WARNINGS ISSUED. BWC ACTIVE.","geometry":{"type":"Point","coordinates":[-75.1591,39.9191]}},{"objectid":2322162,"districtoccur":"06","age":35,"mvc_reason":"TRAVELING IN LANE MARKED BIKES ONLY","geometry":{"type":"Point","coordinates":[-75.1579,39.9612]}},{"objectid":2323635,"districtoccur":"03","age":38,"mvc_reason":"ON LISTED DATE AND TIME WHILE WORKING IN FULL UNIFORM OPERATING RPC 314 POLICE OBSERVED LISTED VEHICLE TRAVELING E/B ON SNYDER AV WHEN VEHICLE THEN PROCEEDED TO GET INTO THE W/B TRAFFIC LANE GOING AROUND CARS AND SEPTA BUS WITH EXITING PASSENGERS. POLICE FELT THAT THIS VEHICLE WAS NOT ONLY PUTTING THEMSELVES IN DANGER, BUT ALSO SURROUNDING PEDESTRIANS/DRIVERS. AT THIS TIME POLICE ACTIVATED OVERHEAD LIGHTS AND STOPPED THIS VEHICLE FOR INVESTIGATION. POLICE RAN BOTH VEHICLE/ DRIVER THROUGH NCIC/PC","geometry":{"type":"Point","coordinates":[-75.1514,39.922]}},{"objectid":2323019,"districtoccur":"18","age":53,"mvc_reason":"ABV VEH WAS DRIVING ON THE SIDEWALK ON 4200 CHESTER. VEH STOPPED FOR AN INVESTIGATION. DRIVER STATED HE WORKED AT THEHEALTH CENTER AND PULLS IN THE CUT OF BUILDING. NCIC/PCIC CHECK OK. MALE CBI.","geometry":{"type":"Point","coordinates":[-75.2073,39.9484]}},{"objectid":2326444,"districtoccur":"22","age":20,"mvc_reason":"VEHICLE WAS SEEN SOUTH ON BROAD STREET, WHERE I WITNESSED A CONSISTANT PATTERN WHERE THE OPERATOR  WAS SWITCHING LANES AGGRESSIVELY AND RAISING HIS SPEED. BROAD STREET IS A HEAVILY TRAVELED THOROUGHFARE THROUGHOUT THE CITY OF PHILADELPHIA. IT IS HEAVY IN BOTH VEHICLE AND PEDESTRIAN TRAFFIC. VEHICLE WAS PULLED OVER FOR INVESTIGATION. DRIVER CLAIMS TO BE &QUOT;IN A HURRY TO GET HOME&QUOT;.","geometry":{"type":"Point","coordinates":[-75.1556,39.9895]}},{"objectid":2331150,"districtoccur":"18","age":37,"mvc_reason":"VEHICLE WAS SEEN TRAVELING AT A HIGH RATE OF SPEED, NORTH IN THE CENTER TURNING LANE ON 52ND ST TO AVOID TRAFFIC. BOTH VEHICLE AND PEDESTRIAN TRAFFIC IS BUSY AT THIS TIME AND THE VEHICLE CAUSED A HAZARD TO BOTH ENTITIES. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECKED NEGATIVE RESULTS. VERBAL WARNING GIVEN CBI.","geometry":{"type":"Point","coordinates":[-75.2261,39.9545]}},{"objectid":2347577,"districtoccur":"39","age":16,"mvc_reason":"VEHICLE OBSERVED WITH SUNSCREEN PROHIBITED ON ALL WINDOWS. NCIC/PCIC CHECK, VEHICLE CAME BACK TO A MERCURY (2964 BAMBREY ST) POLICE ATTEMPTED TO STOP THE VEHICLE AT 23RD AND DIAMOND WHEN VEHICLE SPED AT A HIGH RATE OF SPEED DISREGARDING NUMEROUS RED LIGHTS WITH NO REGARD FOR OTHER VEHICLES OR PEDESTRIANS. POLICE WENT BACK TO WHERE THE VEHICLE LICENSE PLATE CAME BACK TO AND LATER LOCATED THE VEHICLE TRAVELING ON INDIANA NEAR BAMBREY. VEHICLE WAS STOPPED WITHOUT INCIDENT AT THIS LOCATION. MALE OPE","geometry":{"type":"Point","coordinates":[-75.1727,39.9995]}},{"objectid":2350491,"districtoccur":"06","age":29,"mvc_reason":"ABOVE VEHICLE WAS TRAVELING NORTH BOUND ON 1TH AND WAS IN THE BIKE LANE. NCIC/PCIC NO WANTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1559,39.9629]}},{"objectid":2344220,"districtoccur":"39","age":44,"mvc_reason":"POLICE OBSERVE ABOVE VEHICLE TRAVELING CARELESSLY AT AHIGH RATE OF SPEED ALMOST STRIKING PEDESTRIANS, POLICE STOP VEHICLE FOR INVESTIGATION. OPERATOR STATES HE WAS LATE PICKING UP HIS DAUGHTER. VEHICLE RAN NCIC/PCIC, NO WANTS, CBI","geometry":{"type":"Point","coordinates":[-75.1657,39.9985]}},{"objectid":2343104,"districtoccur":"39","age":21,"mvc_reason":"POLICE OBSERVE ABOVE VEHICLE TRAVELING S/B ON THE 2800 BLOCK OF 26TH ST WITHOUT ITS HEAD LIGHTS ON FURTHER BECOMING A SAFETY HAZARDS FOR PEDESTRIANS AND OTHER PASSERBYS. POLICE STOP VEHICLE FOR INVESTIGATION, ADVISE OPERATOR. OCCUPANTS AND VEHICLE RAN NCIC/PCIC, NO WANTS. CBI","geometry":{"type":"Point","coordinates":[-75.1722,39.9978]}},{"objectid":2341028,"districtoccur":"03","age":40,"mvc_reason":"S/B S. BROAD ST AT REED, DICKINSON, TASKER, MORRIS, AND MOORE ST VEHICLE FAILED TO COME TOP A COMPLETE STOP AT A STEADY RED SIGNAL AS THE VEHICLE PASSED THE SOLID WHITE LINE AND CROSSWALKS STOPPING IN THE MIDDLE OF THE INTERSECTIONS. VERBAL WARNING AND ADVISED.","geometry":{"type":"Point","coordinates":[-75.1683,39.9303]}},{"objectid":2353060,"districtoccur":"06","age":37,"mvc_reason":"POLICE OBSERVED THE ABV VEH TRAVELING N/B ON 3 RD STREET JUST BEFORE BROWN STREET. VEH DID NOT COME TO A COMPLETE STOP AT STOP SIGN ALSO DID NOT YIELD TO PEDESTRIAN TRAFFIC CROSSING IN MARKED CROSS WALK. VEH STOPPED AT 900 N 3RD STREET FOR INVESTIGATION. VEH CLEARS NCIC/PCIC CHECK HOWEVER BOTH DRIVER AND PASSENGER HAVE SUSPENDED LICENSES. POLICE ISSUED TICKET FOR SUSPENDED LICENSE TO DRIVER. 3RD PERSON CALLED TO AREA TO CONTINUE DRIVING VEH BY DRIVER.","geometry":{"type":"Point","coordinates":[-75.1431,39.9625]}},{"objectid":2359391,"districtoccur":"25","age":42,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED ON THE SIDE WALK BLOCKING PEDISTRIANS FROM WALKING ON SIDEWALK. POLICE OBSERVED OCCUPANTS INSIDE VEHICLE POLICE STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC CHECKED. OPERATOR HAD TWO ACTIVE WARRANTS FROM BUCKS COUNTY. OCA #CPCMS703339060 AND CPCMS703370557. MALE WAS ARRESTED AND TRANSPORTED TO 25TH CCTV FOR PROCESSING.","geometry":{"type":"Point","coordinates":[-75.1415,40.0035]}},{"objectid":2356821,"districtoccur":"19","age":40,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING N/B ON 1500 N 52 ON THE SIDEWALK FOR AN ENTIRE BLOCK. PCIC/NCIC CHECK NO WANTS. UPON POLICE APPROACH POLICE NOTICED THE FEMALE WAS SLURRING HER WORDS. SHE ALSO KEPT REFERRING TO THE MALE OFFICER AS A FEMALE. THE VEHICLE HAD A STONG ODOR OF WHAT POLICE BELEIEVED THE BE PCP. THE FEMALE WAS ALSO OBSERVED TALKING TO HERSLEF. POLICE CALLED FOR A SOBRIETY TRAINED OFFICER TO CONDUCT A FIELD SOBRIETY TEST ON HER. POLICE OFFICER JORDAN # 3799 ARRIVED . UPON HI","geometry":{"type":"Point","coordinates":[-75.2268,39.9773]}},{"objectid":2357489,"districtoccur":"25","age":28,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE DRIVE OVER THE SIDEWALK AND OVER THE GRASS FROM 1000 W LYCOMING ST TO ENTER THE PARK. PARK GATE WAS LOCKED AND CLOSED PREVIOUSLY AT 1000 W LYCOMING ST. VEHICLE STOPPED FOR INVESTIGATION, RECORDS/WANTS CHECK CONDUCTED ON OPERATOR AND (2) PASSENGERS WITH NEGATIVE RESULTS. OPERATOR ISSUED VERBAL WARNING ONLY.","geometry":{"type":"Point","coordinates":[-75.1447,40.0141]}},{"objectid":2392694,"districtoccur":"12","age":53,"mvc_reason":"ABOVE VEHICLE WAS OBSERVED GOING INTO THE BIKE LANE ON THE E/B LANE OF 7200 LINDBERGH BLVD. THE VEHICLE THE WENT AROUND SEVERAL CARS WAITING AT A SOLID RED LIGHT AND PROCEDED TO GO INTO THE MIDDLE OF THE INTRSECTION THEN GO THROUGH HE RED LIGHT. NCIC/PCIC CHECK NEG RES. BMV CHECK NEG RES. VEHICLE AND OPERATOR CBI. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.2329,39.9089]}},{"objectid":2410460,"districtoccur":"19","age":31,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE WESTBOUND ON HAVERFORD BEFORE TURNING NORTHBOUND ONTO THE 400 BLOCK OF SICKLES.VEHICLE FAILED TO USE TURN SIGNAL BEFORE TRUNING UNTO THE BLOCK AND PARKED ON THE SIDEWALK WHEN POLICE WAS BEHIND HIM.POLICE STOPPED VEHICLE FOR INVESTIGATION.NCIC/PCIC SHOWED NEGATIVE RESULTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2291,39.9667]}},{"objectid":2417739,"districtoccur":"25","age":30,"mvc_reason":"POLICE OBSERVED THE VEHICLE TRAVELING EASTBOUND AT THE ABOVE LOCATION TRAVELING AT A HIGH RATE OF SPEED. THE VEHICLE MADE A QUICK, DRIFT LIKE, LEFT TURN CROSSING DOUBLE YELLOW LINES AND PARKING ONTO THE SIDEWALK. PCIC/NCIC NO WANTS VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1445,40.0083]}},{"objectid":2405182,"districtoccur":"24","age":42,"mvc_reason":"P/O CAIN BACKED UP G32 ON A ATV STOP AT ABOVE LOCATION. ATV WAS OBSERVED DRIVING ON THE STREET AT ABOVE LOCATION. PVR ISSUED ON BIKE, 49210192-8","geometry":{"type":"Point","coordinates":[-75.1029,40.0069]}},{"objectid":2441152,"districtoccur":"35","age":27,"mvc_reason":"DIRVER OBSERVED OPERATING VEHICLE TRAVELING EASTBOUND ON GODFREY AV USING THE RIGHT SHOULDER/BIKE LANE TO OVERTAKE ANOTHER FORWARD MOVING VEHICLE. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1408,40.0473]}},{"objectid":2458387,"districtoccur":"19","age":26,"mvc_reason":"DRIVER MADE TURN ONTO 52ND STREET FROM HAVERFORD AVE FAILED TO YIELD TO POLICE CAR GOING STRAIGHT AND WAS CLOSE TO HITTING A PEDESTRIAN. VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.2246,39.9649]}},{"objectid":2451268,"districtoccur":"18","age":28,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING W/B ON 6000 IRVING ST WHEN THE OPERATOR ATTEMPTED TO PARK THE VEHICLE HALFWAY ON THE SIDEWALK AND HALFWAY ON THE STREET BLOCKING PEDESTRIAN TRAFFIC AND MAKING IT DIFFICULT TO PASS ON THE ROADWAY. POLICE STOPPED VEHICLE FOR INVESTIGATION. UPON SPEAKING TO THE OPERATOR POLICE OBSERVED THE HANDLE OF A FIREARM IN HIS RIGHT LEG CARGO PANT POCKET. POLICE RECOVERED A GLOCK 26 9MM SERIAL #EVL190US FROM THE POCKET AND THE MALE STATED HE DID NOT HAVE A PERMIT TO CA","geometry":{"type":"Point","coordinates":[-75.2418,39.9572]}},{"objectid":2484126,"districtoccur":"06","age":71,"mvc_reason":"DRIVING IN BIKE LANE","geometry":{"type":"Point","coordinates":[-75.1606,39.9562]}},{"objectid":2481905,"districtoccur":"22","age":28,"mvc_reason":"DRIVER OPERATED VEHICLE WEST ON GLENWOOD AND FAILED TO STOP PROPERLY AT A STEADY RED SIGNAL. VEHICLE WAS BLOCKING PEDESTRIAN CROSSWALK AND INTO THE INTERSECTION. VEHICLE ALSO HAD TINTED WINDOWS, UNABLE TO SEE DRIVER FROM A REASONABLE DISTANCE. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1816,39.9833]}},{"objectid":2473572,"districtoccur":"07","age":63,"mvc_reason":"DEF MADE LEFT TURN FROM PLAZA DRIVE, BEFORE ROOSEVELT BLVD ,TO 11500 BLVD USING SIDEWALK INSTEAD OF GOING AROUND THE BLVD. DEF GIVEN VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.006,40.1014]}},{"objectid":2494106,"districtoccur":"17","age":29,"mvc_reason":"POLICE OBSERVED ABV FEMALE OPERATING VEHICLE DISREGARD STOP SIGN AT ABV LOCATION. PER NCIC/PCIC, FEMALE DOES NOT POSSES A VALID LICENSE. MOM (PEDESTRIAN #3) CAME TO THE LOCATION WITH A VALID LICENSE AND DROVE THE VEHICLE AWAY BECAUSE OF THE DRIVERS 3 MONTH OLD BABY IN THE VEHICLE. VEHICLE RELEASED TO MOM.","geometry":{"type":"Point","coordinates":[-75.191,39.9346]}},{"objectid":2524744,"districtoccur":"39","age":20,"mvc_reason":"ALL EXTERIOR FORWARD AND REARWARD FACING LAMPS WERE NOT ACTIVATED, AS REQUIRED PER STATE LAW, SINCE IT WAS CURRENTLY A PERIOD OF REQUIRED LIGHTING. THE PERIOD I AM REFERRING TO WAS NIGHTFALL. THIS IS A HAZARD TO OTHER MOTORISTS (INCLUDING THIS OPERATOR), AS WELL AS PEDESTRIANS WHO MAY BE WALKING INTO THE ROADWAY, AS THIS CAR MAY NOT BE SEEN AT A REASONABLE DISTANCE.","geometry":{"type":"Point","coordinates":[-75.1682,40.0004]}},{"objectid":2519215,"districtoccur":"02","age":36,"mvc_reason":"POLICE OBSERVED ABOVE DRIVER OF ABOVE VEHICLE DISREGARD THE STOP SIGN AT ABOVE LOCATION ALMOST STRIKING PEDESTRIANS USING THE WALKWAY.","geometry":{"type":"Point","coordinates":[-75.091,40.0356]}},{"objectid":2530215,"districtoccur":"03","age":43,"mvc_reason":"VEHICLE OBSERVED TRAVELING NORTH BOUND ON 7TH STREET MAKE A LEFTTURN ONTO SNYDER AVE CUTTING OFF A MALE PEDESTRIAN CROSSING THE STREET WITHIN THE CROSSWALK CAUSING A HAZARD, VEHICLE STOPPED, NO WANTS, VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1582,39.9229]}},{"objectid":2531004,"districtoccur":"24","age":47,"mvc_reason":"POLICE OBSERVE ABOVE VEHICLE RUNNING AT ABOVE LOCATION ON COMPLETELY BLOCKING THE CROSSWALK ON THE SOUTHEAST CORNER WHILE FACING WEST ON ANN ST, VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1105,39.9842]}},{"objectid":2528903,"districtoccur":"35","age":31,"mvc_reason":"POLICE OBSERVED THE ABOVE VEH AT ABOVE LOCATION DRIVING ON THE SIDEWALK. FEMALE STATED SHE WAS ATTEMPTING TO PARK AT HER FRIENDS HOUSE. NCIC/PCIC NEG RESULTS VERBAL","geometry":{"type":"Point","coordinates":[-75.1416,40.0536]}},{"objectid":2510288,"districtoccur":"24","age":21,"mvc_reason":"VEHICLE WAS OBSERVED TRAVELING NORTH ON EMERALD STREET WITH PROHIBITED SUNSCREEN ON ALL WINDOWS, MAKING IT IMPOSSIBLE TO VIEW THE INTERIOR OF THE VEHICLE. THE VEHICLE ALSO HAD LISTED TAG ATTACHED TO IT THAT WAS REGISTERED TO A MERCEDES BENZ. THE VEHICLE WAS ALSO OBSERVED PARKING ON THE SIDEWALK ON THE WEST SIDE OF 3500 EMERALD STREET. THE VEHICLE WAS STOPPED FOR INV.","geometry":{"type":"Point","coordinates":[-75.1043,39.9979]}},{"objectid":2549218,"districtoccur":"06","age":77,"mvc_reason":"OBSERVED A GRAY SEDAN TRAVELING NORTH ON 13TH STREET IN THE BIKE LANE. THE LANE WAS CLEARLY MARKED. OPERATOR ADVISED. NCIC/PCIC NO WANTS.","geometry":{"type":"Point","coordinates":[-75.161,39.9541]}},{"objectid":2540302,"districtoccur":"15","age":23,"mvc_reason":"DEF WAS OBSERVED TRAVEL AROUND MARKED BIKE LANE TO AVOID TRAFFIC WAITING AT TRAFFIC LIGHT. VERBAL WARNING CBI","geometry":{"type":"Point","coordinates":[-75.0918,40.006]}},{"objectid":2543708,"districtoccur":"35","age":30,"mvc_reason":"POLICE WAS OBSERVED TRAVELING SB ON 9TH ST WITH HEAVY TINTED WINDOWS. POLICE WERE UNABLE TO SEE INSIDE VEHICLE. POLICE ALSO OBSERVED VEHICLE STOP OVER SOLID WHITE LINE DISREGARDING CROSSWALK AND STEADY RED SIGNAL. POLICE STOPPED VEHICLE FOR INVESTIGATION. PCIC/NCIC RESULTS NEG. CBI.","geometry":{"type":"Point","coordinates":[-75.1394,40.0235]}},{"objectid":2550900,"districtoccur":"25","age":42,"mvc_reason":"MALE STOPPED FOR OPERATING DIRTBIKE ON CITY STREET WITH NO TAG, BIKE IS NOT REGISTERED DIRTBIKE WAS CONFISCATED PLACED ON PR# 3567401\n\nPVR ISSUED","geometry":{"type":"Point","coordinates":[-75.1125,40.0105]}},{"objectid":2571165,"districtoccur":"24","age":22,"mvc_reason":"PARKING IN A CROSSWALK","geometry":{"type":"Point","coordinates":[-75.1092,39.9967]}},{"objectid":2571932,"districtoccur":"12","age":30,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE TRAVELING N/B ON THE 2400 S. 67TH ST DRIVE INTO THE BIKE LANE TO OVERTAKE VEHICLE IN FRONT OF HIM. NCIC/PCIC REVEALED A SUSPENDED PA LICENSE. VEHICLE LEAGALLY PARKED AS IT DIDN&APOS;T MEET PHILA LIVESTOP REQUIREMENTS.\nBELOW TVR&APOS;S FILED.","geometry":{"type":"Point","coordinates":[-75.2369,39.9237]}},{"objectid":2572015,"districtoccur":"09","age":47,"mvc_reason":"DRIVER OVSERVED DISREGARDING STEADY RED LIGHT  AT  21 AND WINTER, DRIVER CONTINUED S/B IN THE 100 BLK THROUGH THE UNIT BLOCK OF 21 STREET PUTTING THE OPERATOR OF THE BIKE IN A DANGEROUS SITUATION, THE BIKE WAS BEING OPERATED IN THE BIKE LANE. THE DRIVER OF THE SUV THEN MADE A RIGHT TURN FRON THE LEFT LAND ON A STEADY RED LIGHT AT 21 AND ARCH ST,","geometry":{"type":"Point","coordinates":[-75.1776,39.9549]}},{"objectid":2563712,"districtoccur":"12","age":21,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE DRIVING W/B AT THE ABOVE LOCATION. UPON OBSERVATION POLICE OBSERVED THE ABOVE VEHICLE TRAVELING IN A BIKE LANE, AND THE SHOULDER AT THE ABOVE LOCATION, INSTEAD OF AN ACTUAL LANE. POLICE STOPPED VEHICLE FOR INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.2203,39.9266]}},{"objectid":2561035,"districtoccur":"07","age":55,"mvc_reason":"POLICE OBSERVED DEF WB ON STRAHLE MAKE LEFT TURN ONTO SB BUSTLETON WITHOUT YIELDING TO PEDESTRIANS CROSSING BUSTLETON AVE EB IN CROSSWALK","geometry":{"type":"Point","coordinates":[-75.0512,40.0666]}},{"objectid":2560914,"districtoccur":"15","age":56,"mvc_reason":"VEHICLE N/B ON TORRESDALE AVE AND STOPPED IN CROSSWALK AT TYSON.  OPERATOR WEARING REQUIRED SAFETY BELT. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.041,40.0271]}},{"objectid":2585126,"districtoccur":"18","age":22,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE TRAVELING WESTBOUND ON MARKET ST TURN SOUTHBOUND ON 59TH ST WITHOUT YIELDING TO THE PEDESTRIANS IN THE CROSSWALK. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK NEGATIVE RESULTS VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2389,39.9609]}},{"objectid":2590033,"districtoccur":"02","age":56,"mvc_reason":"THE ABOVE VEHICLE WAS OBSERVED BY POLICE TRAVELING E/B ON COTTMAN AVE AND MAKE A LEFT TURN N/B ONTO CASTOR AVE WITHOUT YIELDING TO PEDESTRIANS CROSSING STREET IN CROSSWALK. NCIC/PCIC/BMV CHECK WITH NEG RESULTS.","geometry":{"type":"Point","coordinates":[-75.066,40.0512]}},{"objectid":2602492,"districtoccur":"25","age":30,"mvc_reason":"POLICE OBSERVED A GOLD NISSAN PARKED STOPPED ON THE SIDEWALK AT 2900 ORKNEY ST. THE VEHICLE BEGAN TO DRIVE SB. A BMV CHECK REVEALED THE PA TAG:KTP8756 DISPLAYED ON THE VEHICLE WAS ASSIGNED TO A CHEVY AND EXPIRED IN 2019. UPON INVESTIGATION, THE FEMALE OPERATOR STATED SHE RECENTLY PURCHASED THE VEHICLE BUT DID NOT OBTAIN A REGISTRATION OR INSURANCE. FEMALE IS ALSO UNLICENSED. VEHICLE PULLED OVER IN A LEGALLY PARKED SPACE. NOT LIVE STOPPED. TVRS ISSEUED.","geometry":{"type":"Point","coordinates":[-75.139,39.9951]}},{"objectid":2604414,"districtoccur":"24","age":25,"mvc_reason":"WHILE ON THE ROCN CAR MEET DETAIL, POLICE OBSERVED A GROUP OF MALES ON DIRT BIKES AT ABOVE TIME DATE AND LOCATION. UPON POLICE APPROACHING THEM SEVERAL STARTED TO DISPERSE. POLICE OBSERVED THE ABOVE VEHICLE WITH OUT ANY TYPE OF STATE TAG. NEXT , POLICE ASKED THE MALE FOR A VALID DRIVERS LICENSE, REGISTRATION, AND INSURANCE CARD. AT FIRST THE MALE REFUSED AND STEPPED BACK. HE STATED MULTIPLES TIMES THAT HE WAS AN FBI INFORMANT. AN NCIC-PCIC  CHECK YIELDED A NON LICENSED DRIVER AND AN UNREGISTERED","geometry":{"type":"Point","coordinates":[-75.1121,40.0121]}},{"objectid":2614843,"districtoccur":"06","age":42,"mvc_reason":"OBSERVED A SILVER SUV TRAVELING  NORTH ON 13TH STREET TOWARDS MARKET STREET. OPERATOR FAILED TO YIELD TO PEDESTRIANS IN CROSSWALK WHILE MAKING A RIGHT HAND TURN ONTO MARKET STREET. OPERATOR ADVISED. NCIC/PCIC NO WANTS.","geometry":{"type":"Point","coordinates":[-75.1599,39.9516]}},{"objectid":2600114,"districtoccur":"12","age":25,"mvc_reason":"VEHICLE WAS PARKED AND RUNNING, FACING SOUTHBOUND ON THE EASTSIDE SIDEWALK COMPLETELY BLOCK PEDESTRIAN TRAFFIC. POLICE STOPPED THE VEHICLE FOR FURTHER INVESTIGATION. RAN THROUGH PCIC/NCIC WITH NO WANTS. VERBAK WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.2311,39.9277]}},{"objectid":2634820,"districtoccur":"18","age":32,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING SOUTHBOUND ON 62ND STREET AND MAKE A LEFT HAND TURN ONTO CHESTNUT STREET. WHILE MAKING THE TURN TO HEAD EASTBOUND ONTO CHESTNUT THE OPERATOR FIELD TO YIELD TO PEDESTRIANS ATTEMPTING TO CROSS CHESTNUT STREET. POLICE STOPPED THE VEHICLE FOR INVESTIGATION. NCIC/PCIC NEGATIVE RESULTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.245,39.9609]}},{"objectid":2630063,"districtoccur":"24","age":53,"mvc_reason":"POLICE WERE TRAVELING WESTBOUND ON 1800 BUCKIUS STREET WHICH IS A HIGH CRIME AREA KNOWN FOR DRUG SELLS AND SHOOTINGS, WHEN THEY NOTICED A VEHICLE PARKED ON THE SIDEWALK WITH THREE WOMEN STANDING AROUND THE PASSENGER DOOR. WHEN POLICE DROVE DOWN THE STREET ALL THREE WOMEN WALKED AWAY FROM THE VEHICLE. POLICE GOT OUT OF RPC TO INVESTIGATE THE VEHICLE WITH TEMP TAGS PARKED ON THE SIDEWALK WHEN POLICE NOTICED THERE WAS A MALE SITTING IN THE PASSENGER SEAT. POLICE APPROACHED THE PASSENGER DOOR AND NO","geometry":{"type":"Point","coordinates":[-75.0979,40.0049]}},{"objectid":2638608,"districtoccur":"06","age":20,"mvc_reason":"VEHICLE CAME DOWN SB 10TH STREET AT A HIGH RATE OF SPEED, TAIL GAITING A MARKED POLICE VEHICLE FOR A LENGTH OF A BLOCK. WHEN THE CAR THEN PASSED THE POLICE VEHICLE ON THE LEFT HAND SIDE IN A NON-MOVING LANE WITHOUT REGARD FOR TRAFFIC OR PEDESTRIAN. VEHICLE STOPPED FOR INVESTIGATION, OPERATOR STATED TO POLICE THAT HE RECEIVED A CALL FROM HIS CHILD&APOS;S MOTHER THAT THE CHILD IS CHOKING WHICH IS WHY HE WAS DRIVING IN THE MANNER THAT HE WAS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1537,39.9653]}},{"objectid":2637937,"districtoccur":"39","age":24,"mvc_reason":"POLICE OBSERVED ABV VEHICLE IDLING ON THE SIDEWALK WHERE PARKING IS PROHIBITED, VEHICLE THEN LEFT THE SIDEWALK AT A HIGH RATE OF SPEED DISREGARDING MULTIPLE STOP SIGNS AS IT DROVE NORTH ON GRATZ ST TOWARD HUNTING PARK, POLICE COULD OBSERVE ALL THE WINDOWS ON THE VEHICLE HAD HEAVY DARK TINT ON ALL THEM, POLICE STOP THE VEHICLE ON HUNTING PARK AND THE DRIVER LOWERED HIS WINDOW, POLICE COULD OBSERVE HIM LOOKING IN THE MIRROR BACK AT POLICE AND THEN LOOKING AND REACHING AROUND THE CENTER CONSOLE ARE","geometry":{"type":"Point","coordinates":[-75.1541,40.0112]}},{"objectid":2621726,"districtoccur":"24","age":18,"mvc_reason":"OFFICERS OBSERVED LISTED VEHICLE PARKED ON SIDEWALK ON 3400 BRADOCK ST RUNNING WITH HEAVY TINT. WHEN OFFICERS WENT TO MAKE CONTACT WITH THE INDIVIDUALS THE BACKSEAT PASSENGER EXITED THE VEHICLE AND BEGAN TO RUN N/B ON BRADOCK ST. OFFICER MARTIN LOST SIGHT OF HIM ONCE HE TURNED ON FRANKFORD AVE, FLASH WAS GIVEN OUT OVER RADIO WITH NEG RESULTS. FRONT SEAT DRIVER AND FRONT SEAT PASSENGER WERE BRIEFLY DETAINED WHEN OFFICERS CONDUCTED THE FRISK OF THE VEHICLE FOR OFFICERS SAFETY. WHEN OFFICER GALAZKA","geometry":{"type":"Point","coordinates":[-75.1062,39.9962]}},{"objectid":2656422,"districtoccur":"24","age":18,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE PULL IN FRONT OF POLICE AT ABOVE LOCATION WITH DARK TINT.  POLICE WERE UNABLE TO SEE INSIDE THE VEHICLE.  THE OPERATOR IMMEDIATELY EXITED AND WALKED TO ANOTHER MALE ON THE SIDEWALK AND BEGAN TALKING.  THE TEMP TAG ON THE VEHICLE WAS COUNTERFEIT.  POLICE STOPPED ABOVE MALE AND PASSENGER FOR INVES.  POLCIE RAN VIN OVER THE AIR THROUGH BMV WHICH RETURNED IN STOLEN STATUS OCA #21-24-057332.  THE VIN MATCHED THE STOLEN VEHICLE.  POLICE DETAINED BOTH THE OPERATOR AND PASS","geometry":{"type":"Point","coordinates":[-75.1176,39.9954]}},{"objectid":2657847,"districtoccur":"25","age":44,"mvc_reason":"POLICE OBSERVED DRIVER MAKE LEFT TURN WITHOUT YIELDING TO ONCOMING TRAFFIC NEARLY STRIKING PEDESTRIAN. STOPPED FOR INVESTIGATION. NCIC/PCIC- NO WANTS. WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1479,39.9933]}},{"objectid":2656610,"districtoccur":"24","age":21,"mvc_reason":"VEHICLE OBSERVED IDLING ON THE SIDEWALK ON THE SOUTH SIDE OF MONMOUTH STREET. THE VEHICLE WAS OCCUPIED BY ONE OPERATOR. THE VEHICLE WAS RAN THROUGH NCIC/PCIC AND REVEALED NO WANTS. THE VEHICLE WAS RELEASED AND THE OPERATOR ADVISED.","geometry":{"type":"Point","coordinates":[-75.1177,39.9908]}},{"objectid":2656324,"districtoccur":"16","age":54,"mvc_reason":"VEH OBS SB 52ND ST TRAV ON EAST SIDEWALK TURN LEFT ONTO EASTBOUND 5100 WYALUSING AVE UTILIZING WESTBOUND LANES. VEH ALSO MATCHED FLASH INFORMATION PROVIDED BY NSF SURVEILANCE P/O ROBERTSON #6645 (N123, &GT;10 YEARS EXPERIENCE, &GT;1000 NARCOTICS ARRESTS) WHICH WAS A W/M ON A BICYCLE TRAV SB ON 52ND ST WEARING A BLACK KNIT CAP, GRAY HOODED SWEATSHIRT WITH BLACK SHOULDERS, GRAY SWEATPANTS WITH BLACK STRIPES, AND RED SNEAKERS. THIS MALE WAS OBSERVED BY N123 EXCHANGE USC FOR SMALL OBJECTS WHICH THE","geometry":{"type":"Point","coordinates":[-75.2232,39.9697]}},{"objectid":2650618,"districtoccur":"07","age":66,"mvc_reason":"THE LISTED VEHICLE PROCEEDED TO PASS ANOTHER VEHICLE AT A HIGH RATE OF SPEED WHILE USING THE SHOULDER AND BIKE LANE.","geometry":{"type":"Point","coordinates":[-75.0471,40.0984]}},{"objectid":2659417,"districtoccur":"35","age":30,"mvc_reason":"POLICE ASSIGNED ON BIKE AT THE COMPLEX OF 101 E OLNEY OBSEVRED THE LISTED DRIVER DRIVING AT A HIGH RATE OF SPEED THROUGHOUT THE COMPLEX. THE DRIVER WAS IN ONCOMING TRAFFIC, NEVER ATTEMPTING TO BE IN HIS OWN LANE, COMING TO A COMPLETE STOP BY JAMMING ON HIS BRAKES, SWIRVING AROUND PEDESTRIANS WHO WERE WALKING WITH THERE KIDS AND COMING WITHIN FEET OF STRIKING THEM. POLICE RADIOED LOCATION TAG MAKE AND MODEL OF VEHICLE AND REQUESTED FOR A MARKED UNIT TO STOP THE VEHICLE. 3514 ARRIVED TO THE COMPLE","geometry":{"type":"Point","coordinates":[-75.1205,40.0352]}},{"objectid":2659514,"districtoccur":"24","age":17,"mvc_reason":"LISTED MALE OBSERVED RIDING LISTED MOTORCYCLE ON TO THE SIDEWALK ON THE EAST SIDE OF THE STREET AND PARKING IT ON THE SIDEWALK. THE VEHICLE ALSO HAD TAPE ON THE LICENSE PLATE, COVERING SOME OF THE DIGITS, MAKING IT IMPOSSIBLE FOR POLICE TO RUN. THE OPERATOR THEN ENTERED A CLOTHING STORE AT LISTED LOCATION. THE MALE WAS STOPPED FOR MVC VIOLATION.","geometry":{"type":"Point","coordinates":[-75.1155,39.9954]}},{"objectid":2645282,"districtoccur":"06","age":22,"mvc_reason":"OPERATOR OBSERVED BY POLICE TRAVELING N/B ON 1 NORTH 9TH STREET ,OPERATOR FAIL TO YIELD TO PEDESTRIAN IN CROSSWALK, VERBAL WARNING ONLY.","geometry":{"type":"Point","coordinates":[-75.1551,39.9514]}},{"objectid":2644931,"districtoccur":"06","age":74,"mvc_reason":"OPERATOR OBSERVED BY POLICE  FAIL TO YIELD TO PEDESTRIAN IN A CROSSWALK AT BAOVE LOCATION,VERBAL WARNING ONLY.","geometry":{"type":"Point","coordinates":[-75.1551,39.9514]}},{"objectid":2673135,"districtoccur":"24","age":18,"mvc_reason":"POLICE OBSERVED PEOPLE IN VEHICLE THROWING BOTTLES AT PEOPLE WALKING ON SIDEWALK.","geometry":{"type":"Point","coordinates":[-75.111,39.9978]}},{"objectid":2671846,"districtoccur":"22","age":59,"mvc_reason":"LISTED VEHICLE AT LISTED TIME AND LOCATION WAS OBSERVED BY POLICE  PARKED ON THE SIDEWALK (PA MVC 3353(1)II). POLICE ALSO NOTICED FRONT DRIVER SIDE TIRE MISSING, AND DUE TO THE SURGES IN CAR JACKING&APOS;S AND STOLEN VEHICLES IN THE AREA, PLUS THE FRONT TIRE MISSING. POLICE SUSPICION WAS HEIGHTENED OF THIS BEHICLE BEING POSSIBLY STOLEN. AS POLICE APPROACHED LISTED MALE COULD NOT PROVIDE INFORMATION OF THE VEHICLE. WHEN ASKED WHO&APOS;S VEHICLE IT WAS, LISTED MALE STATED THAT HE DIDN&APOS;T KNOW","geometry":{"type":"Point","coordinates":[-75.1863,39.9886]}},{"objectid":2683376,"districtoccur":"24","age":29,"mvc_reason":"ABOVE MALE OPERATING VEHICLE EASTBOUND AT ABOVE LOCATION WENT DIRECTLY THROUGH REDLIGHT AT EMERALD AND ALLEGHENY AROUND TRAFFIC. THE OPERATOR CONTINUED EAST AND SLAMMED ON HIS BREAKS IN THE MIDDLE OF CROSSWALK AT ABOVE LOCATION WHEN HE SAW POLICE. MALE WAS STOPPED AT ABV LOCATION AND OPER AND PASSENGER WERE EXTREMELY NERVOUS.  WHEN ASKED  IF THERE WERE  ANY WEAPONS ON HIM AND HE REPLIED NO, THE PASSENGER ALSO STATED THERE WAS NO WEAPONS IN THE VEHICLE.  DUE TO HIS NERVOUS BEHAVIOR AND RECKLESS D","geometry":{"type":"Point","coordinates":[-75.1113,39.994]}},{"objectid":2689761,"districtoccur":"19","age":34,"mvc_reason":"POLICE OBSERVED VEHICLE DRIVE AROUND TRAFFIC TAKING UP THE BUS LANE/ BIKE LANE  TO  PASS TRAFFIC WHILE TRAVELING WEST. NCIC/PCIC NEGATIVE RESULTS. VERBAL WARNING GIVEN. BWC ACTIVATED.","geometry":{"type":"Point","coordinates":[-75.2253,39.96]}},{"objectid":2686309,"districtoccur":"19","age":36,"mvc_reason":"P/O OBV ABV VEH TRAVELING W/B ON MONUMENT RD INSIDE TARGET PARKING LOT &AMP; DISREGARD THE STOP SIGN IN THE CROSSWALK IN FRONT OF TARGET STORE ALMOST STRIKING PEDS CROSSING IN THE CROSSWALK WHILE P/O WERE PARKED IN THE LOT CLEARED BY INVESTIGATION P/O ISSUED VERBAL WARNING","geometry":{"type":"Point","coordinates":[-75.2135,40.0063]}},{"objectid":2676118,"districtoccur":"06","age":45,"mvc_reason":"VEHICLE OBSERVED TRAVELING WESTBOUND ON MARKET STREET FROM 7TH, IN THE BUS/BIKE ONLY LANE. VEHICLE STOPPED AND OPERATOR ADVISED.","geometry":{"type":"Point","coordinates":[-75.1544,39.9512]}},{"objectid":2676537,"districtoccur":"24","age":32,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE PARTIALLY PARKED ON THE SIDEWALK CORNER OF ANN ST AND FRANKFORD AV RUNNING. POLICE WAS UNSURE IF THE VEHICLE WAS OCCUPIED DUE TO THE TINT ON ALL WINDOWS. PCIC/NCIC NO WANTS VERBAL WARNING GIVEN BWC ACTIVATED","geometry":{"type":"Point","coordinates":[-75.1177,39.9898]}},{"objectid":2678344,"districtoccur":"08","age":32,"mvc_reason":"POLICE OBSERVED THE ABOVE VEHICLE PASS A TRACTOR TRAILER DRIVING NORTH BOUND ON STATE THE VEHICLE WENT INTO A DESIGNATED BIKE LANE AND PARKING LANE. POLICE ATTEMPTED TO STOP THE VEHICLE ON 9600 STATE ROAD AND IT CONTINUED TO DRIVE NORTH ON STATE INTO SALEM HARBOR. THE VEHICLE THEN STOPPED ON OLD BRIDGE ROAD AND THE OCCUPANTS ROLLED THE WINDOWS TO THE VEHICLE UP. THE VEHICLE THEN BEGAN MOVING AS IF THE PASSENGERS INSIDE THE VEHICLE WERE MOVING ALL AROUND THE CAR. THE CAR CONTINUED TO SHAKE POLICE","geometry":{"type":"Point","coordinates":[-74.9843,40.0522]}},{"objectid":2675378,"districtoccur":"19","age":21,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE STOPPED IN THE BUS LANE AT 5601 MARKET STREET. THE DRIVER WAS OBSERVED PULLING OUT OF THE BUS LANE WITH NO TURN SIGNAL. THE DRIVER WAS OBSERVED MAKING A LEFT TURN ONTO 57TH STREET WITH NO TURN SIGNAL AND NOT LETTING A PEDESTRIAN CROSS THE STREET THAT WAS ALREADY IN THE MIDDLE OF THE INTERSECTION. POLICE STOPPED THE VEHICLE AND GAVE A VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.233,39.9611]}},{"objectid":2697010,"districtoccur":"35","age":35,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING WESTBOUND ON STENTON AV USING THE BIKE/PARKING LANE TO OVERTAKE SEVERAL OTHER FORWARD MOVING VEHICLES AT 18TH ST. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.15,40.0532]}},{"objectid":2698803,"districtoccur":"25","age":35,"mvc_reason":"ABOVE MALE OPERATING VEHICLE SOUTHBOUND AT ABOVE LOCATION WITH HEAVILY TINTED WINDOWS AND PARKED BLOCKING THE CROSSWALK, NCIC/PCIC CHECK NO WANTS, VERBAL WARNIN GIVEN.","geometry":{"type":"Point","coordinates":[-75.1323,39.9943]}},{"objectid":2698943,"districtoccur":"24","age":41,"mvc_reason":"VEHICLE WAS STOPPED IN THE BIKE LANE AND TURNED INTO THE STREAM OF TRAFFIC WITHOUT THE USE OF A TURN SIGNAL. MALE DRIVER WAS GIVEN VERBAL WARNING ONLY NO TVR BWC ACTIVATED.","geometry":{"type":"Point","coordinates":[-75.1231,39.9977]}},{"objectid":2692118,"districtoccur":"24","age":32,"mvc_reason":"STOPPED ON SIDEWALK","geometry":{"type":"Point","coordinates":[-75.129,39.9954]}},{"objectid":2695656,"districtoccur":"25","age":30,"mvc_reason":"POLICE OBSERVED VEHICLE ON THE 100 BLOCK OF E HUNTINGPARK AVE WHEN VEHICLE CAME OFF THE SIDEWALK GOING THROUGH A STEADY RED LIGHT THAT WAS POSTED, POLICE RAN VEHICLE THROUGH PCIC AND NCIC WITH NEGATIVE RESULTS MALE WAS ADVISED AND WAS GIVEN A VERBAL WARNING AND WAS RELEASED.","geometry":{"type":"Point","coordinates":[-75.1246,40.0136]}},{"objectid":2694644,"districtoccur":"14","age":22,"mvc_reason":"VEHICLE OBSERVED WEST ON 100 E HERMAN AT A HIGH RATE OF SPEED NEARLY STRIKE PARKED VEHICLE, MULTIPLE PEDESTRIANS IN AREA. FEMALE ADVISED","geometry":{"type":"Point","coordinates":[-75.1775,40.0426]}},{"objectid":2724825,"districtoccur":"39","age":20,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING ON 100 QUEEN LANE, VEHICLE OVERTOOK THE VEHICLE WHO WAS TRAVELING IN FRONT OF THEM WITH TOTAL DISREGARD FOR OTHER DRIVERS AND PEDESTRIANS ON THE HIGHWAY. VEHICLE STOPPED FOR INVESTIGATION. VERBAL WARNING GIVEN TO THE OPERATOR.","geometry":{"type":"Point","coordinates":[-75.1704,40.03]}},{"objectid":2725522,"districtoccur":"39","age":19,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING ON 100 QUEEN LANE, VEHICLE OVERTOOK THE VEHICLE WHO WAS TRAVELING IN FRONT OF THEM WITH TOTAL DISREGARD FOR OTHER DRIVERS AND PEDESTRIANS ON THE HIGHWAY. VEHICLE STOPPED FOR INVESTIGATION. VERBAL WARNING GIVEN TO THE OPERATOR.","geometry":{"type":"Point","coordinates":[-75.1704,40.03]}},{"objectid":2725531,"districtoccur":"39","age":19,"mvc_reason":"POLICE OBSERVED THE LISTED VEHICLE TRAVELING ON 100 QUEEN LANE, VEHICLE OVERTOOK THE VEHICLE WHO WAS TRAVELING IN FRONT OF THEM WITH TOTAL DISREGARD FOR OTHER DRIVERS AND PEDESTRIANS ON THE HIGHWAY. VEHICLE STOPPED FOR INVESTIGATION. VERBAL WARNING GIVEN TO THE OPERATOR.","geometry":{"type":"Point","coordinates":[-75.1704,40.03]}},{"objectid":2721601,"districtoccur":"24","age":43,"mvc_reason":"WHILE TRAVELING BEHIND THE ABOVE VEHICLE AT THE ABOVE LOCATION, POLICE OBSERVED THAT THE VEHICLE HAD VERY HEAVY TINT ALL THE WAY AROUND. BEFORE POLICE COULD ACTIVATE THEIR EMERGENCY LIGHTS, THE VEHICLE PULLED INTO AN ILLEGAL PARKING SPOT WHICH WAS FULLY BLOCKING THE CROSSWALK. POLICE STOPPED THE VEHICLE WITHOUT INCIDENT. DURING THE STOP, THE DRIVER WAS BREATHING VERY FAST WITH HIS STOMACH TREMBLING. HE APPEARED TO BE NERVOUS DURING HIS POLICE QUESTIONS. THE FRONT SEAT PASSENGER REFUSED TO GIVE H","geometry":{"type":"Point","coordinates":[-75.1238,39.9951]}},{"objectid":2724053,"districtoccur":"03","age":63,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING E/B ON ELLSWORTH ST. TOWARDS 11TH ST. VEHICLE THEN DISREGARDED THE STEADY RED LIGHT, PASSED THE CROSSWALK, AND STOPPED CLOSE TO THE MIDDLE OF THE INTERSECTION, AND CAUSED A TRAFFIC HAZARD FOR ONCOMING VEHICLES GOING N/B AND S/B. PCIC/NCIC SHOWED NO WANTS FOR DRIVER AND VEHICLE. VERBAL WARNING GIVEN ONLY.","geometry":{"type":"Point","coordinates":[-75.1622,39.9359]}},{"objectid":2722765,"districtoccur":"35","age":34,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING SOUTHBOUND ON 10TH ST DISREGARD THE STOP SIGN AT LOUDON ST. WHEN POLICE TURNED AROUND THE VEHICLE DROVE ONTO THE SIDEWALK CREATING A HAZARD. VEHICLE WAS LATER OBSERVED TRAVELING SOUTHBOUND ON 5TH ST AND PULLED OVER UPON SIGNAL. VEBRAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1332,40.0244]}},{"objectid":2722131,"districtoccur":"35","age":68,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING NORTHBOUND ON OGONTZ AV DISREGARD THE STEADY RED SIGNAL AT CHEW AV USING THE BIKE LANE TO OVERTAKE OTHER VEHICLES STOPPED AT THE RED LIGHT. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.151,40.0466]}},{"objectid":2722499,"districtoccur":"06","age":35,"mvc_reason":"VEH OBSERVED E/B 1200 MARKET ST RIGHT LANE CARELESSLY MAKE U TURN IN CROSSWALK TOGO W/B MARKET ST","geometry":{"type":"Point","coordinates":[-75.1602,39.9519]}},{"objectid":2730633,"districtoccur":"22","age":23,"mvc_reason":"THE ABOVE LISTED VEHICLE WAS OBERVED TRAVELING EAST ON 1300 CECIL B MOORE ST WHEN THE OPERATOR MADE AN UNSAFE U-TURN IN FRONT OF PEDESTRIANS CROSSING THE ROADWAY.  NCIC/PCIC CHECK NO WANTS VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.1563,39.9784]}},{"objectid":2717219,"districtoccur":"06","age":30,"mvc_reason":"POLICE OBSERVED A LARGE PACK OF DIRTBIKES AND ATVS OPERATING RECKLESSLY AND CARELESSLY, DISREGARDING STEADY RED SIGNALS, TRAFFIC CONTROL DEVICES AND CUTTING OFF TRAFFIC. OFFICERS OBSERVED THE PACK PULLOVER TO THE GAS STATION AT 1100 SPRING GARDEN. AS POLICE PULLED IN, THE PACK PULLED OUT AND POLICE WERE ABLE TO STOP THE ABOVE LISTED DIRT BIKE FOR INVESTIGATION. UPON STOP DRIVER PRODUCED PROPER REGISTRATION AND INSURANCE FOR DIRT BIKE. OFFICERS THEN CONFIRMED WITH PAPERWORK AND EQUIPMENT THAT THE","geometry":{"type":"Point","coordinates":[-75.1563,39.9616]}},{"objectid":2716244,"districtoccur":"25","age":31,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED COMPLETELY BLOCKING CROSSWALK, WHILE SITTING INSIDE VEHICLE WITH THE CAR RUNNING. POLICE RAN PA TAG THROUGH MDT. TAG ON VEHICLE DID NOT COME BACK TO ANY VEHICLE. POLICE ACTIVATED LIGHTS AND STOPPED VEHICLE FOR INVESTIGATION. DURING INVESTIGATION BOTH DRIVER AND PASSENGER DID NOT HAVE IDENTIFICATION AND VIN ON VEHICLE WAS UNABLE TO BE READ BY POLICE. POLICE RAN BOTH DRIVER AND PASSENGER WITH NO RETURN ON BOTH OCCPANTS. DRIVER OF VEHICLE GAVE CONSENT TO SEARCH","geometry":{"type":"Point","coordinates":[-75.1428,40.0036]}},{"objectid":2714536,"districtoccur":"06","age":31,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE APPROACH FROM THE REAR PASSING ALL VEHICLES IN RUNNING LANE WHILE OPERATING IN BIKE LANE. OPERATOR WAS ATTEMPTING TO PASS ALL TRAFFIC. VEHICLE STOPPED FOR INVESTIGATION, NCIC/PCIC CHECKED NO WANTS OR WARRANTS. OPERATOR GIVEN VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.1595,39.9613]}},{"objectid":2713513,"districtoccur":"15","age":24,"mvc_reason":"VEHICLE OBSERVED WITH A FRADULENT PAPER TAG ALSO VEHICLE WITH DARK TINT AND BROKEN SIDE WINDOW.  LIGHTS ACTIVATED VEHICLE  DROVE UP ONTO SIDEWALK BACK  ONTO STREET. OBSERVED THE DRIVER CLIMB IN THE BACK SEAT AND THE FRONT PASSENGER  SWITCHED TO THE DRIVERS SEAT.  FRONT PASSENGER WAS THE OWNER OF THE VEHICLE AND  BOTH MALES WAS CLEARED BY INVESTIGATION.","geometry":{"type":"Point","coordinates":[-75.0855,40.0149]}},{"objectid":2741741,"districtoccur":"02","age":16,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING W/B ON MAGEE STOP AT A RED SIGNAL AT LORETTO. OPERATOR CLEARED INTERSECTION AND PROCEEDED TO TURN S/B ONTO LORETTO FROM MAGEE AGAINST RED SIGNAL. \nBMV CHECK WAS CONDUCTED AND VEHICLE WAS IN STOLEN STATUS GUARD FOR PRINTS TAKEN DURING POINT OF GUN CARJACKING. \nI NOTIFED POLICE RADIO AND GAVE LOCATION OF VEHICLE AND AWAITED BACK UP. VEHILE CAME TO A STOP AT 4640 ROOSEVELT BLVD ON SIDEWALK. BOTH DRIVER AND PASSENGER FLED ON FOOT. BOTH MALES WERE STOPPED AND ARRESTE","geometry":{"type":"Point","coordinates":[-75.0765,40.0426]}},{"objectid":2742451,"districtoccur":"18","age":44,"mvc_reason":"VEHICLE WAS OBSERVED BY POLICE GOING AROUND A STATIONARY TROLLEY ON THE LEFT WHILE IT WAS UNLOADING PASSENGERS. THIS ACTION WAS DONE AND THE VEHICLE DROVE THROUGH THE CROSSWALK AND STOPPED IN THE INTERSECTION TO WAIT AT THE RED SIGNAL. VEHICLE WAS STOPPED FOR INVESTIGATION DUE TO THE CARELESS OPERATION OF THE OPERATOR. NCIC/PCIC/BMV, NO WANTS. MALE WAS WARNED AND RELEASED","geometry":{"type":"Point","coordinates":[-75.2322,39.9478]}},{"objectid":2740803,"districtoccur":"09","age":72,"mvc_reason":"WHILE TRAVELLING NORTH ON BROAD ST BEHIND THE LISTED VEHICLE POLICE OBSERVED THE OPERATOR CROSS THE MEDIAN INTO ONCOMING TRAFFIC TO ENTER A HOTEL DRIVEWAY CAUSING A HAZARDOUS CONDITION TO OTHER VEHICLE AND PEDESTRIANS. MALE CLEARED THROUGH INVESTIGATION AND A VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.1645,39.949]}},{"objectid":2739534,"districtoccur":"25","age":34,"mvc_reason":"POLICE OBSERVED THE ABOVE LISTED MOTORCYCLE PARKED AT THE GAS STATION PUMPS AT 101 W LEHIGH AVE, WITH THE OFFENDER STANDING NEXT TO THE MOTORCYCLE. PCIC/NCIC SHOWS NO RECORD FOR THE LICENSE PLATE WHEN QUERIED. POLICE APPROACHED AND THE MALE SAT ON THE BIKE AND STARTED THE VEHICLE. FEARING THE MALE MY FLEE ON A BIKE WHICH MAY BE STOLEN POLICE IMMEDIATELY RECOVERED THE KEY FROM THE IGNITION. THE MALE DID NOT HAVE PAPERWORK FOR THE MOTORCYCLE AND DID NOT HAVE A DRIVERS LICENSE TO PROVIDE TO POLICE.","geometry":{"type":"Point","coordinates":[-75.1312,39.991]}},{"objectid":2741283,"districtoccur":"22","age":38,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING AT A HIGH RATE OF SPEED N/B ON 18TH ST WELL ABOVE THE POSTED SPEED LIMIT WITHOUT CAUTION TO OTHER VEHICLES AND PEDESTRIANS. VERBAL WARNING. NCIC/PCIC CHECKED W/NEG RESULTS","geometry":{"type":"Point","coordinates":[-75.162,39.9903]}},{"objectid":2742730,"districtoccur":"18","age":26,"mvc_reason":"VEH OBS TRAVELING IN BIKE LANE TO ILLEGALLY PASS VEHICLES ON THE LEFT. STOPPED FOR INVESTIGATION. NO WANTS. VERBAL WARNING ISSUED","geometry":{"type":"Point","coordinates":[-75.2435,39.9591]}},{"objectid":2744684,"districtoccur":"15","age":44,"mvc_reason":"WHILE STOPPED AT THE INTERSECTION OF TORRESDALE AND HELLERMAN, POLICE OBSERVED ABOVE VEHICLE EXIT THE PARKING LOT OF THE MCDONALDS ON 6400 TORRESDALE AND GO NORTHBOUND. VEHICLE THEN DISREGARDED THE STEADY RED SIGNAL ALMOST STRIKING A MALE PEDESTRIAN CONTINUING NORTHBOUND. POLICE THEN OBSERVED VEHICLE SWERVE INTO ONCOMING TRAFFIC MULTIPLE TIMES. POLICE ACTIVATED LIGHTS AND SIRENS ON 6600 TORRESDALE AND FEMALE DRIVER DID NOT PULL OVER UNTIL HALFWAY THROUGH 6700 TORRESDALE. POLICE ASKED DRIVER BASI","geometry":{"type":"Point","coordinates":[-75.0515,40.0218]}},{"objectid":2743682,"districtoccur":"03","age":44,"mvc_reason":"MOTORCYCLE WAS OBSERVED BY INSP PRZEPIOKA (I6) OPERATING ON THE SIDEWALK IN A CARELESS MATTER TO AVOID TRAFFIC GOING S/B ON COLUMBUS AVE WITH NO TAG DISPLAYED, UPON INVESTIGATION OPERATOR DOES NOT POSES A CLASS &QUOT;M&QUOT; LICENSE. 3 TVR&APOS;S ISSUED, NCIC/PCIC NO WANTS.","geometry":{"type":"Point","coordinates":[-75.143,39.9347]}},{"objectid":2745592,"districtoccur":"09","age":37,"mvc_reason":"VEHICLE TRAVELING EAST BOUND ON LOCUST STREET MADE A LEFT TURN ONTO SOUTH BROAD STREET CUTTING OFF A GROUP OF PEDESTRIANS CROSSONG WITH THE CROSSWALK, VEHICLE STOPPED FOR INVESTIGATION NO WANTS VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.1645,39.949]}},{"objectid":2743894,"districtoccur":"14","age":32,"mvc_reason":"VEHICLE OBSERVED DRIVING IN A MANNER THAT WAS RECKLESS TO THE OPERATOR AS WELL AS OTHER MOTORISTS AND PEDESTRIANS IN THE AREA. POLICE WERE STOPPED AT THE TRAFFIC LIGHT OF E WASHINGTON LA AND MANSFIELD AVE AND WERE THE #1 VEHICLE AT THE LIGHT. LISTED VEHICLE WAS OBSERVED TRAVELING W/B IN THE RIGHT SHOULDER LANE AT A HIGH RATE OF SPEED, PASSING MULTIPLE VEHICLES, INCLUDING MYSELF IN A MARKED POLICE CAR, AND CONTINUED W/B AFTER THE TRAFFIC LIGHT. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC NO WANT","geometry":{"type":"Point","coordinates":[-75.1641,40.0611]}},{"objectid":2750190,"districtoccur":"15","age":24,"mvc_reason":"POLICE OBS MALE OPERATIING VEH N/B ON FRANKFORD FROM HARRISON. WHILE MALE TURNED ONTO FRANKFORD HALF HIS VEH DROVE UP ON THE SIDEWALK. VEH WAS STOPPED FOR INV. VERBAL WARNING CBI","geometry":{"type":"Point","coordinates":[-75.081,40.0197]}},{"objectid":2757804,"districtoccur":"12","age":29,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING ON THE HIGHWAY MAKE SEVERAL TURNS WITHOUT USING A TURN SIGNAL AND BLOCKING CROSS WALKS AT RED LIGHTS CAUSING UNSAFE CONDITIONS FOR PEDESTRIANS. POLICE ADVISED FEMALE AND GAVE THE OPERATOR A VERBAL WARNING FOR INFRACTIONS. NCIC/PCIC CAME BACK WITH NEGATIVE RESULTS. CBI","geometry":{"type":"Point","coordinates":[-75.225,39.9237]}},{"objectid":2757975,"districtoccur":"12","age":34,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING ON THE HIGHWAY MAKE SEVERAL TURNS WITHOUT USING A TURN SIGNAL AND BLOCKING CROSS WALKS AT RED LIGHTS CAUSING UNSAFE CONDITIONS FOR PEDESTRIANS. POLICE ADVISED FEMALE AND GAVE THE OPERATOR A VERBAL WARNING FOR INFRACTIONS. NCIC/PCIC CAME BACK WITH NEGATIVE RESULTS. CBI","geometry":{"type":"Point","coordinates":[-75.225,39.9237]}},{"objectid":2758338,"districtoccur":"19","age":67,"mvc_reason":"LISTED VEHICLE WAS DRIVING W/B ON 5500 RACE WHILE DRIVING IN AN OUT OF THE BIKE LANE WHILE POLICE WERE IN REAR OF VEHICLE, NCIC/PCIC CHECK SHOWED LISTED OWNER WAS SUSPENDED, NO WANTS. VEHICLE INVESTIGATION WAS CONDUCTED. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.2304,39.9638]}},{"objectid":2755261,"districtoccur":"17","age":48,"mvc_reason":"POLICE OBSERVED VEHICLE PARKED IN THE BIKE AND TRAVEL LANE NOT ALLOWING SEPTA BUSES TO PASS THROUGH OR BIKES TO USE THEIR DESIGNATED TRAVEL LANE. POLICE ACTIVATED EMERGENCY LIGHTS AND SIRENS AND STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC NEGATIVE RESULTS. VEHICLE CLEARED BY INVESTIGATION AND A VERBAL WARNING WAS ISSUED.","geometry":{"type":"Point","coordinates":[-75.1815,39.932]}},{"objectid":2767177,"districtoccur":"24","age":31,"mvc_reason":"VEHICLE OBSERVED IDLING ON THE EAST SIDE OF THE STREET, OCCUPIED BY FOUR MALES. THE VEHICLE HAD DARK TINT ON ALL WINDOWS INCLUDING THE FRONT WINDSHIELD, MAKING IT HAZARDOUS TO VEHICLES OR PEDESTRIANS IN FRONT OF IT. THE VEHICLE WAS STOPPED FOR INV.","geometry":{"type":"Point","coordinates":[-75.1116,39.9865]}},{"objectid":2764055,"districtoccur":"35","age":19,"mvc_reason":"POLICE OBSERVED THE ABV VEHICLE TRAVELLING E./B ON GODFREY WITH DARK TINT ON ALL WINDOWS. POLICE OBSERVED THE VEHICLE USE THE BIKE LANE TO OVERTAKE A VEHICLE IN FRONT OF IT. VEHICLE STOPPED FOR INVESTIGATION. OPERATOR/VEHICLE RAN THROUGH PCIC/NCIC. NO WANTS. CBI","geometry":{"type":"Point","coordinates":[-75.1203,40.0445]}},{"objectid":2764059,"districtoccur":"35","age":23,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING WESTBOUND ON GODFREY AV USING THE BIKE LANE/RIGHT SHOULDER TO OVERTAKE SEVERAL OTHER FORWARD MOVING VEHICLES. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1203,40.0445]}},{"objectid":2773702,"districtoccur":"05","age":29,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING NORTHBOUND ON THE 6100 BLOCK OF RIDGE AVE. POLICE STOPPED TO LET PEDESTRIANS CROSS AT THE CROSS WALK WHEN LISTED VEHICLE FAILED TO STOP. NCIC/PCIC- NO WANTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.2153,40.0335]}},{"objectid":2773120,"districtoccur":"02","age":39,"mvc_reason":"STOPPED FOR CARELESS DRIVING, BY DRIVING ON SIDEWALK TO AVIOD LIGHT, ALSO NOT WEARING SEATBELT","geometry":{"type":"Point","coordinates":[-75.0851,40.0331]}},{"objectid":2760540,"districtoccur":"18","age":51,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED BLOCKING THE CROSSWALK AT THE INTERSECTION OF 58TH ST. / CATHERINE ST. THE VEHICLE WAS PROHIBITING PEDESTRIANS FROM USING THE CROSSWALK. ALSO, THE VEHICLE HAD WINDOW TINT ON ALL WINDOWS OF THE VEHICLE MAKING IT DIFFICULT FOR POLICE TO SEE INSIDE THE VEHICLE. POLICE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK, NO WANTS. \nLISTED TCS ISSUED FOR VIOLATIONS 3353 A1IV PROHIBITIONS IN SPECIFIED PLACES AND 4524B WINDSHIELD OBSTRUCTIONS AND WIPERS.","geometry":{"type":"Point","coordinates":[-75.2393,39.9504]}},{"objectid":2790377,"districtoccur":"12","age":24,"mvc_reason":"POLICE OBSERVED LISTED VEH TRAVELING S/B ON 2100 SIMPSON ST WITH HEAVY WINDOW TINT ON ALL WINDOWS NOT ALLOWING FOR POLICE TO SEE INSIDE OF THE VEH. POLICE ACTIVATED OVERHEAD LIGHTS AND SIRENS AND DRIVER ABRUPTLY HOPPED THE SIDEWALK AND PARKED THE VEH. POLICE ASKED THE DRIVER FOR THE DOCUMENTS TO THE VEH AND THE MALES HANDS WERE VISIBLY SHAKING AND HE STATED THAT HE WAS NERVOUS BECAUSE HE WAS CURRENTLY ON TRIAL FOR A VUFA. POLICE ASKED THE MALE IF THERE WAS ANYTHING IN THE VEH THEY SHOULD KNOW AB","geometry":{"type":"Point","coordinates":[-75.2349,39.927]}},{"objectid":2788327,"districtoccur":"24","age":19,"mvc_reason":"POLICE OBSERVED ABOVE SLINGSHOT MOTORCRYCLE PARKED AND RUNNING  IN THE CROSSWALK AT THE INTERSECTION OF HELEN &AMP; SOMERSET. VEH STOPPED FOR PA MVC VIOLATION. NCIC/PCIC CHECK RAN ON VEH AND OPERATOR WITH NO WANTS. OPERATOR ADVISED TO MOVE AND RELEASED FROM LOCATION","geometry":{"type":"Point","coordinates":[-75.1215,39.9902]}},{"objectid":2786585,"districtoccur":"15","age":37,"mvc_reason":"POLICE OBS VEHICLE PARKED IN CROSSWALK FACING SOUTHBOUND ON CORNER OF TORRESDALE/PRINCETON.  QUERIED TAG THROUGH BMV AND RETURNED INSURANCE CANCELLATION.  STOPPED VEHICLE FOR INVESTIGATION. NCIC/PCIC NEGATIVE. VERBAL WARNING ISSUED.","geometry":{"type":"Point","coordinates":[-75.0398,40.0291]}},{"objectid":2782065,"districtoccur":"35","age":20,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING WESTBOUND ON STENTON AV WHEN THE OPERATOR USED THE RIGHT SHOULDER AND BIKE LANE TO OVERTAKE SEVERAL OTHER FORWARD MOVING VEHICLES. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1474,40.0499]}},{"objectid":2782415,"districtoccur":"35","age":21,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE WB ON 1700 STENTON AV. THE LISTED VEHICLE OVERTOOK ANOTHER VEHICLE USING THE BIKE LANE IN AN UNSAFE MANOR. NCIC/PCIC NO WANTS","geometry":{"type":"Point","coordinates":[-75.1474,40.0499]}},{"objectid":2781854,"districtoccur":"09","age":36,"mvc_reason":"ABOVE OPERATOR WAS TRAVELING EAST ON CHESTNUT ST IN BIKE AND BUS ONLY LANE. LANE IS MARKED BY SIGNS AND ON HIGHWAY IN WHITE WRITING.","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":2781862,"districtoccur":"09","age":41,"mvc_reason":"OPERATOR WAS TRAVELING IN RIGHT LANE CLEARLY MARKED ON HIGHWAY AND ON POLES BIKE AND BUS ONLY LANE.","geometry":{"type":"Point","coordinates":[-75.1674,39.9513]}},{"objectid":2781630,"districtoccur":"03","age":31,"mvc_reason":"VEHICLE OBSERVED IN OPERATION WITH EXPIRED PAPER TEMP TAG (9/25/2022), MAKING  IT UNREGISTERED. UPON INVEST, OPERATOR UNLICENSED. LISTED PEDESTRIAN WAS CHECKED FOR A VALID MD LICENSE AND PERMITTED TO OPERATE VEHICLE AND PARK IT NEARBY LEGALLY. OPERATOR ADVIDES TO PROPERLY REGISTER VEHICLE. WARNINGS ISSUED. BWC ACTIVE.","geometry":{"type":"Point","coordinates":[-75.1591,39.9191]}},{"objectid":2791724,"districtoccur":"15","age":21,"mvc_reason":"POLICE OBSERVED DRIVER OPERATING A MOTORCYCLE ON THE SIDEWALK ON 7400 FRANKFORD AVE. POLICE STOPPED VEHCILE IN THE REAR OF 3500 SHELMIRE. DRIVER HAD NO MOTORCYCLE LICENSE. MOTOTRCYLE ALSO HAS INSURANCE CANCELATION. POLICE LIVE STOPPED MOTORCYCLE. PPA TOOK MOTORCYCLE TO LOT 6. DRIVER GIVEN TICKETS","geometry":{"type":"Point","coordinates":[-75.0375,40.0399]}},{"objectid":2796963,"districtoccur":"09","age":30,"mvc_reason":"POLICE WERE TRAVELING WEST ON RIDGE AVE AND OBSERVED THE ABOVE VEHICLE TRAVELING IN FRONT OF IT WITH AN OBSCURED LICENSE PLATE. THE PLATE WAS COVERED BY A BIKE RACK. PCIC/NCIC CHECK CAME BACK WITH NEGATIVE RESULTS. VERBAL WARNING GIVEN","geometry":{"type":"Point","coordinates":[-75.162,39.968]}},{"objectid":2777518,"districtoccur":"02","age":16,"mvc_reason":"POLICE OBSERVED THE VEHILE TRAVELING WEST ON PRINCETON AVE AND DISREGUARTED A 4 WAY STOP SIGN AT THE INTERSECTION WITH LORETTO AVE. THE DRIVER ALSO DISREGUARTED A SECONDS STOP SIGN AT BRIGHTON ST. THE DRIVER DID NOT HAVE A DRIVERS LICENSE, ONLY A BRAZILAIN PASSPORT. TVR ISSUED. VEHICLE WAS LEGGAYLY PARKED ON THE SIDEWALK.","geometry":{"type":"Point","coordinates":[-75.0706,40.0489]}},{"objectid":2778425,"districtoccur":"18","age":39,"mvc_reason":"LISTED VEHICLE USED THE BIKE LANE TO IMPROPERLY PASS TRAFFIC ON THE RIGHT THEN PROCEED THROUGH A STEADY RED LIGHT SIGNAL AT THE INTERSECTION OF 56TH ST. / BALTIMORE AV. POLICE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK, NO WANTS.","geometry":{"type":"Point","coordinates":[-75.2337,39.9474]}},{"objectid":2813841,"districtoccur":"12","age":25,"mvc_reason":"POLICE OBERVED VEHICLE SOUTHBOUND ON 67TH ST AT A HIGH RATE OF SPEED WITH HEAVY TINT ON FRONT WINDSHIELD AND ALL WINDOWS. UPON GETTING BEHIND VEHICLE TH OPERATOR QUICKLY ATTEMPTED TO REVERSEINTO PARKING SPOT PULLING HIS BACK PASSENGER SIDE ONTO THE SIDEWALK. UPON APPROACH PASSENGER STATED THAT THEY WERE GOING TO DUNKIN DONUTS. WHEN ASKED WHY THEY PULLED OVER ON 2600 S. 67TH ST OPERATOR THEN STATED WE ARE TO DICKENS AVE AND COULDNT FIND ANY OPEN PARKING SPOTS EVEN THOUGH DICKENS IS MULTIPLE BLOCK","geometry":{"type":"Point","coordinates":[-75.2314,39.9191]}},{"objectid":2813845,"districtoccur":"12","age":21,"mvc_reason":"POLICE OBSERVED ABOVE VEH TRAVELING S/B ON S 67TH ST AND AS THE DRIVER WAS APPROACHING THE INTERSECTION HE TRAVELED WELL PAST THE STOPPING LINE OF THE STOP SIGN WITH A HEAVY NOSE-DIVE TO THE FRONT END OF HIS VEH AND POLICE COULD VISIBLY OBSERVE THE DRIVER LOOKING AT HIS PHONE DURING THE TIME HE WAS OBSERVED, NOT PAYING ATTENTION TO THE ROADWAY AND ALMOST STRIKING A PEDESTRIAN CROSSING THE INTERSECTION. VEH STOPPED, UPON FURTHER INVEST THE VEH HAD EXPIRED REGISTRATION SINCE 12/21. MALE ISSUED 1 T","geometry":{"type":"Point","coordinates":[-75.2314,39.9191]}},{"objectid":2813505,"districtoccur":"12","age":24,"mvc_reason":"POLICE OBERVED VEHICLE SOUTHBOUND ON 67TH ST AT A HIGH RATE OF SPEED WITH HEAVY TINT ON FRONT WINDSHIELD AND ALL WINDOWS. UPON GETTING BEHIND VEHICLE TH OPERATOR QUICKLY ATTEMPTED TO REVERSEINTO PARKING SPOT PULLING HIS BACK PASSENGER SIDE ONTO THE SIDEWALK. UPON APPROACH PASSENGER STATED THAT THEY WERE GOING TO DUNKIN DONUTS. WHEN ASKED WHY THEY PULLED OVER ON 2600 S. 67TH ST OPERATOR THEN STATED WE ARE TO DICKENS AVE AND COULDNT FIND ANY OPEN PARKING SPOTS EVEN THOUGH DICKENS IS MULTIPLE BLOCK","geometry":{"type":"Point","coordinates":[-75.2314,39.9191]}},{"objectid":2813808,"districtoccur":"17","age":25,"mvc_reason":"OBSERVED OPERATOR DRIVING EASTBOUND ON THE 3000 BLOCK OF NEW HOPE ST, OPERATOR TURNED ONTO THE 3000 BLOCK OF MIFFLIN ST. AND NEARLY HIT A PEDESTRIAN WHO WAS CROSSING AT THE INTERSECTION. OPERATOR DID STOP FOR POSTED STOP SIGN BUT PROCEEDED ON WHILE PEDESTRIAN WAS IN THE CROSSWALK.","geometry":{"type":"Point","coordinates":[-75.1962,39.9303]}},{"objectid":2808186,"districtoccur":"16","age":24,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE PARKED ON THE CROSSWALK OF 50TH AND PARRISH ST WITH EXPIRED STATE INSPECTION STICKERS. VEHICLE THEN PULLED OFF AND MADE A RIGHT TURN E/B ONTO PARRISH ST POLICE STOPPED FOR FURTHER INVESTIGATION UPON FURTHER INVESTIGATION LISTED VEHICLE REGISTRATION WAS EXPIRED SINCE 10/21 NCIC/PCIC NO WANTS TVR ISSUED.","geometry":{"type":"Point","coordinates":[-75.2189,39.9672]}},{"objectid":2807479,"districtoccur":"24","age":35,"mvc_reason":"MALE OBSERVED N/B ON FRANKFORD AVE, TURNING EAST ONTO ELKHART, WHERE HE CUT OFF A PEDESTRIAN CROSSING IN THE CROSSWALK.  VERBAL GIVEN.","geometry":{"type":"Point","coordinates":[-75.1137,39.9902]}},{"objectid":2818101,"districtoccur":"18","age":34,"mvc_reason":"POLICE OBSERVED ABV VEHICLE PARKED AND RUNNING WITH VEHICLE PARTIALLY IN CROSSWALK OF LISTED INTERSECTION FACING WESTBOUND. DRIVER APPEARED TO BE ASLEEP  IN DRIVER&APOS;S SEAT OF VEHICLE. VEHICLE WAS STOPPED FOR INVESTIGATION. NCIC/PCIC CHECK NEGATIVE. VEHICLE CLEARED BY INVESTIGATION. POLICE ADVISED ML TO PARK VEH LEGALLY","geometry":{"type":"Point","coordinates":[-75.2349,39.9546]}},{"objectid":2819278,"districtoccur":"12","age":62,"mvc_reason":"POLICE OBSERVED THE LISTED VEH TRAVEL ON LINDBERGH BLVD IN THE BIKE LANE TO OVERTAKE SEVERAL VEHICLES AT THE INTERSECTION.NCIC/PCIC BMV NO WANTS.LISTED VEH CBI.LISTED OPERATOR ADVISED","geometry":{"type":"Point","coordinates":[-75.2196,39.9274]}},{"objectid":2818222,"districtoccur":"12","age":55,"mvc_reason":"POLICE OBSERVED ABOVE VEHICLE OVERTAKE MULTIPLE VEHICLES USING THE BIKE LANE AND SHOULDER OF THE 1 LANE ROAD AT ABOVE LOCATION. POLICE INVESTIGATE NCIC/PCIC NEG RESULTS. VERBAL WARNING.","geometry":{"type":"Point","coordinates":[-75.2196,39.9274]}},{"objectid":2815076,"districtoccur":"24","age":28,"mvc_reason":"VEHICLE OBSERVED PASSNIG OVER SOLID WHITE INTERSECTION LINE AT A STEADY RED LIGHT FACING WEST ON SOMERSET AND EMERALD. THE VEHICLE ENTERED THE CROSS WALK, CREATING A HAZARD TO PEDESTRIANS CROSSING. THE VEHICLE WAS STOPPED FOR INVESTIGATION. NO WANTS PER NCIC/PCIC","geometry":{"type":"Point","coordinates":[-75.1207,39.9892]}},{"objectid":2802692,"districtoccur":"22","age":19,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE TRAVELING N/B ON 16TH ST WHICH IS A ONE LANE STREET AND AGGRESSIVELY PASS A VEHICLE WITH NO REGARD FOR THE OTHER VEHICLES SAFETY OR NEARBY PEDESTRIANS&APOS; SAFETY. VERBAL WARNING. NCIC/PCIC CHECKED W/NEG RESULTS","geometry":{"type":"Point","coordinates":[-75.1611,39.9795]}},{"objectid":2800444,"districtoccur":"07","age":23,"mvc_reason":"VEHICLE PASSED STOPED VEHICLES ON THE RIGHT TRAVELING IN BIKE LANE AND STOP  FOR INVEST, VERBAL","geometry":{"type":"Point","coordinates":[-75.0307,40.0981]}},{"objectid":2831665,"districtoccur":"26","age":29,"mvc_reason":"POLICE OBSERVED VEHICLE TRAVELING NORTHBOUND ON 7TH ST APPROACHING DIAMOND ST DISREGARD A STOP SIGN BY NOT COMING TO A COMPLETE STOP BEFORE THE CROSSWALK. VEHICLE STOPPED FOR MVC VIOLATION. NCIC/PCIC NO WANTS. VERBAL WARNING GIVEN.","geometry":{"type":"Point","coordinates":[-75.146,39.9824]}},{"objectid":2832140,"districtoccur":"39","age":20,"mvc_reason":"POLICE OBSERVE ABOVE VEHICLE TRAVELING S/B ON THE 2800 BLOCK OF 26TH ST WITHOUT ITS HEAD LIGHTS ON FURTHER BECOMING A SAFETY HAZARDS FOR PEDESTRIANS AND OTHER PASSERBYS. POLICE STOP VEHICLE FOR INVESTIGATION, ADVISE OPERATOR. OCCUPANTS AND VEHICLE RAN NCIC/PCIC, NO WANTS. CBI","geometry":{"type":"Point","coordinates":[-75.1722,39.9978]}},{"objectid":2845287,"districtoccur":"16","age":22,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE DRIVING SB AT ABOVE LOCATION W/ HEAVY TINTS TO VEHICLE WINDOWS PROHIBITING INSIDE VIEW OF VEHICLE. VEHICLE WAS ALSO DRIVING AT AN UNSAFE HIGH RATE OF SPEED MAKING CONDITIONS FOR DRIVERS AND PEDESTRIANS HAZARDOUS. VEHICLE STOPPED FOR MVC VIOLATION. MALE PROVIDED HIS REGISTRATION, AND DL. DURING INVESTIGATION, POLICE NOTICED REGISTRATION WAS NOT SIGNED. POLICE WENT BACK TO MALE TO VERIFY MALE HAD ACTIVE INSURANCE. MALE PROVIDED INSURANCE ON PHONE. MALE WAS ISSUED TVR","geometry":{"type":"Point","coordinates":[-75.217,39.9591]}},{"objectid":2825803,"districtoccur":"15","age":38,"mvc_reason":"POLICE ABOVE VEHICLE TRAVELING WESTBOUND ON 2800 TYSON AVE. BEING DRIVEN BY LISTED DRIVER ATTEMPT TO PASS 2 VEHICLES ON THE RIGHT SIDE THAT WERE STOPPED ON THE HIGHWAY TO TURN INTO A PARKING LOT. WHILE PASSING THE STOPPED VEHICLES LISTED VEHICLE DROVE IN A MARKED BIKE LINE ALMOST STRIKING MULTIPLE PEDESTRIANS ON BIKES. VEHICLE WAS STOPPED AND DURING INVESTIGATION DRIVER LICENSE WAS SUSPENDED AND VEHICLE REGISTRATION WAS EXPIRED. NCIC/PCIC NO WANTS ON DRIVER OR VEHICLE.","geometry":{"type":"Point","coordinates":[-75.0581,40.0399]}},{"objectid":2824877,"districtoccur":"18","age":27,"mvc_reason":"VEHICLE WAS SEEN TRAVELING AT A HIGH RATE OF SPEED, NORTH IN THE CENTER TURNING LANE ON 52ND ST TO AVOID TRAFFIC. BOTH VEHICLE AND PEDESTRIAN TRAFFIC IS BUSY AT THIS TIME AND THE VEHICLE CAUSED A HAZARD TO BOTH ENTITIES. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC CHECKED NEGATIVE RESULTS. VERBAL WARNING GIVEN CBI.","geometry":{"type":"Point","coordinates":[-75.2261,39.9545]}},{"objectid":2849396,"districtoccur":"25","age":19,"mvc_reason":"POLICE OBSERVED LISTED VEHICLE DRIVE OVER THE SIDEWALK AND OVER THE GRASS FROM 1000 W LYCOMING ST TO ENTER THE PARK. PARK GATE WAS LOCKED AND CLOSED PREVIOUSLY AT 1000 W LYCOMING ST. VEHICLE STOPPED FOR INVESTIGATION, RECORDS/WANTS CHECK CONDUCTED ON OPERATOR AND (2) PASSENGERS WITH NEGATIVE RESULTS. OPERATOR ISSUED VERBAL WARNING ONLY.","geometry":{"type":"Point","coordinates":[-75.1447,40.0141]}},{"objectid":2863075,"districtoccur":"12","age":18,"mvc_reason":"POLICE OBSERVED THE LISTED VEH OVERTAKE SEVERAL VEHICLES ON LINDBERGH BLVD VIA BIKE LANE AT A HIGH RATE OF SPEED.AS A RESULT THE VEHICLE WAS STOPPED FOR INVESTIGATION.NCIC/PCIC BMV NO WANTS.LISTED VEH CBI.OPERATOR ADVISED","geometry":{"type":"Point","coordinates":[-75.2271,39.9134]}},{"objectid":2865938,"districtoccur":"18","age":34,"mvc_reason":"VEHICLE WAS OBSERVED BY POLICE N/B ON 58TH ST AT A HIGH RATE OF SPEED AND UTILIZING THE MARKED BIKE LANE. THE VEHICLE THEN APPEARED IT WAS GOING TO PASS A VEHICLE ON THE LEFT UNTIL POLICE PULLED BEHIND THE VEHICLE. THE VEHICLE ALSO HAD SUN SCREENING ON THE FRONT WINDOWS. VEHICLE STOPPED FOR INVESTIGATION. NCIC/PCIC/BMV, NO WANTS. MALE WARNED AND RELEASED","geometry":{"type":"Point","coordinates":[-75.2373,39.9501]}},{"objectid":2863138,"districtoccur":"06","age":38,"mvc_reason":"POLICE OBSERVED THE ABV VEH TRAVELING N/B ON 3 RD STREET JUST BEFORE BROWN STREET. VEH DID NOT COME TO A COMPLETE STOP AT STOP SIGN ALSO DID NOT YIELD TO PEDESTRIAN TRAFFIC CROSSING IN MARKED CROSS WALK. VEH STOPPED AT 900 N 3RD STREET FOR INVESTIGATION. VEH CLEARS NCIC/PCIC CHECK HOWEVER BOTH DRIVER AND PASSENGER HAVE SUSPENDED LICENSES. POLICE ISSUED TICKET FOR SUSPENDED LICENSE TO DRIVER. 3RD PERSON CALLED TO AREA TO CONTINUE DRIVING VEH BY DRIVER.","geometry":{"type":"Point","coordinates":[-75.1431,39.9625]}},{"objectid":2863517,"districtoccur":"12","age":54,"mvc_reason":"POLICE OBSERVED VEHICLE RUNNING, KEYS IN IGNITION SITTING ON BIKE LANE DOUBLE PARKED. POLICE ADVISED MALE TO MOVE VEHICLE TO PROPER SPOT SO BICYCLES COULD TRAVEL WITHOUT HAZARD. OPERATOR WAS GIVEN A VERBAL WARNING. NCIC/PCIC CAME BACK WITH NEGATIVE RESULTS. CBI.","geometry":{"type":"Point","coordinates":[-75.2412,39.8975]}},{"objectid":2865677,"districtoccur":"14","age":20,"mvc_reason":"POLICE OBSERVED THE ABOVE LISTED DEFENDANT TRAVELING W/B ON 600 UPSAL ST. WHEN THE DEFENDANT WENT AROUND A VEHICLE AND INTO THE BIKE LANE /RIGHT SHOULDER OF THE ROAD  APPROX MID BLOCK. DURING THE VEHICLE INVESTIGATION THE MALE WAS ARRESTED FOR VUFA VIOL. SEE ADDITIONAL","geometry":{"type":"Point","coordinates":[-75.1719,40.0613]}},{"objectid":2915563,"districtoccur":"35","age":19,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING SOUTHBOUND ON THE 5300 BLOCK OF CAMAC ST WHICH IS ONE WAY NORTHBOUND. WHEN POLICE TURNED DOWN THE STREET, THE OBSERVED THE VEHICLE LEAVE THE HIGHWAY, ONTO THE SIDEWALK WITH THE VEHICLE&APOS;S LIGHTS OFF. THE DRIVER FLED FROM THE VEHICLE AND WAS APPREHENDED A SHORT TIME LATER IN THE REAR OF 5247 N 13TH ST.","geometry":{"type":"Point","coordinates":[-75.1428,40.0339]}},{"objectid":2922819,"districtoccur":"25","age":45,"mvc_reason":"POLICE WAS TRAVELING WEST BOUND ON LISTED LOCATION WHEN OBSERVED THE BLACK HONDA BLOCKING THE SIDEWALK. POLICE RUN THE TAG THROUGH NCIC/PCIC NO WANTS BUT VEHICLE CAME BACK WITH AN EXPIRED REGISTRATION FROM 07-2022. VEHICLE WAS STOPPED FOR INVESTIGATION. DURING THE INVESTIGATION WHEN POLICE APPROACHED THE OPERATOR FROM THE DRIVER SIDE POLICE OBSERVED NARCOTICS ON THE DRIVER&APOS;S SEAT BETWEEN THE OPERATORS LEG. OPERATOR WAS ARRESTED FOR FOR NARCOTICS AND TRANSPORTED TO 25TH DISTRICT FOR PAD SERV","geometry":{"type":"Point","coordinates":[-75.1383,39.9981]}},{"objectid":2945991,"districtoccur":"17","age":29,"mvc_reason":"POLICE OBSERVED AN OCCUPIED GOLD TOYOTA CAMRY PARKED ON THE SIDEWALK AT 1550 S ETTING ST. VEHICLE WAS RAN THROUGH NCIC/PCIC  AND WAS IN STOLEN STATUS. VEHICLE WAS OCCUPIED BY ONE MALE IN THE DRIVERS SEAT. OCCUPANT HAD THE KEYS TO THE VEHICLE IN HIS POSSESSION. OCCUPANT WAS PLACED UNDER ARREST","geometry":{"type":"Point","coordinates":[-75.1902,39.9335]}},{"objectid":2969112,"districtoccur":"35","age":28,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING EASTBOUND ON STENTON AV USE THE BIKE/TURNING LANE TO OVERTAKE OTHER FORWARD MOVING  VEHICLES AT 18TH ST CREATING A HAZARD. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1408,40.0473]}},{"objectid":2969114,"districtoccur":"35","age":66,"mvc_reason":"DRIVER OBSERVED OPERATING VEHICLE TRAVELING EASTBOUND ON STENTON AV USING THE BIKE/PARKING TO OVERTAKE SEVERAL OTHER FORWARD MOVING VEHICLES. VERBAL WARNING GIVEN. CBI","geometry":{"type":"Point","coordinates":[-75.1408,40.0473]}}]
