[
  {
    "id": "project_1",
    "number": "01",
    "title": "Dynamic Lifeline",
    "type": "Landscape",
    "keyword": "Ecological Planning | Low-intervention",
    "time": "2022-06",
    "description": "This project aims to create various types of corridors to ensure the safe traversal of sloths across three major habitat types in Costa Rica. The development model transitions from a more human-intervened approach to one that is increasingly adapted to natural conditions.",
    "folder": "assets/project_1",
    "url": null
  },
  {
    "id": "project_2",
    "number": "02",
    "title": "Mufu New Life",
    "type": "Landscape",
    "keyword": "Mine Restoration | Participatory Planting",
    "time": "2021-07",
    "description": "During the design of mountain architecture, the project provides planting guidelines required for the ecological restoration of the mine and replaces traditional planting methods with a participatory approach that engages residents.",
    "folder": "assets/project_2",
    "url": null
  },
  {
    "id": "project_3",
    "number": "03",
    "title": "Break the Wall",
    "type": "Landscape",
    "keyword": "Prison Renovation | Self-governing",
    "time": "2021-10",
    "description": "I design a new prison layout and established a model for beneficial coexistence with the community and Neighborhood Association, providing a platform for different groups to share and express their ideas.",
    "folder": "assets/project_3",
    "url": null
  },
  {
    "id": "project_4",
    "number": "04",
    "title": "Reshape the Farmland",
    "type": "Landscape",
    "keyword": "Waterfront Landform | Resilient System",
    "time": "2021-02",
    "description": "This design creates diverse waterfront terrains that enable users to freely choose various activities while accommodating potential future flooding.",
    "folder": "assets/project_4",
    "url": null
  },
  {
    "id": "project_5",
    "number": "05",
    "title": "The World of Algae",
    "type": "Landscape",
    "keyword": "Concept Design | Industry Chain | Future City",
    "time": "2020-06",
    "description": "I design a comprehensive chain for the production, processing, and utilization of algae products. This approach allows residents to envision diverse futures for the city, shaped by their level of acceptance and engagement with these innovations.",
    "folder": "assets/project_5",
    "url": null
  },
  {
    "id": "project_6",
    "number": "06",
    "title": "Renew Suzhou Creek",
    "type": "Landscape",
    "keyword": "Waterfront Renovation | Practical Project",
    "time": "2022-02",
    "description": "During my internship at SWA, I joined the project team during the schematic design phase and was responsible for the detailed design and modification of specific nodes. The project aimed to preserve and celebrate the historical heritage of Suzhou Creek while revitalizing its waterfront as a vibrant urban public space.",
    "folder": "assets/project_6",
    "url": null
  },
  {
    "id": "project_7",
    "number": "07",
    "title": "Explore National Parks",
    "type": "Web Design",
    "keyword": "Story Map | Visitor Guideline",
    "time": "2024-10",
    "description": "This story map introduces some of the most famous national parks, offering a resource for learning about them. It also lays the groundwork for future additions, such as detailed park information, tools for visit planning, options for sharing experiences, and even comparisons of different parks.",
    "folder": "assets/project_7",
    "url": null
  },
  {
    "id": "project_8",
    "number": "08",
    "title": "Yellowstone POI Guide",
    "type": "Web Design",
    "keyword": "Interactive Dashboard | Visitor Information",
    "time": "2024-12",
    "description": "This project is a dashboard designed for visitors to Yellowstone National Park. It provides essential details about each Point of Interest (POI), including its location, name, type, subcategory, and estimated travel time. Additionally, it enables visitors to select their preferred POIs and plan their trips efficiently.",
    "folder": "assets/project_8",
    "url": null
  },
  {
    "id": "project_9",
    "number": "09",
    "title": "Transport Info Hub",
    "type": "Web Design",
    "keyword": "Integrated Information Platform",
    "time": "2024-08",
    "description": "This project aims to develop an Integrated Transportation Information Platform for the Yangpu District Government as a key component of Shanghai's 'One Network Management' initiative. The platform integrates basic information and commonly used analyses across various transportation modes, along with impact evaluation models for major engineering projects.",
    "folder": "assets/project_9",
    "url": null
  },
  {
    "id": "project_10",
    "number": "10",
    "title": "Manage Shared Bikes",
    "type": "Web Design",
    "keyword": "Data Display Screen | Bluetooth Sniffing",
    "time": "2024-06",
    "description": "The platform uses Bluetooth sniffing and video monitoring to detect shared bike misuse and automatically assigns tasks to companies for timely resolution.",
    "folder": "assets/project_10",
    "url": null
  },
  {
    "id": "project_11",
    "number": "11",
    "title": "30-Day Map Challenge",
    "type": "Data Visualization",
    "keyword": "Vector Mapping | Raster Analysis",
    "time": "2023-11",
    "description": "This project involves exploring maps across various scales, utilizing diverse datasets, and focusing on different topics. Each topic follows a structured process, including brainstorming, identifying data sources, data processing, analysis, and creating final graphics.",
    "folder": "assets/project_11",
    "url": null
  },
  {
    "id": "project_12",
    "number": "12",
    "title": "Locate Bike Stations",
    "type": "Data Visualization",
    "keyword": "Cycling Trends | Multi-Demand",
    "time": "2023-10",
    "description": "This project analyzes IndeGo bike-sharing data in Philadelphia, focusing on the distribution and usage patterns of existing bike stations. Using ArcGIS for comprehensive analysis, it incorporates diverse demand characteristics to identify optimal locations for new IndeGo stations.",
    "folder": "assets/project_12",
    "url": null
  },
  {
    "id": "project_13",
    "number": "13",
    "title": "Empower Chinatown",
    "type": "Data Visualization",
    "keyword": "Public Engagement | Policy Research",
    "time": "2024-05",
    "description": "This project aims to protect Chinatown's cultural heritage while fostering community resilience, accessibility, and safety. It strengthens local businesses and institutions, connecting Chinatown to Philadelphia's broader Asian American communities.",
    "folder": "assets/project_13",
    "url": null
  },
  {
    "id": "project_14",
    "number": "14",
    "title": "Lac Rose Plan",
    "type": "Data Visualization",
    "keyword": "Tourist Town | Forest Conservation",
    "time": "2024-11",
    "description": "This project begins with organizing and visualizing data resources from the Dakar region in Senegal. Combining insights from field research and community meetings, it provides strategic recommendations for urban development around Lac Rose, balancing nature conservation with urban growth while addressing the needs of both local residents and tourists.",
    "folder": "assets/project_14",
    "url": null
  },
  {
    "id": "project_15",
    "number": "15",
    "title": "Police Patrol Locations",
    "type": "Spatial Analysis",
    "keyword": "Optimization | MCLP | P-Median",
    "time": "2024-05",
    "description": "This study optimizes police patrol locations in Philadelphia by analyzing spatial-temporal crime severity patterns. Using MCLP and P-Median models, it identifies strategies to balance coverage and response time, improving public safety.",
    "folder": "assets/project_15",
    "url": null
  },
  {
    "id": "project_16",
    "number": "16",
    "title": "Bike & Subway Usage",
    "type": "Spatial Analysis",
    "keyword": "Correlation Analysis | Time Series",
    "time": "2024-04",
    "description": "This study investigates the relationship between bike-sharing and subway ridership in the MBTA core area, revealing a positive correlation that varies across different times of the day.",
    "folder": "assets/project_16",
    "url": null
  },
  {
    "id": "project_17",
    "number": "17",
    "title": "Predict Bike Ridership",
    "type": "Spatial Analysis",
    "keyword": "Machine Learning | Time Lag",
    "time": "2024-05",
    "description": "This project analyzes Philadelphia's Indego bike-sharing system to explore how time, location, and weather affect trip patterns. It focuses on strategies to balance bike supply and demand, comparing efficient truck-based redistribution with cost-effective rider incentives to enhance system sustainability and accessibility.",
    "folder": "assets/project_17",
    "url": null
  },
  {
    "id": "project_18",
    "number": "18",
    "title": "Predict Gentrification",
    "type": "Spatial Analysis",
    "keyword": "K-Means | Logistic Regression",
    "time": "2024-06",
    "description": "This project uses logistic regression to predict gentrification in Chicago, focusing on census tract data. It identifies risks in minority areas with rising incomes and education, supporting targeted policies and resource allocation.",
    "folder": "assets/project_18",
    "url": null
  }
]